{
	"schema": "https://raw.githubusercontent.com/TheGiddyLimit/homebrew/master/_schema-fast/homebrew.json",
	"_meta": {
		"sources": [
			{
				"json": "haunt-trilogy",
				"abbreviation": "pbp_ht",
				"full": "PB Publishing The Haunt Trilogy",
				"authors": [
					"PB Publishing"
				],
				"convertedBy": [
					"deltadave"
				],
				"version": "1.0",
				"url": "https://github.com/deltadave/5e_homebrew",
				"targetSchema": "1.0.0"
			}
		],
		"dateAdded": 1662833146,
		"dateLastModified": 1662833146
	},
	"adventure": [
		{
			"name": "The Haunt Trilogy",
			"id": "pbp_ht",
			"source": "pbp_ht",
			"group": "homebrew",
			"level": {
				"start": 1,
				"end": 6
			},
			"published": "2017-10-31",
			"storyline": "The Haunt",
			"coverUrl": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20001.jpg",
			"contents": [
				{
					"name" : "The Haunt",
					"headers" : [
						"Credits",
						"Introduction",
						"Montarthas Manor",
						"Epilog",
						"Appendix: Maps"
					],
					"ordinal": {
						"type": "part",
						"identifier": "1"
					}
				},
				{
					"name" : "The Haunt 2",
					"headers" : [
						"Credits",
						"Introduction",
						"St. Greycastle's Hospital",
						"Not So Fast",
						"Appendix"
					],
					"ordinal": {
						"type": "part",
						"identifier": "2"
					}
				},
				{
					"name" : "The Haunt 3",
					"headers" : [
						"Chapter 1: Introduction",
						"Chapter 2: The Space Between",
						"Chapter 3: The Quests",
						"Chapter 4: Endings",
						"Denouement",
						"Appendix"
					],
					"ordinal": {
						"type": "part",
						"identifier": "3"
					}
				}
			]
		}
	],
	"adventureData": [
		{
			"id": "pbp_ht",
			"source": "pbp_ht",
			"data": [ 
				{
					"type": "section",
					"name": "The Haunt",
					"entries": [
						{
							"type": "image",
							"href": {
								"type": "external",
								"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20001.jpg"
							}
						},
						{
							"type" : "entries",
							"name" : "Credits",
							"entries" : [
								"{@b Author}: Phil Beckwith (P.B. Publishing)",
								"{@b Layout}: Phil Beckwith (P.B. Publishing)",
								"{@b Editor}: Ken Carcas",
								"{@b Cover Artist}: Pexles.com",
								"{@b Interior Illustrators}: Phil Beckwith (P.B. Publishing) & Michael Wolmarans (used with permission)",
								"{@b Battle Map Cartographer}: Chris Bissette (loottheroom.uk)",
								"{@b Playtesters}: Tanya Jackson, Ryan Matthews, Anthony Petti, and Chris Bissette",
								"{@b Special Thanks to}: My Wife Katie, Harrison O’Sullivan, Patrick E. Pullen, Dungeon Master’s Guild Fanclub Facebook Page, and finally to everyone who has bought (and will buy) this adventure."
							]
						},
						{
							"type" : "entries",
							"name" : "Chapter 1: Introduction",
							"entries" : [
								{
									"type": "entries",
									"name": "Running this Adventure",
									"entries": [
										"The Haunt is a one-shot Dungeons & Dragons 5th Edition horror themed fantasy adventure. This is a challenging adventure for 4th level player groups of 3 to 5 players with some deadly encounters. However, ideally The Haunt is tailored as a medium difficulty adventure with plenty of excitement and danger for a 5th level party of 4 to 5 players.",
										"This adventure is essentially a dungeon crawl, set in a haunted mansion. However the aim is not to just have the players move from room to room, killing creatures, and disarming traps. This adventure has a focus for story and flavor.",
										"The Haunt is split into three chapters; Chapter 1, this chapter, is the introduction. Chapter 2 focuses on the Ground Floor, the Basement and the Second Floor of the manor. Chapter 3 contains the epilogue to complete the adventure, and provides guidance for further adventuring.",
										"To run this adventure you need; The Dungeons and Dragons 5th Edition Players Handbook, the Dungeons and Dragons 5th Edition Monster Manual and the content supplied within this adventure.",
										"It is highly advised to run this adventure with dim lighting (or candle-lit), spooky organ music, and have a creepy children's lullaby ready to play. This ensures the right vibe is achieved, and provide maximum satisfaction for you, the DM, and your players.",
										{
										"type" : "entries",
										"name" : "Character Advancement and Milestone Leveling",
										"entries": [
											"This adventure is designed to utilize the Milestone leveling system, by which it is expected that the characters start at level 4 at the beginning of the adventure, and upon defeating the Night Hag Gertrude, advance directly into level 5.",
											"This is only a suggestion, however, and you, as the DM, are in no way forced to use this method. This adventure runs perfectly fine with Experience Points based leveling, and you are encouraged to use XP if it is a better fit for you and your playing group."
											]
										},
										{
											"type" : "entries",
											"name" : "Boxed Text",
											"entries": [
												"This adventure includes boxed text to assist those Dungeon Masters who like to have a description of a scene or location. The use of boxed text is by no means required; many great Dungeon Masters avoid the use of boxed text and instead feel more comfortable describing the action in their own words. You should consider what works best for you and your group. If you choose not to read aloud any of the text provided, you should at least paraphrase the information to keep the players aware of their environment."
											]
										},
										{
											"type" : "entries",
											"name" : "Setting and Location",
											"entries": [
												"The Haunt is designed to be a drop and play adventure that can fit into any setting and any campaign."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Background",
									"entries": [
										"In ages past, there once stood a small city in these parts.",
										"The city, being subject to constant orc attacks, maintained a sufficiently defensive militia to ward away such attacks as they occurred. This militia stood for centuries, and many commanding officers came and went throughout the years.",
										"General Oscar Montarthas, known for being fair, firm and stern towards his men, was the last to command this post.",
										"Not long from retirement, General Montarthas employed an advisor, Gertrude, who would assist the General in decision making with the forthcoming yearly orc invasions.",
										"This advisor was, in fact, an evil night hag, who planned to ruin the city and use its population to feed from the power of their life force. This was achievable by seducing the General, and corrupting his heart with a powerful green emerald.",
										"The night hag firstly fed off the life force of the manor's residents, sucking them dry. As her power grew, the population from the city were next to fall. Heavily undermanned, the city ultimately fell to the orcs and was abandoned, with only the manor standing the test of time.",
										"To this day, the manor is the only still standing building to be seen for miles around.",
										"Since that time, Gertrude has fed from the unfortunate passers-by who happen to accidentally wander into Montarthas Manor!"
									]
								},
								{
									"type": "entries",
									"name": "Adventure Hooks",
									"entries": [
										"The adventure does not have any setting specific adventure hooks though the following are provided as suggestions to hook your players and campaign into this adventure:",
										{
										"type": "list",
										"items": [
											"The PCs have been approached by an elderly wizard who offers them a handsome reward for rescuing his apprentice who has entered but not returned from Montarthas Manor. This was two tenday ago.",
											"The PCs have heard rumor of a powerful necromantic jewel which lies in the heart of the manor. They hear it is worth a fortune to the right people.",
											"People have been going missing when traveling in the areas around the manor. The local town's mayor has offered some freelance adventuring work to anyone who is brave enough to enter and investigate the manor.",
											"A great evil emanates from the grounds of the manor; all good aligned heroes feel a persistent urge to remove that evil from the world.",
											"The PCs have been traveling a long and barren road for many days. As the winds blow a blithering gale throughout the area, the heroes long for a reprieve.",
											"Craving a warm bowl of food, an ale, and a warm place to shelter, they come upon Montarthas Manor, which seems more hospitable as any other place around these parts."
											]
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Chapter 2: Montarthas Manor",
							"entries": [
								"This mansion was once the home to the appointed General who commanded a militia based in this area long ago. At the time of the General's death, the manor was cursed by a powerfully evil Night Hag, known simply as, Gertrude. It is said that a brilliant green emerald, imbued with a great and ancient power, lies at the heart of Montarthas Manor; this is rumored to be the source of the manor's evil.",
								{
									"type" : "section",
									"name" : "The Ground Floor",
									"entries" : [
										"As the heroes approach the mansion; read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"As you approach the mansion you notice that the blackness of the stone is unnatural and almost tainted. The air grows thick, and what little light that the night gives somehow becomes duller and duller the closer that you get to the evil dwelling."
											]
										},
										{
											"type": "entries",
											"name": "1. Manor Entryway",
											"entries": [
												"Read or paraphrase the following if the heroes enter via the front door:",
												{
													"type": "insetReadaloud",
													"entries": [
														"You stand in near darkness. Before you are a set of steps that lead to the high archways that govern the entryway into the mansion proper. A large set of dark oak double doors sit patiently closed awaiting your advance. You notice small crystal blue eyes peering at you from behind a dark window beside the doorway."
													]
												},
												"See Area 3 for a more detailed reference for the eyes.",
												"These doors do not open, no matter how well the PC rolls for strength or thieves tools checks. They are supernaturally held tight. The doors open only on their own accord, once the heroes give up, turn away, or have been attempting to open them for more than a few minutes.",
												"On a successful {@b {@dc 13} Intelligence ({@skill Arcana})} check, the adventurers notice that there is an eerie essence that surrounds the doors, as if they themselves do not wish to be opened.",
												"Once the heroes decide to give up on the door and turn away from it read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"As you turn from the door you hear a loud 'creeeeaaak' from behind you. You look back only to see that the doors have opened, on their own accord; those onlooking crystal blue eyes now gone. The looming black space behind the entryway stares menacingly at you, inviting you into its abode."
													]
												}
											]
										},
										{
											"type" : "entries",
											"name": "2. The Foyer",
											"entries": [
												"{@b This room is trapped;} the trap is triggered whenever a living soul passes beyond the line between the two statues (see Ground Floor map). These, of course, are {@creature gargoyle||gargoyles} and each of them animates as soon as the trap is triggered. They fight to the death.",
												"Read or paraphrase the following when the heroes enter this room:",
												{
													"type": "insetReadaloud",
													"entries": [
														"The entry foyer has a large open space with a floor of black marble. Two imposing looking demonic statues stand to either side of the foyer as if motionlessly keeping watch over the empty room."
													]
												}
											]
										},
										{
											"type" : "entries",
											"name" : "3. The Stairwell Waiting Room",
											"entries": [
												"This room is a raised platform, a step up from the foyer and the tea room, and is situated at the bottom of the stairwell.",
												"There is a cushioned sitting couch in the south-west corner of the room, it has an old worn children's doll laying on it, a successful {@dc 10} {@b Intelligence ({@skill Investigation})} check reveals the eyes of the doll are strangely similar to those seen peering through the window before entering the mansion from the front door.",
												"In the north-east corner is the stairwell climbing up to {@b The Second Floor}, or down to {@b The Basement}. A portcullis blocks the way up until the party has explored at least 5 rooms on the Ground Floor (in total), it then opens by itself. Situated to the right of the stairwell is a statue of a griffon sitting atop of a pedestal holding up one of its front talons in a \"knocking\" type stance.",
												"The griffon statue is an opening mechanism for secret door system 1 (S1). Pulling down on the griffon's raised talon activates 2 secret doors. One opens, while the opposite closes, and vice versa.",
												"This means that the two doors are never be open at the same time, and to get through the secret passage, the adventurer needs someone or something to pull the lever twice.",
												"{@b Note}: This mechanism and secret door system is designed to split the party and isolate PCs to add to the suspense of the haunted mansion.",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20003.png"
													}
												}
											]
										},
										{
											"type" : "entries",
											"name": "4. The Tea Room",
											"entries": [
												"The mansion's tea room is a large sunken room with a fireplace and hearth situated in the north-west corner. There are three small round tables for guests to sit and consume tea and other assorted refreshments. A glass chandelier hangs on a sturdy chain from high above.",
												"{@b Event}. As the heroes move through the room, the chandelier falls and crashes just behind them, the supporting chain swinging with movement.",
												"{@b S1}: This is a secret door; it is activated by pulling the griffon statue's raised claw (a leaver) down ({@b area 3}). This opens and closes it. When the heroes first enter the mansion, the door is closed and looks like a wall; a {@b {@dc 13} Wisdom ({@skill Perception})} check successfully spots the secret door.",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20004.png"
													}
												}
											]
										},
										{
											"type" : "entries",
											"name": "5. The Dining Room",
											"entries": [
												"This is the General's dining room, and it has an open entrance to it via the tea room (area 4). Standing from outside the entrance the heroes simply see an empty old dusty dinner table.",
												"As soon as they step beyond the entrance for the first time, the place comes alive as the heroes step into the middle of a ghostly dinner party.",
												"When the heroes step up the steps and into the dining room for the first time, read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries" : [
														"As you step up into the dining room from the sunken tea room, the air grows warm. Suddenly the room comes to life, as ghostly apparitions appear seated at the once empty table.",
														"A large dinner party is being held it seems, as a roasted hog materialises, along with plates of all varieties of food. Jugs of foaming ale are being shared between ghostly companions.",
														"A large spectral human man stands at the head of the table, saying nothing, a serious scowl and frown is cemented over his face as he overlooks his guests who seem to be enjoying themselves."
													]
												},
												"The ghosts pay no heed to the party providing they do not interact with them. If the adventurers leave the room without interacting with anything, the dinner party simply disappears as soon as they step foot into another room.",
												"If the heroes attempt to interact with any of the ghostly dinner party, read or paraphrase the following.",
												{
													"type": "insetReadaloud",
													"entries": [
														"The room abruptly becomes quiet, all talking and laughter has ceased. Every ghost in the room is now facing you when the man at the head of the table rushes toward you, floating right through the hard wooden dining table. \"{@b You should not be here! LEAVE THIS PLACE!!!!}\" He screams as he rushes closer.",
														"Then as quick as the party had started, the room is empty, dark and cold again. The ghosts are nowhere to be seen, and there is no sign of the man who had rushed at you."
													]
												},
												"If the heroes linger here (for more than 5 minutes in-game time), the room engulfs itself in flames, these are apparitions also.",
												"Have the heroes roll a {@b {@dc 15} Wisdom} saving throw; failure results in 1d4 psychic damage per round that their heroes stay in the room.",
												"Once the heroes leave the room, they notice that the flames disappear as quickly as they began. Nothing appears to be burnt in the room, and the heroes don't appear to have burns to their bodies."
											]
										},
										{
											"type" : "entries",
											"name": "6. The Ballroom",
											"entries": [
												"The ballroom was once the center of entertainment for the General and his distinguished guests. Many nights were spent drinking, dancing and laughing. In the end, though, this became the place where his world started to fall apart.",
												"As the heroes enter the ball room, read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"As you enter the large double doors, a large room opens before you. A large chandelier hangs from the high ceiling, and an old dance floor stretches before you. A large glass folding door opens onto an alfresco area on the east wall.",
														"Materializing from thin air you see the man who had rushed at you, ending the ghostly dinner party in the dining room. He seems younger somehow, as if this is a vision into an earlier time in his life.",
														"A beautiful woman enters from nothingness, dressed in a flowing black gown, her eyes dark and dangerous. He holds her and looks into those eyes, and she looks back into his.",
														"\"{@b We will disappear, just the two of us, my love}\" the man says dreamily.}",
														"\"{@b Oh, General Montharthas, but what of your wife? And we have work to do.}\" She reminds him.",
														"\"{@b Never mind her, she will cope. And your army of undead... Let us not talk of this tonight}\" he replies as their apparitions fade and the room is once again empty."
													]
												},
												"The heroes find nothing of note in the room other than the alfresco area entrance which leads to area 7."
											]
										},
										{
											"type" : "entries",
											"name": "7. Alfresco Area",
											"entries": [
												"This alfresco area is a fenced off private swimming pool area, with three ruined deck chairs at the southern end of the pool.",
												"The water remaining in the pool is still and algae green, nothing can be seen beneath its surface. Every now and then, a ripple emerges from its depths. There are multiple skeletal remains around the closest side of the pool.",
												"A {@b {@dc 13} Wisdom (Passive Perception)} notices a gleaming bejeweled sword laying on the deck beside the pool on the opposite side of the area (shown on the map as an X).",
												"If the heroes attempt to retrieve the sword from the opposite side of the alfresco area, or if they come within 5ft of the poolside, a guard {@creature Beholder Zombie} rises from the murky green water and attacks the party.",
												"The Beholder Zombie does not leave the alfresco area, but the heroes must defeat it one way or another to retrieve the jeweled sword.",
												"{@b Loot}: Choose either one of the following:",
												{
													"type" : "list",
													"items": [
														"{@b Level 4 (party average) and below}; any +1 magic weapon that the party is lacking.",
														"{@b Level 5 (party average) and higher}; {@item Flame Tongue} (longsword)."
													]
												}
											]
										},
										{
											"type" : "entries",
											"name": "8. The Secret Passage",
											"entries": [
												"This room is bare and only boasts hard stone blocks on all of the walls. At either end of the room is a door that can only be opened and closed by pulling the statue griffon talon (area 3).",
												"The secret door system is designed so that only 1 door can be opened at any one time. When one opens, the other closes. And the trigger needs to be done from outside of the room. This means that it might require 2 people to get through to the opposite side."
											]
										},
										{
											"type" : "entries",
											"name": "9. Empty Thoroughfare",
											"entries": [
												"This room is empty and provides a walkway for those who know the secret ways of the manor."
											]
										},
										{
											"type" : "entries",
											"name": "10. The Wizard's Bedroom",
											"entries": [
												"An old rotted wooden bed lies in shambles to the southern side of this 20x20 ft. room. There is an old desk, much in the same state as the bed, to the western side of the room. A successful {@b {@dc 10} Wisdom ({@skill Perception})} check finds:",
												{
													"type" : "list",
													"entries" : [
														"A {@item scroll of invisibility}. A {@b {@dc 10} Intelligence ({@skill Arcana})} check reveals its magical preservation to stand the test of time, and",
														"A page from an ancient journal. A {@b {@dc 13} Wisdom ({@skill Perception})} check alerts the character that touching it makes it crumble to dust. It reads the following:"
													]
												},
												{
													"type" : "entries",
													"entries": [
														{
															"type": "entries",
															"name": "12th day of Mirtul",
															"entries" : ["Today the General meets with his new advisor, she comes highly regarded! Hopefully she can guide the General down the righteous path."]
														}
													]
												},
												{
													"type" : "entries",
													"entries": [
														{
															"type": "entries",
															"name": "14th day of Mirtul",
															"entries" : ["The new advisor Gertrude has only been in our service for two days, and already I see a change in the General. He hangs on to every word she spills, I only hope that it is the word of good."]
														}
													]
												},
												{
													"type" : "entries",
													"entries": [
														{
															"type": "entries",
															"name": "25th day Mirtul",
															"entries" : [
																"Something is wrong. The General dismisses the Lords, he has advised that he will not meet with them in council about the orc armies marching upon us.",
																"This new advisor holds all of his attention, she feeds him the poison of her words and turns him against his people. She must be stopped!"
															]
														}
													]
												},
												{
													"type" : "entries",
													"entries": [
														{
															"type": "entries",
															"name": "30th day of Mirtul",
															"entries" : ["Today is the day that I, Marple Brightshine, make a stand for the greater good! She will die by my hand and my name will be forever muddied. But I see her for what she really is, a night witch!"]
														}
													]
												},
												"The Journal ends with that last entry, nothing more.",
												"{@b Note}: The month of Mirtul is used in the above journal entry, this is a Forgotten Realms calendar month. If you are running this adventure in another setting, please feel free to change the month in the journal to that of your choosing."
											]
										},
										{
											"type" : "entries",
											"name": "11. The Spell Practice Room",
											"entries": [
												"This room is a large open space, with three stone mannequins along the southern wall. These seem to have once been practice targets as behind them, large black blast marks dirty the wall with silhouettes. There is a large iron double door entry into the next room; the doors are blackened from fire.",
												"{@b The secret way out}. There is a secret door that can be found with a successful {@b {@dc 15} Wisdom ({@skill Perception})} check along the northern wall. A successful {@b {@dc 15} Strength ({@skill Athletics})} check opens the door; its trigger mechanism being lost long ago in a fire that destroyed the {@b Library (area 12)}."
											]
										},
										{
											"type" : "entries",
											"name": "12. The Library",
											"entries": [
												"All four walls of this room are badly burnt. There is ash and rubble littered across the floor, mixed in amongst the remains of old burnt books from ages past. Faintly, in amongst the remains, can be seen the slightly hidden piles of humanoid skeletons. The only thing that seems intact and whole in this room is a leather cloak draped over the half melted remains of a metal coat stand.",
												"This is in-fact a {@creature Cloaker}. If the characters are acting suspicious toward it, a successful {@b {@dc 16} Intelligence ({@skill Nature})} check, recognises it as a cloaker.",
												"Once the Heroes are beyond the threshold of the doors and inside the old burnt library, the cloaker surprises them (if not discovered) and attacks until it has 5 hit points remaining. It then attempts to flee to another part of the wizard's quarters, only to surprise the party again at the DM's discretion."
											]
										},
										{
											"type" : "entries",
											"name": "13. Escape Preparation Room",
											"entries": [
												"This room is a secret room that appears to be a kind of preparation room. There are 4 faded black cloaks with hoods hanging on hooks. This was once the escape route for the General and his Wizard, should the manor be taken in a siege. A door leads out to a courtyard garden area."
											]
										},
										{
											"type" : "entries",
											"name": "14. The Courtyard",
											"entries": [
												"This courtyard garden area is lined with shrubs and hedge bushes. In the north-eastern corner of the courtyard, there is a hidden hatch through shrubs and the outer wall, allowing those using the passage a ready escape to the field beyond (not featured in this adventure). A successful {@b {@dc 13} Wisdom ({@skill Perception})} check notices the hatch."
											]
										},
										{
											"type" : "entries",
											"name": "15. The Basement",
											"entries": [
												"The heroes find an open door at the bottom of the stairs.",
												"Once the heroes enter the basement, the door slams shut and a noxious green gas begins to fill the room. There is a half made flesh golem lying on an operating table, with a bucket of body parts beside it.",
												"On the desk beside the operating table the heroes find a waxy lab diagram with notes scribbled over it. One of the notes is an incomplete \"formula\" (number sequence puzzle).",
												"It provides the heroes with the correct body parts to use.",
												"Each of the numbers align to a tagged corresponding body part. Give players the handout on the next page.",
												"Read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"You enter the room, and suddenly the door slams shut behind you. A locking mechanism with a 4 digit code blocks the way and green noxious gas begins to fill the room.",
														"In the room you see a half made flesh golem lying on an operating table, it is missing only hands, feet and a brain. A large mechanism with a crank and coils sits behind it with rods connected to each of the golem's temples.",
														"To the left of the golem are three large buckets holding many feet, hands, and brains. Some rusty operating tools and a needle and thread sit on the table next to it.",
														"To the right of the golem sits a desk with a waxed scrap of paper that looks to be a diagram of a humanoid body. It has notes scribbled all over it."
													]
												},
												"To escape the trapped room the heroes must;",
												{
													"type": "list",
													"entries": [
														"First: Figure out which body parts to use. As each of the numbers are correctly answered, that body part can automatically be found in the bucket with a corresponding tagged number. Answer: 4, 12, 50",
														"Second: Succeed {@dc 13} Intelligence (Medicine checks for each body part to attach them to the flesh golem. If the PCs fail the skill check 3 times, the gas renders them unconscious (see the note below).",
														"Third: Kick-start the golem. A {@b {@dc 15} Intelligence (Arcana)} check realises that either starting the magical mechanism with the crank to conduct electricity through it, or use any lightning based spell wakes the golem."
													]
												},
												"Once the golem is complete, it uses the thoughts from the brain inserted into its body to open the door.",
												"Read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"As the air energizes and you feel static energy tingle around the room, the now completed golem begins to move. It awakens, straight away sniffing the air. It moves quicker than you expect and rushes towards the locking mechanism on the door. Pushing 4 digits, the door opens and the gas clears."
													]
												},
												"Loot: A {@item Bag of Holding} can be found.",
												"Note: If the heroes are unable to solve the puzzle after 20 minutes real-time; the gas renders them unconscious, and they wake in Level 2 (area 24: A General's Broken Heart) in a pile. Run that scene as described.",
												{
													"type": "inset",
													"entries": [
														"{@b Number Sequence Puzzle: Answers}",
														"2, 7, 3, 8, ? ({@b 4} : sequence is +5, -4, +5, -4)",
														"3,12,6,24,? ({@b 12} : sequence is x4, /2, x4, /2)",
														"8,16,22,44,? ({@b 50}: sequence is x2, +6, x2, +6)"
													]
												},
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20005.jpg"
													}
												}
											]
										}
									]
								},
								{
									"type": "section",
									"name": "The Second Floor",
									"entries": [
										"The second floor of Montarthas Manor is riddled with danger and evil creatures. While the Ground Floor was primarily utilised to immerse the heroes in the tragic story of the manor, the second floor is where the heroes finally experience the horrors for themselves.",
										{
											"type": "inset",
											"name": "The Evil Doll",
											"entries": [
												"On entering each of the rooms on the second floor, roll a d%, there is a 40% chance that the evil doll makes an appearance.",
												"Each time that she does, refer to the below table and run the respective events.",
												"If another encounter happens in the room, run that encounter first, then describe the sudden appearance of the doll.",
												{
													"type": "table",
													"caption": "Evil Doll Appearances",
													"colLabels": [
														"Appearance",
														"Encounter"
													],
													"colStyles": [
														"col-2 text-left",
														"col-6 text-left"
													],
													"rows": [
														[
															"1st time:",
															"The doll is be sitting on an any piece of furniture, she does nothing until the heroes leave the room, which is when she activates her Frightening Lullaby feature, then she moves to attack with her Claw. On her second turn she uses her Shadow Blend ability at first opportunity."
														],
														[
															"2nd time:",
															"The doll actively turns its head slowly with an evil grin on her face and attack the heroes with a Knife. For her second round action she uses her Shadow Blend ability to escape."
														],
														[
															"3rd time:",
															"The doll uses her Shadow Blend ability to surprise attack one of the heroes. She drops from the shadowy corners onto their back with a Knife attack. Then she fights per initiative, unless Shadow Blend recharges (DM to check each round). When it does recharge, she uses this to escape. The doll reappears again at a later part in the adventure (DM's discretion) to menace the party again, and again."
														]
													]
												}
											]
										},
										{
											"type": "entries",
											"name": "Flavour notes",
											"entries": [
												"{@b Note 1:} Describe the doll to have evidence of 'repairs' after the first fight. It shows up with twine and patches mended over its body. This suggests that it has been repaired, and explains the doll's HP regeneration between encounters.",
												"{@b Note 2:} Sporadically, as the PCs explore the manor, they can hear a haunting girlish giggle now and then. It is the doll playing with them, scaring them for its own amusement.",
												"{@creature evil doll|pbp_ht|Evil Doll}",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20006.png"
													}
												}
											]
										},
										{
											"type": "entries",
											"name": "16. The Hallway",
											"entries": [
												"There is a soft green glow flickering in this hallway, but there seems to be no source for the light. A {@b {@dc 15} Intelligence (Arcana)} check shows that the source of the green glow is necrotic energies moving about the manor's second floor, like blood through a vein."
											]
										},
										{
											"type": "entries",
											"name": "17. Guest-Rooms",
											"entries": [
												"These rooms are standard guest rooms; both are dusty and full of sticky cobwebs. Upon entry to either Guest Room, roll 1d20; if you roll an even number, 2 x {@creature Phase Spider||Phase Spiders} phase in and attempt to attack the heroes from above the doorway."
											]
										},
										{
											"type": "entries",
											"name": "18. The Laundry Room",
											"entries": [
												"This is an old laundry room with a bench that runs along the southern wall, and a large iron stirring pot for washing clothes.",
												"A ghostly apparition is stirring an ectoplasmic load of dirty clothes. She fades once the party attempts to interact or they enter the room."
											]
										},
										{
											"type": "entries",
											"name": "19. The Guests Wash Room",
											"entries": [
												"This room has a large washing tub, a bench stretches around the south-western corner of the room. An old bloodied towel hangs from a towel rack.",
												"Read or paraphrase the following:",
												{
													"type" : "inset",
													"entries": [
														"As you enter what looks to be an old washroom, you first notice the bloodied towel hanging from the towel rack. A wash tub sits along the northern wall of the room. Then you notice it; a naked body lies within the otherwise empty tub, blood gushing from the woman's wrists."
													]
												},
												"The 'body' is a {@creature ghost}, and only attacks if the heroes attempt to \"save\" it or interact with it in any way."
											]
										},
										{
											"type": "entries",
											"name": "20. The Servant's Living Space",
											"entries": [
												"As the heroes approach this door from the hallway, they hear a thumping sound, getting louder and louder the closer that they get to it. Behind the door awaits a {@creature Ghast} who commands 2 x {@creature Ghoul||Ghouls}",
												"They can smell the living flesh coming their way, and in their excitement, are giving away their position of surprise.",
												"Neither party is surprised when the door is finally opened.",
												"The door is locked and it has been for a very long time. A successful {@b {@dc 15} Dexterity ({@skill Thieves' Tools})} check unlocks the door.",
												"Due to their irrational state caused from hunger, the ghast and ghouls attack and fight to the death. The room is the old servant's living quarters. There is the shared lavatory in the north east room and the shared bathing area in the south east room."
											]
										},
										{
											"type": "entries",
											"name": "21. The Kitchen",
											"entries": [
												"This room is the Kitchen. There is a hotplate with a fire-pit below it, though it has not been used for a millennia. There is a bench on the southern wall, and wooden cupboards fixed above head height on all sides. Pots, pans, knives and cups, dulled and tarnished from age, hang from hooks below the cupboards. Along the southern wall there is a hole in the floor which was once used for a pulley driven dumb waiter between the downstairs kitchen and this room.",
												"The hole is big enough for a medium sized creature to fit through it.",
												"The heroes instantly see a small treasure chest on the hotplate on the opposite side of the room when they enter. It is locked; a {@b {@dc 15} Dexterity ({@skill Thieves' Tools})} check unlocks it, or a {@b {@dc 13} Strength ({@skill Athletics})} check breaks it open.",
												"{@b It's a trap!} When the heroes enter the room, a successful {@b {@dc 15} Wisdom ({@skill Perception})} check notices the air has grown colder and the cupboard doors move slightly with a creak by themselves.",
												"As soon as the heroes reach halfway across the kitchen, an unknown force causes the knives, pots, and pans to slowly detach themselves from their hanging hooks. The cupboards above head height then suddenly start to fling open and closed viciously. With each thrust of the cupboard doors; the ancient knives, pots and silverware fly across the room to crash into the opposite wall.",
												"The cupboards contain the essence of a {@creature Poltergeist}. Each time a knife is detached from its hook and thrown, the cupboard door opens and closes. Destroying the cupboards stops the attacks from that particular cupboard. Each cupboard is AC 10 and has 10 Hit Points. Destroying 4 of the cupboards destroys the Poltergeist.",
												"This should be treated as a combat encounter, have your group roll for initiative as soon as the knives, pots, and pans detach themselves from their hooks. Any hero inside the room needs to succeed on a {@b {@dc 13} Dexterity} saving throw at the start of each of their turns, else be hit by multiple projectiles for a total of 1d6 bludgeoning & slashing damage.",
												"{@b Treasure}: The small chest contains 248 gp, the markings on the coins are of an unknown origin, lost to history."
											]
										},
										{
											"type": "entries",
											"name": "22. The General's Clerk",
											"entries": [
												"This is the clerk's office, where a writing desk sits in the south-western corner and a single door on the eastern wall.",
												"Behind the desk, a skeleton is busy at work writing down something in a translucent ethereal ledger book.",
												"Read or paraphrase the following:",
												{
													"type": "inset",
													"entries" : [
														"As you enter the room you notice something that seems very unnatural, though not unexpected in a place such as this. It is a skeleton busy at work behind a writing desk, frantically writing notes in an translucent ethereal ledger book.",
														"It looks up at you with empty eye sockets, its jaw starts to move as a hauntingly high pitched voice says \"{@b ahh, you are here! He has been waiting for you!... You may proceed Advisor Gertrude!}\"",
														"From behind, you feel something evil and dark trespass through your bodies, as the aspect of a dangerously beautiful woman with dark and deadly eyes walks straight through you, a smirk on her ghostly smile. She walks straight through the closed door and disappears, while the skeleton clerk goes back to his duties."
													]
												},
												"If the heroes attempt to physically interact with the skeleton it falls limp and crumbles to ash. It ignores them completely otherwise."
											]
										},
										{
											"type": "entries",
											"name": "23. The General's Waiting Room",
											"entries": [
												"A long bench stretches the northern wall of this extended waiting room. On the southern wall, two large oak doors stand closed. A tree is carved upon the door with leaves carved at the end of each branch, saying the names of each general that had served and lived within the manor, including their years of servitude. The Generals names appear from the earliest at the top to those later further down. The last name on the tree says \"General Oscar Montarthas\"; there are no more.",
												"Read or paraphrase the following:",
												{
													"type": "inset",
													"entries": [
														"As you look around the room, it appears empty at first, but within the blink of an eye, a small pretty girl, no more than 5 or 6, is suddenly sitting on the long bench that stretches the northern wall. She seems to be waiting patiently. The dark and deadly looking woman appears in the room, smiles at the child, and offers her a children's doll. The girl smiles with joy as the woman evaporates. The child's smile turns to pain and anguish as blood soaked stab wounds begin to appear on her silky white dress. She falls limp and tumbles to the floor before disappearing. You notice that the doll is left lying on the bench, a knife in its hand and a grin on its face."
													]
												},
												{
													"type": "list",
													"entries": [
														"If the heroes have not yet defeated the evil doll in a final confrontation during exploration of the manor thus far, have the doll attack the heroes; it fights until it has only 5 Hit Points remaining, and then use its Shadow Blend feature to escape once more.",
														"If the doll has been defeated earlier in the adventure, the doll that has been left in this room is just an apparition and disappears if the heroes physically interact with it."
													]
												},
												"{@b The door}, although unlocked, appears to be stuck from the other side. A successful {@b {@dc 13} Strength ({@skill Athletics})} check opens the door. Upon opening, the heroes notice a large, heavy, chest has been strategically placed to prevent the door from opening.",
												"{@b Treasure}: The chest contains small iron bars, 12 in total, worth 1gp a piece.",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20007.png"
													}
												}
											]
										},
										{
											"type": "entries",
											"name": "24. A General's Broken Heart",
											"entries": [
												"As the heroes open the door, have them each roll a {@b {@dc 17} Strength} Saving Throw to resist being pulled involuntary into the dark room beyond, the doors slamming behind them.",
												"{@b Note:} If, by some miracle, they all pass the saving throw, then only the lowest roll is pulled into the room.",
												"As the fight erupts within the room, those who resisted the 'pull' have to contend with bashing down the door (AC 13, 40 Hit Points) to save their comrade, while their comrade proceeds to get butchered. This happens slowly, of course, to allow the others a chance to enter the fight.",
												"Once the doors slam, read or paraphrase the following:",
												"As soon as you hear the doors slam shut from behind, a great gust of wind blasts the room around you; sending dust, paper and curtains flying around the room. Piles of rotting corpses litter the creaky wooden floor.",
												"Then you see him, on the ceiling, a shell of a man, shriveled, tortured and used. His body and arms semi moulded into the blackened muck that replicates a ceiling. Slimy black vines creep through his flesh pinning him to the ceiling, as the ends of the vines expand into drooling suckers that feed from his life force.",
												"A glow of green hue emanates from his chest where a green emerald spews out evil energies into the mansion distributing the feed to all areas of the living building. The most potent looking of these green energies flows directly into a lifeless body slumped with its head flung back over a wooden chair.",
												"Once the heroes move to investigate further, or attempt to leave the room, read or paraphrase the following:",
												{
													"type": "inset",
													"entries": [
														"The body snaps its head back from over the chair and back into position. You recognise her from the apparitions of the manor. It is the dark advisor Gertrude. She grins wide and evil, then cackles a haunting laugh as her features grow long and haggard. Her skin turns midnight blue and her pupils turn the red of the 9 hells. She attacks!"
													]
												},
												"This is Gertrude, she is an ancient {@creature Night Hag}, and has been feeding off the necrotic energies for a millennia.",
												{
													"type": "entries",
													"name": "Tactics",
													"entries": [
														"{@b Round 1:} Gertrude casts create undead to create 3 ghouls from the littered corpses around the room. She commands them to attack the closest hero.",
														"{@b Round 2:} She casts magic missile targeting 3 different heroes if possible.",
														"{@b Round 3:} Gertrude then casts create undead again to create 3 more ghouls and commands them to attack the closest hero.",
														"{@b Bonus action:} She pull green necrotic energy from her victim on the ceiling and regain 3d6 Hit Points.",
														"{@b Round 5:} Gertrude casts ray of enfeeblement on the largest and strongest looking hero.",
														"{@b Round 6 and onward:} She attacks to kill remaining conscious heroes, as per DM's discretion.",
														"{@b Note:} Gertrude has 1 more bonus action charge of necrotic HP regain (3d6) from her victim on the ceiling."
													]
												},
												{
													"type": "entries",
													"name": "Development",
													"entries": [
														"If Gertrude is defeated, she shrivels and dies, turning into a pool of black ooze. Her shriveled victim is still attached to the ceiling; however after a moment the black vines wither away and die. As the vines die; they release the man with the emerald embedded in his chest, and he falls heavily to the floor.",
														"Read or paraphrase the following:",
														{
															"type":"inset",
															"entries": [
																"As the vines release the victim on the roof, he falls heavily to the floor, landing on his back with an 'oof'. He breathes shallowly and as you look over him he smiles at your, and whispers 'thank you' before breathing his last breath and finally disintegrating into a pile of ash. The emerald is the only thing remaining, and it shines brightly with arcane energy."
															]
														},
														"A successful {@b {@dc 13} Intelligence ({@skill Arcana})} check shows that the energy emanating from the emerald is necrotic energy. Identifying this relic reveals the emerald's power and details.",
														"Once the heroes have finished with this room, or if they linger too long, read or paraphrase the following:",
														{
															"type": "inset",
															"entries": [
																"You all suddenly feel the room rumble, as dust falls through the cracks and holes in the ceiling. Then, suddenly, the entire manor begins to shake, as the walls start to decay and erode.",
																"The manor, it seems, is caving in on itself, and will likely be nothing but a pile of rubble before long."
															]
														},
														"The heroes need to leave immediately. The building starts to fall in on them on the following events:",
														{
															"type": "list",
															"entries": [
																"If the heroes linger for too long in the room.",
																"After moving through three areas/rooms of the manor "
															]
														},
														"{@b Loot:} The heroes find the Leacher's Emerald, Gertrude's heartstone, and her soul bag (containing 1 evil soul).",
														"{@b When the building starts to fall:} For every 15 ft. that the heroes move (or if they linger in one spot), each hero must succeed a {@dc 13} Dexterity Saving Throw to dodge the falling debris, on failure they take 1d10 bludgeoning damage.",
														"{@b After 8 Saving throws:} Montarthas Manor falls into dust and rubble. Any hero still inside the manor takes 1d100+10 bludgeoning damage."
													]
												}
											]
										}
									]
								}
		
							]
						},
						{
							"type": "entries",
							"name": "Chapter 3: Epilogue",
							"entries": [
								"As the heroes escape the manor it falls in a heap of rubble. Depending on how this adventure ends, and the fate of the evil doll, read or paraphrase one of the following epilogues:",
								{
									"type": "entries",
									"name": "If the evil doll survives",
									"entries": [
										"If the evil doll survives, read or paraphrase the following:",
										{
											"type": "inset",
											"entries": [
												"You manage to escape the falling manor, which has been the epitome of true evil. The night hag, Gertrude, has been defeated and the undead have been laid to rest.",
												"You know not who the hag's victim was, however, but they did leave you the emerald in their departure.",
												"Now, standing before you, are the piles of rubble and decayed remains of the manor; finally resting in peace.",
												"The night begins to grow old as the first hints of dawn start to creep over the horizon. It is then, amongst the woods that surround the manor; you all notice a pair of glowing crystal blue eyes.",
												"A horrifying girlish giggle carries over the, now, still night air, and the eyes fade into blackness."
											]
										},
										"This ending has been left open on purpose. This gives you, the DM, a possible reoccurring villain in the Evil Doll. She could simply disappear, leaving the party paranoid as they leave the area, expecting her to ambush them night after night. Or the doll could follow the party and randomly haunt them for the rest of their journey, only to engage them later down the track in another epic climatic battle."
									]
								},
								{
									"type": "entries",
									"name": "If the evil doll was defeated",
									"entries": [
										"If the evil doll was defeated, read or paraphrase the following:",
										{
											"type": "inset",
											"entries": [
												"You manage to escape the falling manor, which has been the epitome of true evil. The night hag, Gertrude, has been defeated, the horrifying evil doll was removed from this world, and the undead have been laid to rest.",
												"You know not who the hag's victim was, however, but they did leave you the emerald in their departure.",
												"Now, standing before you, are the piles of rubble and decayed remains of the manor; finally resting in peace.",
												"The night begins to grow old as the first hints of dawn start to creep over the horizon. Today is going to be a good day, well a better day, you hope."
											]
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Inline%20Art%20009.png"
											}
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Appendix A: Maps",
							"entries": [
								{
										"type": "image",
										"href": {
											"type": "external",
											"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Manor_GroundFloor_70px_26W_23H.png"
										},
										"title": "Manor Ground Floor"
								},
								{
										"type": "image",
										"href": {
											"type": "external",
											"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/6d739f2da183aa9f5e9fd669f211a0887c3c839b/1/images/Manor_SecondFloor_70px_25W_23H.png"
										},
										"title": "Manor Second Floor"
								}
							]
						}
					]
				},
				{
					"type": "section",
					"name": "The Haunt 2",
					"entries": [
						{
							"type": "image",
							"href": {
								"type": "external",
								"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/image-012.png"
							}
						},
						{
							"type": "entries",
							"name": "Credits",
							"entries": [
								"Authors: Travis Legge & Phil Beckwith",
								"Layout: Phil Beckwith",
								"Editor: Ken Carcas",
								"Proof Reader: Ken Carcas",
								"Cover Artist: Shutterstock (90452866)",
								"Interior Illustrators: Phil Beckwith, George Cotronis, Brett Neufeld, Dean Spencer, Bartek Blaszczec, Earl Geier, Gary Dupuis, Jason Ammons, Teresa Guido",
								"Battle Map Cartographer: Chris Bissette",
								"Playtesters: Joshua Szpakowski, Nick Bailey, Freeman Patterson, and Carter Lemon. Brandon Swangin and his group of mighty adventurers. Johann Carlos and his ghost fighting gladiators. Paul Beebe and The Flaming Pigs - Sean Rando, Carol Vogel, Kenneth Sellers, Patrick Nordaby. Tanya Jackson. Storm Gillman.",
								"Copyright &#169; Phil Beckwith (P.B. Publishing) 2018"
							]
						},
						{
							"type": "entries",
							"name": "Chapter 1: Introduction",
							"entries": [
								"The Haunt 2 is designed to be both a one-shot on its own merits, and a sequel to the platinum bestselling adventure The Haunt. It is a Dungeons & Dragons 5th Edition horror themed fantasy adventure.",
								"This is a very challenging adventure for 5th level player groups of 3 to 5 players with some deadly encounters. However, ideally, The Haunt 2 is tailored as a medium difficulty adventure with plenty of excitement and danger for a 6th level party of 4 to 5 players.",
								{
									"type": "entries",
									"entries": [
										{
											"type": "entries",
											"name": "Adventure Synopsis",
											"entries": [
											"In this horrific tale, the party enters a ruin in hope of finding shelter from a damaging hail storm. They find it by entering the basement level (Area B1) from a stairwell, the only thing left standing within the ground level ruins above.",
											"Once inside, they are beset upon by dark forces who antagonize, harass and toy with them. As the party delves deep into the subterranean region of the ancient hospital, the ruins they left above, slowly start to reconstruct themselves, trapping the party in a nightmarish hellscape.",
											"The characters discover a number of children's drawings which provide clues as to the nature of this dreadful haunt and act as the key, upon their destruction, to allowing the characters to escape the evil place. Can your party survive long enough to solve the mysteries of this foul haunt?"
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Running the Adventure",
									"entries": [
										"This adventure is essentially an escape effort from a dungeon, set in a sick, haunted and ruined hospital. However, the aim is not to just have the players move from room to room, killing creatures to make their way out. This adventure will have a focus for story and flavor too.",
										"The Haunt 2 is split into three Chapters:",
										"Chapter 1: this chapter is the introduction.",
										"Chapter 2: focuses on the main dungeon areas of St. Greycastle's Hospital.",
										"Chapter 3: contains the information required to complete the adventure and the climactic final battle with a freshly powered-up Evil Doll.",
										"To run this adventure, you will need the Dungeons & Dragons Player's Handbook (PHB), Monster Manual (MM), Dungeon Master's Guide (DMG), and the information found within this adventure module. Although the stat blocks are listed in Appendix A, a copy of Mordenkainen's Tome of Foes (MToF) and Monsters of the Guild (MotG) is not required but may come in handy.",
										{
											"type": "entries",
											"name": "Set the Mood",
											"entries": [
												"It is highly advised to run this adventure with dim lighting (or candle-lit), spooky organ music, and have a creepy children's lullaby ready to play.",
												"This will ensure the right vibe is achieved, and provide maximum satisfaction for you, the DM, and your players."
											]
										},
										{
											"type": "entries",
											"name": "Character Advancement",
											"entries": [
												"This adventure is designed to utilize the Milestone Leveling System, by which it is expected that the characters start at level 5 at the beginning of the adventure, and upon escaping St. Greycastle's Hospital, they advance directly into level 6.",
												"This is only a suggestion, however, and you, as the DM, are in no way forced to use this method.",
												"This adventure runs perfectly fine with the Experience Points based leveling, and you are encouraged to use XP if it is a better fit for you and your playing group."
											]
										},
										{
											"type": "entries",
											"name": "Boxed Text",
											"entries": [
												"This adventure includes boxed text to assist those Dungeon Masters who like to have a description of a scene or location. The use of boxed text is by no means required; many great Dungeon Masters avoid the use of boxed text and instead feel more comfortable describing the action in their own words. You should consider what works best for you and your group. If you choose not to read aloud any of the text provided, you should at least paraphrase the information to keep the players aware of their environment."
											]
										},
										{
											"type": "entries",
											"name": "Adventure Referencing",
											"entries": [
												"Throughout the adventure, references for text written in  {@b BOLD} or {@i italic} can be found at the end of the book in the Appendix Reference Page."
											]
										},
										{
											"type": "entries",
											"name": "Setting and Location",
											"entries": [
												"The Haunt 2 is designed to be a drop and play adventure that can fit into any setting and any campaign."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Drawings and Visions",
									"page": 0,
									"entries": [
										"One of the main ways to escape the haunted Greycastle's Hospital is for the PCs to collect the five children's drawings and destroy them. The drawings are scattered throughout the hospital and are cursed. The evil scenes they depict are designed to allow the PCs to learn of the Evil Doll's horrific origin story.",
										"Characters who touch or examine the drawings experience powerful, pathos-ridden visions of the dark events they depict. These visions begin in the same way each time. The character experiencing a vision hears a horrific wailing, like the pained cries of childbirth. Next, the target sees their current surroundings begin crumbling to ash, the ashes being pulled up into the sky and revealing the locations, items, and creatures featured in the vision. Once the vision plays out, the observer's vision blurs with a blood-red light, rendering them blinded for one round (or about six seconds) before their vision returns to normal.",
										"When a vision is to be played out, read or paraphrase the respective vision below then see the after effect:",
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20013.jpg"
											}
										},
										{
											"type": "entries",
											"name": "Vision 1",
											"entries": [
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20014.jpg"
													}
												},
												{
													"type": "inset",
													"entries": [
														"A young, blonde girl walks hand in hand with an older, yet beautiful woman. The girl looks troubled as she glances up at the woman.",
														"\"Why do we have to go to the hospital, Gertrude?\" She asks.",
														"\"Your mother,\" the elder woman answers.",
														"\"She's going to give us a present today.\"",
														"\"I don't like the hospital,\" the young girl says.",
														"\"But I do like presents.\"",
														"The woman pauses and crouches to look at the young girl in the eyes.",
														"\"I know,\" the older woman says. \"How about I give you a special present today?\"",
														"The young girl nods. Gertrude smiles, her face warping momentarily to take on deep wrinkles, sharp teeth, and evil eyes before then returning to normal. Gertrude stands, and the pair resumes their walk."
													]
												},
												"{@b After Effect}. Once this vision is over, the PCs hear a childish giggle and a little girl's voice echo from an indistinguishable location say, \"come and play with me. I bet you can't find all five!\""
											]
										},
										{
											"type": "entries",
											"name": "Vision 2",
											"entries": [
												{
													"type": "inset",
													"entries": [
														"The young, blond girl runs down a hallway towards closed doors. Screaming can be heard from behind the door. She presses her way through the door, to see a bloody woman lying on the delivery bed, weeping uncontrollably. Two nurses stand at the foot of the bed, one holding the stillborn child.",
														"Gertrude stands next to General Montarthas, who sits in a chair, weeping. Seeing the girl run into the room, Gertrude steps toward her.",
														"\"Carol Anne,\" Gertrude says. \"You needn't be in here child. Come. Let's go.\"",
														"Gertrude takes Carol Anne by the hand and begins to lead her out of the room. Carol Anne looks over her shoulder and sees the nurses pass the baby between each other.",
														"The baby's face is a twisted mask of pain and agony, with bulbous black eyes and a smile filled with clusters of needle-like teeth."
													]
												},
												"{@b After Effect}. Once the vision disappears, the heroes hear the whimpering cry of a small girl echoing from somewhere in another room.",
												"However, if investigated, a PC is unable to find its source. A successful [@b {@dc 18} Intelligence ({@skill Religion})} check determines that the crying is ethereal and not from this world.",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20015.jpg"
													}
												}
											]
										},
										{
											"type": "entries",
											"name": "Vision 3",
											"entries": [
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20016.jpg"
													}
												},
												{
													"type": "insetReadaloud",
													"entries": [
														"Carol Anne is playing with the lifeless, inert Evil Doll on the floor of the hallway outside the Sanitarium. Gertrude walks up, carrying a swaddled child. Carol Anne looks at Gertrude with tears in her eyes and asks, \"Is that my brother?\"",
														"\"It is,\" Gertrude replies. \"He did not survive the birth, but I have ways of fixing such problems.\"",
														"With that, Gertrude leans down and lays the blanket on the floor, revealing a baby with empty black eyes and a needle-like sharptoothed grin.",
														"\"I promised you a present, didn't I,\" Gertrude asks as she stands up.",
														"Overcome with joy, Carol Anne leans forward and hugs the demon-infant. She then introduces her dolly to the deformed baby while Gertrude watches with a perverse, evil grin."
													]
												},
												"{@b After Effect}. As the vision fades away, the netherchild forsaken (Carol Anne's \"little brother\") attacks from the shadows attempting to surprise the PCs, hiding with an opposed Dexterity (Stealth) check versus the PCs passive Wisdom (Perception). A -5 penalty applies against any PC experiencing the vision.",
												"The netherchild forsaken then disappears into the shadows after the first round, induced by the Evil Doll's Shadow Blend ability. The party hears a little girls voice say, \"Tut, tut, tut little brother... save these souls for me!\""
											]
										},
										{
											"type": "entries",
											"name": "Vision 4",
											"entries": [
												{
													"type": "insetReadaloud",
													"entries": [
														"Carol Anne plays with the lifeless, limp doll in the main hall of Montarthas Manor. Hearing the sound of splashing water come from the second floor, Carol Anne picks up the doll and slowly creeps up the stairs, towards the Guest Wash Room. As she creeps toward the slightly ajar door, the only sounds are her tiny footfalls and her increasingly deep breathing.",
														"When she reaches the door, Carol Anne pauses in fear, hugging the Evil Doll close for comfort. After a beat, she pushes the door open, revealing her mother, the woman from the delivery room, lying in a bloody bathtub with slashed wrists. Her eyes, now drained of life, coldly stare back at you."
													]
												},
												"After Effect. Once the vision fades away, the party overhear whispering and giggling. PCs that succeed on a {@b {@dc 12} Wisdom (Perception)} check can make out the words, \"teehehehe, shhhh! Don't worry little brother, they won't find them all. They won't destroy them and escape, their souls will be ours!\"",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20017.jpg"
													}
												}
											]
										},
										{
											"type": "entries",
											"name": "Vision 5",
											"entries": [
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20018.jpg"
													}
												},
												{
													"type": "insetReadaloud",
													"entries": [
														"Carol Anne is strapped to a bed in the Sanitarium, her crystal blue eyes wide in pain.",
														"A bleeder nurse stands on either side of her, shoving various medical implements and arcane devices into her arms, legs, and chest.",
														"Gertrude steps up to the foot of the bed, carrying the lifeless and limp Evil Doll.",
														"\"Don't struggle, Carol Anne,\" Gertrude whispers. \"This is for the best. You like to play, yes? This will let us play together forever!",
														"Don't you want to play with us... forever?\"",
														"As she finishes the last sentence, Gertrude's attractive face melts away, revealing her true form, that of a twisted hag.",
														"Carol Anne's face turns motionless as she stops struggling.",
														"\"Now you can play forever ... in your new body\" the hag cackles.",
														"The doll in Gertrude's arms slowly begins to move as its head swivels around to look directly at you with cold crystal blue eyes. A murderous and evil grin adorns her face as she begins to sing a haunting lullaby before the vision fades into darkness."
													]
												},
												"{@b After Effect}. As the vision fades, the PCs notice that the Evil Doll crawls along the ceiling, her head twists completely around so that she is looking down, grinning with bloodlust upon the party. She initiates her Frightening Lullaby, and attacks for 2 rounds, before using her Shadow Blend ability to escape with a giggle and the words, \"catch me if you can!\""
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Running the Evil Doll",
									"entries": [
										"The Evil Doll is tied to St. Greycastle's as something of a 'second home' where she can recuperate, recharge, and regain strength after her defeat in the events of The Haunt. Her memories and the pain she and others endured due to Gertrude's corrupting influence are restorative to her evil form. Her connection to this accursed place is represented through the five drawings scattered throughout the grounds. These drawings have captured influential moments of agony suffered by the Evil Doll and tell a basic story of her origins. She will seek to defend them if possible and will grow increasingly angry as each one is discovered and destroyed.",
										"In between scenes involving the drawings, the Evil Doll can be used as much or as little as you like to assault, taunt, and generally agitate the party. She is most effectively used as a looming, menacing presence who strikes sparingly, if at all, before retreating again to the shadows. A wise DM will use the Evil Doll to speed play along if there is a lull or if the party feels too safe, while pulling back with her in chaotic moments, having her watch from afar as the Hospital torments the heroes.",
										"Death of the Doll. If the Evil Doll is defeated before the final scene, describe her death as she shatters into small pieces of broken porcelain that dissolve into shadowy nothingness. She later returns reborn for the final scene (Chapter 3, Not So Fast)."
									]
								},
								{
									"type": "entries",
									"name": "Spectral Reconstruction",
									"entries": [
										"The deteriorated ruins are that of a five-room house above the basement of St. Greycastle's Hospital. As the adventurers enter the basement, the ruined house begins to reconstruct itself over the course of the adventure. The Dungeon Master may wish to accelerate or slow the timeline of this reconstruction to fit the narrative.",
										"Each of the following events reconstructs one room until all five of the house's Ground Floor rooms are reconstructed (see: Chapter 2 - The Ground Floor):",
										{
											"type": "list",
											"items": [
												"50 points of psychic damage are dealt inside the basement or sub-basement levels",
												"A character enters Area B2 for the first time",
												"A character enters Area S4 for the first time",
												"A character suffers the frightened condition",
												"A character experiences one of the visions but does not suffer the frightened condition",
												"A PC is reduced to zero hit points",
												"A necromancy spell of a level equal to 1+ the number of active rooms of the house is cast",
												"The party completes a short or long rest"
											]
										},
										"As the ground floor rooms become active, the Dungeon Master may wish to keep them unmanifested until the party interacts with them so as to increase the terror. For example, perhaps even though three rooms are active, the characters do not see the first room until they run up the stairs from Area B1 to escape, only to find a whole new room constructing itself from the rubble in front of them.",
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20019.jpg"
											}
										}
									]
								},
								{
									"type": "entries",
									"name": "Background",
									"entries": [
										"This military hospital was once the home of Lady Margery Greycastle, a holy warrior in service to the Church of Ilmater. After a long career as an adventurer, Lady Greycastle decided to settle down somewhere where she could retire from travel and chaos, but still do good work and help the common folk. The city provided the perfect opportunity to do both, and the aging paladin served as a healer, spiritual guide, and support personnel to the city's militia in her late years.",
										"Eventually, age and illness began to take their toll, and Lady Greycastle began preparations to leave the world. She made arrangements to leave the remainder of her funds, her house, and her property to the city for conversion into a hospital.",
										"St. Greycastle's Hospital served the city through the years, mainly treating the wounded and sick among the militia. Over time, the lower basement was converted into a sanatorium, housing those who became maddened from enduring the violent, brutal orcs raids which plagued the region. As Gertrude the Hag began exerting her influence over the city at large, the sanatorium began to overfill with those who were driven mad by the abuses and tortures of the evil fey monster. Gertrude took a particular pleasure in tormenting the sick, wounded, and mad. She also used the hospital as something of a training ground for Carol Anne Montarthas to grow accustomed to her new form as the Evil Doll. The hag taught her fledgling plaything to use her powers and to learn an appreciation for the art of terrorizing her prey.",
										"Now that Montarthas Manor has fallen, and the Evil Doll has been wounded, she has returned to the only familiar and safe place she remembers to lick her wounds and plot her next move. Her presence in the hospital awakens the evil inside, creating a nightmarish charnel house of terror. In addition, the hospital itself feeds on fear. If living souls enter the building and experience fright, the hospital begins rebuilding itself."
									]
								},
								{
									"type": "entries",
									"name": "Adventure Hooks",
									"entries": [
										"The adventure does not have any setting specific adventure hooks though the following are provided as suggestions to hook your players and campaign into this adventure:",
										{
											"type": "list",
											"items": [
												"The PCs have been approached by an elderly wizard who offers them a handsome reward for rescuing his apprentice who has entered but not returned from Montarthas Manor. Three tenday ago. Another group of adventurers had gone to investigate a tenday ago and have not returned...",
												"The PCs have heard rumor of a powerful jewel hidden in Montarthas Manor. They hear it is worth a fortune to the right people. When they arrive in the ruins of the city, they cannot find the manor and instead find their way into the ruins of St. Greycastle's.",
												"People have been going missing when traveling in ruins of the old city. The nearest town's mayor has offered some freelance adventuring work to anyone who is brave enough to enter and investigate the ruins.",
												"Once inside, they feel drawn, whether by clues or by a nagging feeling, to investigate the hospital.",
												"A great evil emanates from the grounds of the hospital; all good-aligned heroes who pass through the region will feel a persistent urge to remove that evil from the world.",
												"The PCs have been traveling along a barren road for many days. As the winds blow a blithering gale throughout the area, the heroes long for a reprieve. Craving a warm bowl of food, an ale, and a warm place to shelter, they come upon the ruins of he hospital, which seems more hospitable than any other place around these parts.",
												"The PCs barely survived (or appeared not to survive) the events of The Haunt. They awaken, injured and exhausted, in St. Greycastle's Hospital's Sanitarium (Area S4)..",
												"The PCs completed The Haunt successfully..",
												"Though dawn breaks around them, they are wounded and tired from the events of their adventure. They travel to the nearest safe place to hunker down, make camp, and tend their wounds. This apparent oasis of safety turns foul as they discover the true nature of St. Greycastle's Hospital.",
												"The PCs completed The Haunt successfully.",
												"They left in victory and went on with their adventuring. Now, much later, word reaches them of disappearances in the area of Montarthas Manor. Has the Doll returned?"
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "PREVIOUSLY IN THE HAUNT (HERE BE SPOILERS)",
									"entries": [
										"Dungeon Masters who have not read or run The Haunt may find a few of the elements of this story a bit confusing.",
										"The following facts and events from The Haunt im mpact this tale directly:",
										{
											"type": "list",
											"items": [
												"The once noble home of General Montarthas was corrupted and twisted by an evil Night Hag named Gertrude",
												"Gertrude's influence allowed her to overwhelm m the General, his family, and eventually the entire village.",
												"Montarthas Manor was used to bait unwary travelers into a deadly game of cat and mouse where Gertrude could feed off of their life force and energy.",
												"The Evil Doll haunted the Manor and may have been apparently destroyed along with the house."
											]
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Chapter 2: St. Greycastle's Hospital",
							"entries": [
								"The years have not been kind to St. Greycastle's Hospital. When the old house-turned-hospital ruins are first encountered, the majority of the ground floor, which is the only remaining structure left above ground, is little more than a pile of rubble and rotten wood, other than a clearly visible stairwell entrance.",
								"{@b Hail Storm}. As the characters reach the ruined ground floor, read or paraphrase the following:",
								{
									"type": "insetReadaloud",
									"entries": [
										"The air turns deathly cold, and hail begins to plummet down from the skies above you.",
										"As it hits the ground you see the chunks of hail smash the rotten wood on the floor into splinters. These chunks of solid and compact ice are the size of a human fist. A quick look around shows the only available shelter from the damaging projectiles is a stone stairwell leading below ground on the northern side of the ruins."
									]
								},
								"Any character who stays out in the open must succeed on a {@dc 20} Dexterity saving throw each round that they are exposed, taking 4 (1d8) bludgeoning damage per failed save until shelter is found.",
								"{@b Stairwell}. Luckily, despite the destruction, the stairwell leading to the basement of the hospital (Area B1) remains intact, and this is easily spotted by the PCs. A tired party, whether seeking shelter from the storm or respite after battling the horrors of Montarthas Manor, will find no more inviting a shelter on this dreadful day.",
								{
									"type": "entries",
									"name": "The Hospital Ruins Below",
									"entries": [
										"The Basement and Sub-basement levels of this dungeon are, for the most part, still intact.",
										"Not many living creatures walk these haunted halls anymore, and those that do only wish to escape. There are many horrors and dangers in these two parts of the hospital, but none more horrific than the Evil Doll and her vile sibling the Netherchild Forsaken.",
										{
											"type": "entries",
											"name": "General Features",
											"entries": [
												"Unless otherwise noted in the area description, the following features apply throughout the basement and sub-basement (hospital ruins) levels:",
												"{@b Light}. Dim light comes down the stairs from the outside. Beyond that, the interior spaces of the ruins are dark. Characters must provide their own light sources.",
												"{@b Sound}. All of the areas beyond the doors leading into Area B2 are haunted with quiet, intermittent sounds that are primarily creepy and disturbing.",
												"{@b Squishy sounds, blood dripping}. Children's laughter and small footsteps are all appropriate to the environment. None of the sounds are severe enough to interfere with Wisdom (Perception) checks, but they are disturbing.",
												"{@b Ceilings}. Unless otherwise noted, the ceilings in each area are 10 feet high.",
												"{@b Stairs}. These 10-foot-wide stairs are carved from stone."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Basement Level",
									"entries": [
										{
											"type": "entries",
											"name": "B1.Stairwell & Receiving Room",
											"entries": [
												"As the PCs make their way down the stairwell, read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"name": "",
													"entries": [
														"A flight of stone stairs leads down into a 10-foot-wide hallway. Double doors lead to the south, while a chamber appears to open to the east.",
														"Moving past the double doors, and into the chamber to the east, the corridor opens around a corner to the south, revealing a rectangular area. Rotten wooden chairs orderly line the walls, as if waiting for someone long gone to sit in them.",
														"At the southern end of the room sits the broken remnants of a desk with a hole about a foot wide visible in the back. A similar chair, in similar condition, sits behind the desk."
													]
												},
												"The Receiving Room is 40-foot by 20-foot in size.",
												"{@b Investigation}. A successful {@b {@dc 10} Intelligence (Investigation)} check reveals that this room was once a waiting room for some type of hospital.",
												"All chairs within this area are dry rotten to the point of uselessness for anything but kindling.",
												"The desk, while heavily damaged, could easily be used as firewood.",
												"{@b The Desk}. On top of the desk is a long dried out inkwell and a scattered mess of aged and yellowed sheets of vellum. The ink is largely faded but a list of names and conditions (see Vellum List table below), written in common, can be read with some difficulty, provided that the vellum is inspected in bright light or the reader benefits from darkvision while inspecting the vellum in low light.",
												"The front of the desk boasts a space for three drawers:",
												{
													"type": "list",
													"items": [
														"The top drawer is missing.",
														"The middle drawer is not locked and can be pulled open to reveal a small hinged box containing two sticks of charcoal and a sealed scroll case containing three blank pieces of vellum. The total contents of this drawer are worth 6 cp.",
														"The third and bottom drawer does not have a lock but seems to be stuck. A successful {@b {@dc 16} Strength (Athletics)} check breaks the handle off of the drawer, it still will not open."
													]
												},
												"The back of the desk has a hole in the wood about a foot wide. It looks as if the hole was kicked or punched in the desk.",
												"{@b Treasure}. The hole leads into the bottom drawer, allowing a small or medium creature to reach in and collect the drawer's contents; a child's drawing (see Drawing 1).",
												"Drawing 1. Inside the drawer is a child's drawing which depicts a woman walking hand in hand with a young girl. The woman is half young and half old and wrinkly, and the young girl has a big smile on her face. Any character who looks at this picture must make a successful {@dc 14} Wisdom saving throw or suffer 5 (1d10) psychic damage. A character who holds the drawing in their hands suffers disadvantage on this saving throw. Any who fail their saving throw experience Vision 1 (see Chapter 1, Drawings & Visions).",
												"Apart from the aforementioned furnishings, this room is empty. A decent camp can be set up here, should the characters choose.",
												"Future State. When the PCs enter this area for the first time once the Future State comes into effect, a skeleton sits at the desk, or stands where the desk should be. Though it does not attack, it taunts the party, proclaiming their doom.",
												{
													"type": "table",
													"caption": "Vellum List Table",
													"colLabels": [
														"Name",
														"Illness"
													],
													"colStyles": [
														"col-3 text-left",
														"col-3 text-left"

													],
													"rows": [
														[
															"Ashland, Bardon", 
															"dysentery"
														],
														[
															"Barker, Devin",
															"leprosy"
														],
														[
															"Connor, Airic ",
															"consumption"
														],
														[
															"Caldwell, Keelin ",
															"hysteria"
														],
														[
															"Elm, Mavis ",
															"hysteria"
														],
														[
															"Harris, Gilda ",
															"childbirth"
														],
														[
															"Helms, Birgit ",
															"childbirth"
														],
														[
															"Minnow, Eghan ",
															"lunacy"
														],
														[
															"Olson, Kayne ",
															"mummy rot"
														],
														[
															"Petersen, Rowena ",
															"childbirth"
														],
														[
															"Unnamed ",
															"leprosy"
														],
														[
															"Unnamed ",
															"leprosy"
														],
														[
															"Unnamed ",
															"lunacy"
														],
														[
															"Unnamed ",
															"lunacy"
														],
														[
															"Unnamed ",
															"hysteria"
														],
														[
															"Unnamed ",
															"hysteria"
														]
													]
												}
											]
										},
										{
											"type": "entries",
											"name": "B2. Hallway",
											"entries": [
												"This hallway is ten feet wide with a stone floor.",
												"When the party first traverses this hallway, the floor is dry, though the occasional patch of inert mold or fungus grows from cracks in the floor.",
												"The doors can be found as indicated on the map and can be seen normally. Light behaves normally.",
												"{@b Future State}. Once characters have entered the Sanatorium (Area S4), the hallway undergoes a number of supernatural changes, becoming slick with the blood and bile of those who died in the hospital. The entire hallway is considered difficult terrain, and any character taking the dash action while in the hallway must succeed on a {@dc 15} Dexterity saving throw or slip on the fluid and fall prone. A character who falls into the gore in such a fashion must succeed on a {@dc 12} Wisdom saving throw or become frightened.",
												"Nonmagical light sources are less effective in the hallway in this future state, subtracting 10 feet from their bright light and dim light radius.",
												"Magical light sources are unaffected.",
												"The walls in the hallway also appear to breathe, which is disconcerting, to say the least. Any character entering the hallway who is not suffering the blinded condition must succeed on a {@dc 14} Wisdom saving throw or become frightened of the hallway for 1 minute. A character so frightened cannot move through or in the hallway of their own volition but can be dragged by allies.",
												"Once the Future State movement restrictions go into effect in the hallway, they do not impact the movement of the Evil Doll or the Netherchild Forsaken. Unless they have a fly speed, all other inhabitants of the hospital are affected by the difficult terrain.",
												"{@b Creatures}. Once the Future State comes into effect, when the PCs enter this area for the first time, the Evil Doll and the Netherchild Forsaken both appear in the roof corners and attack the party"
											]
										},
										{
											"type": "entries",
											"name": "B3. Quarantine",
											"entries": [
												"This 30-foot by 20-foot room holds eight beds which were set aside to accommodate highly infectious patients. Despite decades of disuse, the room is still home to four desiccated corpses, which lie in the beds where they died.",
												"{@b Stench}. As soon as the doors are opened, a foul stench wafts forth from the chamber, causing any creatures within 10 feet of the door to make a {@dc 12} Constitution saving throw. On a failure, the creature is poisoned until the end of its next turn.",
												"{@b Creatures}. Despite the dried-out corpses and dusty furnishings, there are four pools of wet, seemingly fresh vomit on the floor of the room.",
												"If any characters enter a space adjacent to one of these pools, the pools all animate, revealing themselves to be four vomit spawn. These will attempt to crawl into the mouths of the party to suffocate them and then breed in their corpses.",
												"They fight until destroyed.",
												"{@b Investigation}. Anything of value or use from this room is long rotten and ruined. There are no drawings in here, as the Evil Doll never comes here.",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20020.jpg"
													}
												}
											]
										},
										{
											"type": "entries",
											"name": "B4. Maternity Ward",
											"entries": [
												{
													"type": "entries",
													"name": "B4a. Sanitation Area",
													"entries": [
														"Entering this room from the north or south leads into a 15 x 20 sanitation area.",
														"Read or paraphrase the following:",
														{
															"type": "insetReadaloud",
															"entries": [
																"Three tubs filled with rusty stagnant water line the western wall, two are made of iron,the third is constructed of tarnished copper.",
																"Small braziers beneath each tub, once used to heat this water, now sit filled with only ashes and rust. A swarm of mosquitos buzzes menacingly about the area. The buzzing of these creatures is extremely disconcerting as it sounds like a blending mix of flying insects and the cries of infant children.",
																"Bloodsplattered curtains separate this area from the eastern area beyond."
															]
														},
														"{@b Creatures}. A mosquito swarm (swarm of insects) uses these tubs as a spawning pool and will attack any living creature who enters this area. A creature encountering this swarm for the first time must make a {@dc 14} Wisdom saving throw or become frightened of the swarm. A creature so frightened may repeat this saving throw at the end of each of its turns, ending the condition on a successful save.",
														"Blood-splattered Curtains. The sanitation area is separated from the rest of the maternity ward by rotten, blood-spattered linen curtains that separate the western and eastern sections.",
														"Characters who touch the curtains must succeed on a {@dc 13} Constitution saving throw or contract cackle fever. Gnomes are immune. This can be avoided by pushing the curtains aside with a sword, pole, or another object. Burning the curtains makes the disease airborne for 30 seconds, causing any creature within 30ft of the area to make a {@dc 16} Constitution saving throw or contract cackle fever."
													]
												},
												{
													"type": "entries",
													"name": "B4b. The Ward",
													"entries": [
														"Beyond the curtain to the east sits a 20-foot by 40-foot chamber. Six adult beds with adjacent bassinets sit along the walls. All of the bed sets sit against the east wall. They are all filthy, covered in dust, dirt and old, dried blood.",
														"Read or paraphrase the following:",
														{
															"type": "insetReadaloud",
															"entries": [
																"The bed in the northeast corner is splattered with fresh, wet blood. The faint sound of a baby crying can be heard from the bloodied bassinet next to this bed."
															]
														},
														"Characters entering this area with a passive Wisdom (Perception) of 16 or above, who succeed on a {@b {@dc 16} Wisdom (Perception)} check or who spend one minute looking over the area succeeding on a {@b {@dc 13} Intelligence (Investigation)} check notice an area in the center of the floor where the floorboards are unstable from being rotten through; failure results in those who try to cross the room crashing through the floorboards. Those falling through the floorboards must succeed a {@dc 18} Dexterity saving throw to catch the side of the still intact stable floor; failure results in the PC falling through the floor into Area S4, suffering 3 (1d6) bludgeoning damage from the 10-foot fall and landing prone.",
														"{@b Creatures}. Once a creature enters the space adjacent to the bloody basinet, a netherchild forsaken leaps out of the bloody bassinet, attempting to grapple the nearest creature, initiating combat.",
														"{@b Tactics}. When combat begins, the remaining bassinets in the room begin bleeding. On the netherchild forsaken's next initiative, it uses its Wail attack.",
														"If no character fell through the rotten floorboards, the netherchild forsaken's Wail breaks the rotten wood away, leaving a hole in the floor.",
														"{@b When the wail occurs}. Eight netherchildren rise up out of the forming blood pools, one in each bassinet. The netherchild forsaken fights until it is reduced to half of its hit points, at which point it attempts to flee, dropping into the floor below. The remaining netherchildren fight to the death, swarming one or two creatures and trying to drag them through the hole and into the sub-basement."
													]
												}
											]
										},
										{
											"type": "entries",
											"name": "B5. Stairwell",
											"entries": [
												"This chamber leads to a simple stone stairwell that leads down to Area S2.",
												"{@b Future State}. Once a party member has entered the Sanatorium (Area S4), these stairs flatten, becoming a very steep ramp. Ectoplasm and blood begin flowing down the ramp, pooling on the floor of Area S3. Climbing the ramp in the Future State requires a successful {@b {@dc 14} Strength (Athletics)} check made at disadvantage. A successful dispel magic spell (DC 14) cast at the stairs reverts them to a normal staircase, though the stairs are still slick with ectoplasm and blood, making the stairway difficult terrain."
											]
										},
										{
											"type": "entries",
											"name": "B6. Main Sickroom",
											"entries": [
												"This chamber is the hospital's main sickroom.",
												"Six beds line the eastern and western walls. Next to each bed is a small table covered with bizarre, rusted medical equipment. A successful {@b {@dc 10} Wisdom (Medicine)} check deduces that these tools were designed to inflict a massive amount of pain to any creature hooked up to them. In the southwest corner, an armless and legless ghast lies prone on a bed. The ghast moans in agony and begs for help. If any character gets within 5 feet of the ghast, it attempts a bite attack.",
												"The ghast fights until destroyed, pursuing any characters who try to run from it by pulling itself along by its chin, moving 5 feet per turn.",
												"Aside from the ghast, this room is unoccupied.",
												"Doors leading to the Areas B2 and B5 can be blocked with beds from within this room, offering a place of comparative security within the hospital."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Sub-Basement",
									"entries": [
										{
											"type": "entries",
											"name": "S1. Nurse's Quarters",
											"entries": [
												"Once the characters open the door to this room, read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"This room is filled with dry rotted wooden furniture, rusty medical equipment, and filthy, desecrated text."
													]
												},
												"If inspected, the texts are procedures on the healing arts.",
												"Creatures. Standing in the room are four bleeder nurses, who attack anything that moves at a speed of 15 feet or more per turn in the area.",
												"The Rat. As soon as any character moved more than 5-feet into this room, a rat skitters and runs out of the nearest wall toward the bleeder nurses. As it passes the first bleeder nurse, the bleeder nurse swipes down with her hand, slicing the rat to bits. As soon as the rat stops moving the bleeder nurse then resumes a statuesque stillness. A {@b {@dc 10} Wisdom (Insight)} check reveals that the bleeder nurses are responding to fast movement and are otherwise blind and inert.",
												"Drawing 2. In the center of the room, on the floor, is a drawing which shows a woman lying on a delivery room bed. Two nurses are at her feet, one of which is cradling a baby with x's for eyes.",
												"A man stands next to the delivery table crying, and the half old, half young woman stands beside him, with a hand on his shoulder. Any character who looks at this picture must make a successful {@dc 14} Wisdom saving throw or suffer 5 (1d10) psychic damage. A character who holds the drawing in their hands suffers disadvantage on this saving throw. Any who fail their saving throw experience Vision 2 (see Chapter 1, Drawings & Visions)."
											]
										},
										{
											"type": "entries",
											"name": "S2. Stairwell",
											"entries": [
												"The floor at the bottom of these stairs is covered with a 10-foot by 10-foot patch of brown mold.",
												"Beyond that, the dank, dark corridors extend outward to the North, South, and West.",
												{
													"type": "image",
													"href": {
														"type": "external",
														"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20021.jpg"
													}
												}
											]
										},
										{
											"type": "entries",
											"name": "S3. Chapel",
											"entries": [
												"The doors leading into the chapel from the North are made of crumbling wood and hang askew on their hinges. A gap wide enough for a medium sized creature to squeeze through is formed as the doors lie, but a successful {@b {@dc 12} Strength (Athletics)} check can pull the rotten wood free from its hinges.",
												"Once the characters can see inside the room, read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"Inside the room, it is immediately obvious this was once a beautiful chapel. Now, however, the room contains broken pews and shreds of rotten tapestries are scattered across the floor. At the southern end of the old chapel sits a broken altar. Before the alter are shattered holy symbols and tools of divine ritual splayed out across the floor. Sitting in the center of the shattered altar is a badly beaten and bloodied winged creature."
													]
												},
												"Characters who succeed on a {@b {@dc 10} Intelligence (Religion)} check recognize the broken iconography of the church as relating to the god Ilmater.",
												"Creatures. At first glance, on a successful {@b {@dc 10} Intelligence (Religion)} check this appears to be a wounded deva, who pleads for any soul who happens upon it to lend aid. Those who approach the creature and have a passive Wisdom (Perception) score of 10 or above or who succeed a {@b {@dc 10} Wisdom (Perception)} check notice that it exudes a sulfurous odor. This \"wounded deva\" attempts to touch any creature who approaches within reach. Once it does, it makes a pseudopod attack initiating combat, revealing its true nature as an adult oblex. Any character with truesight can see the adult oblex in its true form."
											]
										},
										{
											"type": "entries",
											"name": "S4. Sanatorium",
											"entries": [
												"This cold, open chamber was once the sanatorium, where the mad were kept. Twisted and broken frames of what must have once been the furniture of this area are scattered across the room.",
												"Creatures. 14 maniacs (use stats for the wretched as seen in MToF) and one bleeder nurse are in this room and attack anything that moves in the area. They fight to the death.",
												"A {@dc 12} Wisdom (Insight or Perception) check notices that the bleeder nurse is responding to fast movement and are otherwise blind and inert.",
												"Drawing 5. If the characters search this room and make a successful {@b {@dc 12} Intelligence (Investigation)} check, they find a drawing laying in the corner that shows the half-old woman standing next to a bed where the child is strapped down with various implements stuck in her limbs and head. The child is crying. Any character who looks at this picture must make a successful {@dc 18} Wisdom saving throw or suffer 5 (1d10) psychic damage. A character who holds the drawing in their hands suffers disadvantage on this saving throw. Any who fail their saving throw experience Vision 5 (see Chapter 1, Drawings & Visions)."
											]
										},
										{
											"type": "entries",
											"name": "S5. Hallway 1",
											"entries": [
												"This short space leads to the sanatorium doors.",
												"The doors are made of banded wood and locked.",
												"The doors have AC 15, a damage threshold of 10 and 30 hit points. They are immune to psychic and poison damage. Forcing them open requires a successful {@b {@dc 25} Strength (Athletics)} check. The lock is a standard lock, which can only be picked from the outside with a successful {@dc 15} Dexterity (Thieves Tools) check.",
												"The first time the party enters this area, they will be accosted by the Evil Doll, attacking with surprise and demanding her drawings returned. She fights until the party hands over any drawings in their possession, the party is killed, or she suffers a total of 25 or more hit points, at which point she flees into the shadowy corners using her shadow blend ability, dropping a drawing along the way.",
												"{@b Drawing 3}. This is a child's drawing of the Evil Doll playing with the netherchild forsaken. Any character who looks at this picture must make a successful {@dc 14} Wisdom saving throw or suffer 5 (1d10) psychic damage. A character who holds the drawing in their hands suffers disadvantage on this saving throw. Any who fail their saving throw experience Vision 3 (see Chapter 1, Drawings & Visions)."
											]
										},
										{
											"type": "entries",
											"name": "S6. Hallway 2",
											"entries": [
												"Lurking in this patch of hallway is a psychic gray ooze. The ooze is maddened and aggressive. If the ooze is slain, a drawing emerges from the dissolving creature.",
												"{@b Drawing 4}. This drawing depicts a woman in a bathtub full of blood and has the word \"mommy\" written on it. Any character who looks at this picture must make a successful {@dc 14} Wisdom saving throw or suffer 5 (1d10) psychic damage.",
												"A character who holds the drawing in their hands suffers disadvantage on this saving throw.",
												"Any who fail their saving throw experience Vision 4 (see Chapter 1, Drawings & Visions)."
											]
										},
										{
											"type": "entries",
											"name": "S7. Hallway 3",
											"entries": [
												"Large, banded wooden doors exit from the chapel into this hallway. The doors have AC 15, a damage threshold of 10 and 30 hit points.",
												"They are immune to psychic and poison damage.",
												"Forcing them open requires a {@b {@dc 25} Strength (Athletics)} check. The lock is a standard lock, which can be picked with a successful {@dc 15} Dexterity (Thieves Tools) check.",
												"The hallway itself is a pooling place of negative energy. Upon entering the east or west section of his hallway, each creature must make a saving throw to resist Shadowfell Despair. Any character who fails this save suffers the effects of Shadowfell Despair, as well as 1d4 psychic damage.",
												"A group of six fiendish maggots make their home in this hallway, seeking to infest any creatures who make their way this far into the basement. The fiendish maggots fight until destroyed. They desperately wish to escape St. Greycastle's."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "The Ground Floor (above ground level)",
									"page": 0,
									"entries": [
										"When the party first arrives to this site, the ground floor of St. Greycastle's is little more than a pile of rubble and remains like this until they escape the hail storm and delve deeper into the basement stairwell.",
										"Spectral Invigoration. The moment any character steps into Area B2, the ground floor becomes invigorated with spectral energy, reconstructing itself from raw spite, ectoplasm, and the tainted mystical energies left behind by the corruption of the ancient and long forgotten village (see Chapter 1, Spectral Reconstruction).",
										"While basic features of the rooms on the ground floor are described, as well as suggested inhabitants, DMs are encouraged to tailor the spectral entities inhabiting these rooms to the backstories and experiences of the party. This section of the adventure is designed to give the players a chance to experience and examine the personal horror, regrets, and failures of their characters through the narrative device of a haunted house that knows (and feeds on) their characters sins.",
										{
											"type": "entries",
											"entries": [
												{
													"type": "inset",
													"name": "FIENDISH MAGGOTS",
													"entries": [
														"The Demon Inside. Fiendish maggots are capable of infesting humanoids and growing inside them. When this occurs, the humanoids become visibly sick. Symptoms include pallid skin, has dark circles under the eyes and a raspy voice. With a successful {@b {@dc 14} Wisdom (Medicine)} check, a character identifies the symptoms as those of a supernatural curse or disease. A detect good and evil spell cast on the sufferer also reveals a faint fiendish aura emanating from inside of them."
													]
												},
												{
													"type": "entries",
													"name": "The Ground Floor Reborn: General Features",
													"entries": [
														"Unless otherwise noted in the area description, the following features apply throughout the reconstructed ground floor:",
														{
															"type": "list",
															"items": [
																"Light. Dim light permeates each of the interior spaces with no apparent source.",
																"Sound. Sounds from adjacent rooms can only be heard if any and all supernatural inhabitants of the rooms are destroyed.",
																"Ceilings. Unless otherwise noted, the ceilings in each area are 10 feet high.",
																"Stairs. These 10-foot-wide stairs are carved from stone.",
																"Inhabitants. Unless otherwise noted, all inhabitants of the ground floor are considered specters with the following changes:",
																{
																	"type": "list",
																	"style": "list-decimal",
																	"items": [
																		"Languages Common",
																		"Replace the specter's Life Drain action with the following:",
																		{
																			"type": "list",
																			"items": [
																				"{@b Mindshatter}. Melee Spell Attack: +4 to hit, reach 5 ft., one creature. Hit: 10 (3d6) psychic damage. The target must succeed on a {@dc 10} Wisdom saving throw or its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the creature finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. In addition, on a failed save the target suffers an indefinite madness until cured."
																			]
																		}
																	]
																}
															]
														},
														"Note: These features apply only in areas that have been reconstructed via Spectral Reconstruction."
													]
												},
												{
													"type": "entries",
													"name": "Escape Conditions",
													"entries": [
														"Once the house begins reconstructing itself, it becomes incredibly difficult to leave. Any attempt to use magic to leave the premises requires a {@dc 22} ability check using the caster's spellcasting ability. Failure on this ability check causes the spell or effect to fail, its slot wasted. The exterior doors and windows of the house are effectively impenetrable. Furthermore, a wall of force blocks egress through holes in the exterior walls unless one or more of the following conditions are met:",
														{
															"type": "list",
															"items": [
																"The five drawings are collected and burned or otherwise utterly destroyed. The drawings are on normal parchment and do not require any special means of destruction. They do not need to be destroyed in unison.",
																"The Evil Doll is incapacitated or restrained and presented as ransom to the Netherchild Forsaken",
																"The Netherchild Forsaken is incapacitated or restrained and presented as ransom to the Evil Doll",
																"A creature infested by a fiendish maggot attempts to open one of the doors",
																"A hallow spell is cast on the altar in Area S3 "
															]
														},
														"Conditions Met. If any of the escape conditions are met, a whirlwind forms in the center of the reconstructed house. This wind whips hair and clothing around and imposes disadvantage on Wisdom (Perception) checks but has no other effects on characters in the area. When the whirlwind touches a wall of the house or a creature from the house or its lower levels (with the exception of the Evil Doll,) it breaks down into ashes which are sucked up into the vortex.",
														"Once the house is returned to its original state of ruin, the whirlwind stops, scattering the ashes around the property and blanketing the land in an eerie, silent calm."
													]
												}
											]
										},
										{
											"type": "entries",
											"name": "R1. Main Hall",
											"entries": [
												"This was the main hall of the old house which has a set of stone stairs leading down to the basement. This 40-foot by 40-foot chamber contains three overstuffed couches of fine make, but in ill repair, to provide seating for guests. Tapestries depicting the heroic works of Lady Margery Greycastle adorn the walls.",
												"The eyes of these images seem to follow any creatures who move through the room. The various accoutrements of wealth have faded, leaving the room shockingly bleak and muted of color. Closed wooden doors lead to the South, East, and West. The East and West doors are impassable (see aforementioned Escape Conditions).",
												"This room is empty and eerily quiet. Let the horror of being unable to escape, and only venture further into the madness linger here."
											]
										},
										{
											"type": "entries",
											"name": "R2. Central Passage",
											"entries": [
												"Oil paintings depicting the Carol Anne Montarthas, Gertrude, General Montarthas, Mrs. Montarthas, a nurse, and an infant hang on the walls in this hallway. The oil paintings hurl insults, taunts, and dark prophecies at any creature who passes. Beyond the ability to verbally assail and terrorize, these paintings can take no actions unless a creature touches or attacks them.",
												"{@b Creatures}. If any painting is touched or attacked, the subjects of all six paintings climb out of their frames, becoming specters. These specters attack the party, pursue them if they attempt to flee and fight until destroyed."
											]
										},
										{
											"type": "entries",
											"name": "R3. Privy Chamber",
											"page": 0,
											"entries": [
												"This is the bathroom/privy area of the manor.",
												"The walls and floor are splattered with a foulsmelling ichor. The sound of an infant crying emanates from beneath an overturned chamber pot. If the chamber pot is moved or investigated, it reveals an unrecognizable chunk of bloody meat and the crying stops.",
												"Creatures. A few seconds (one round) later, a skinned and bloody woman (a specter) begins climbing out of the wall, attacking whichever character moved the chamber pot. This specter pursues its target if they attempt to flee and fight until destroyed.",
												"Alternatively, if the DM prefers, the specter can burst forth in a shower of gore from the lump of bloody meat, surprising the nearest character if they fail a {@b {@dc 15} Wisdom (Perception)} check."
											]
										},
										{
											"type": "entries",
											"name": "R4. Bedchamber",
											"entries": [
												"This was Lady Greycastle's bedroom. The furnishings are appropriate for a noblewoman of high standing but are all old, rotten and decayed.",
												"{@b Creatures}. Lady Greycastle (sword wraith commander) lies in the bed. She is rotten and covered in dust and filth, the decay of her form matching that of her environs. She is clad only in a rotten nightgown. Once she notices any creature entering the room, she beckons them over to help. Regardless of the party's actions, she plays the role of a pathetic tormented spirit for two rounds (or long enough to monologue about how sad she is that her home was overrun by evil) at which point she leaps up from the bed and attacks, her sword and shield manifesting in her spectral hands and spectral breast plate ripping forth from beneath her tattered nightgown. If the party attacks her first, she abandons the ruse, transforming immediately.",
												"Lady Greycastle attacks the party, pursues them if they attempt to flee, and fights until destroyed."
											]
										},
										{
											"type": "entries",
											"name": "R5. Dining Hall/Pantry",
											"entries": [
												"When the characters enter this room, read or paraphrase the following:",
												{
													"type": "insetReadaloud",
													"entries": [
														"The door to this room opens to reveal a long table set with tarnished silverware.",
														"Eight places are occupied by rotting spectral nobility, dressed in fine clothing with gobs of flesh hanging from their bones. A rotted five course meal sits on the table, with servings spread out on each specter's plate.",
														"The ghostly nobility sit around the table, chattering among themselves and paying no mind you."
													]
												},
												"This was the dining room for the old house.",
												"Creatures. A group of eight specters is holding a dinner party. The spirits laugh and talk, their topic of conversation is the failure of the party to make their way out of St. Greycastle's, some even taking bets against each other as to who, when, or if they might escape. This is a great opportunity for the DM to drop any clues or hints that the party may have missed.",
												"The specters ignore direct questions from the party, though the conversation quickly shifts to answering any question asked. If the party assaults the specters or otherwise tries to break up the dinner party, the specters attack the party, pursue them if they attempt to flee and fight until destroyed.",
												"If the characters are having a hard time figuring out how to proceed with the adventure, the ghosts may mention the following pieces of information:",
												{
													"type": "list",
													"items": [
														"{@b That brat keeps leaving her drawings lying around. They are annoying, but necessary, I guess.}",
														"{@b I hate being caught in the middle of some silly sibling rivalry. Someone should take one of those kids out and just hand them over to the other one. I don't care which!}",
														"{@b Those maggots in the basement are revolting. Someone should get them out of here. They could bring the whole place down, you know.}"
													]
												}
											]
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Chapter 3: Not So Fast",
							"entries": [
								{
									"type": "quote",
									"entries": [
										"Careful. This is the moment when the supposedly dead killer comes back to life, for one last scare."
									],
									"by": "Randy",
									"from": "Scream (the movie)"
								},
								"After an all too brief respite, perhaps long enough for the party to exchange a few celebratory words, the Evil Doll bursts forth from the rubble, showering the party in flying wood and stone.",
								"Read or paraphrase the following:",
								{
									"type": "insetReadaloud",
									"entries": [
										"Bursting from the rubble of the ruins and landing on the ground before you, the Evil Doll snaps her neck towards you, her eyes enlarged and blackened like a shark closing in for the kill. The cracks in her porcelain skin emanating a sickly greenish glow, the Evil Doll screams, \"{@b YOU RUINED EVERYTHING! YOU RUINED MY DRAWINGS! So... NOW YOU DIE!}\""
									]
								},
								"This final battle is designed to be a fight to the death with the mutated and enraged Evil Doll, however, you are encouraged to allow her to escape death at the end of the battle should you wish to keep her as a recurring villain in your campaign.",
								"As designed, she will fight until she or the party are destroyed.",
								{
									"type": "entries",
									"name": "Legendary Evil Doll",
									"entries": [
										"In her final form, the evil doll has the following abilities in addition to her standard stat block:",
										"{@b Hit Points}. She has been restored to full hit points at the start of this battle, regardless of prior damage she has suffered throughout the story.",
										"Frightening Lullaby. The evil doll's Frightening Lullaby ability gains the Recharge 5-6 property.",
										"Legendary Actions. The evil doll can take 2 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The evil doll regains spent legendary actions at the start of its turn.",
										{
											"type": "list",
											"items": [
												"{@b Frightening Lullaby}. The evil doll uses its Frightening Lullaby ability if charged.",
												"{@b Claw}. The evil doll makes one claw attack.",
												"{@b Move}. The evil doll moves up to its speed without provoking opportunity attacks."
											]
										},
										"{@b Lair Actions}. On initiative count 20 (losing initiative ties), the evil doll takes a lair action to cause one of the following effects; the evil doll can't use the same effect two rounds in a row:",
										{
											"type": "list",
											"items": [
												"{@b Bash & Stab}. Splinters of rotten wood and chunks of stone erupt from a point on the ground the evil doll can see within 120 feet of it, creating a 20-foot-high, 5-foot-radius geyser. Each creature in the geyser's area must succeed a {@dc 15} Dexterity saving throw, taking 10 (3d6) piercing damage and 10 (3d6) bludgeoning damage on a failed save, or half as much damage on a successful one.",
												"{@b Tremor}. A tremor shakes the lair in a 60-foot radius around the evil doll. Each creature other than the evil doll on the ground in that area must succeed on a {@dc 15} Dexterity saving throw or be knocked prone. The affected radius is considered difficult terrain until the end of the evil doll's next turn.",
												"{@b Maximilian's Earthen Grasp}. The evil doll casts Maximilian's Earthen Grasp spell (Strength save {@dc 15}) on one target within 30 feet of it that the evil doll can see. The evil doll may maintain concentration on this effect for up to 1 minute but cannot use other lair actions while concentrating on this effect."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "ADDITIONAL MINIONS - OPTIONAL",
									"entries": [
										"If you, the DM, feel that the final battle against The Evil Doll is either not challenging enough for the party or you wish to add more dynamics to the fight, especially when running this adventure at level 6, it is advised to add two netherchildren minions to the battle. With a cackle of laughter from the Evil Doll, two netherchildren emerge from the rubble and join the fight, attacking any ranged based characters first."
									]
								},
								{
									"type": "entries",
									"name": "Conclusion",
									"page": 0,
									"entries": [
										"Once the final battle is over, and the evil doll is defeated, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"As the dawn begins to lighten the early morning sky, the stormy rain squalls cease.",
												"The Evil Doll lays on the sodden ground, unmoving. As the first rays of sunlight hit the empty shell of a body, the porcelain skin, ragged hair, and blood stained dress begin to wither and blacken to flecks of charcoal.",
												"A moment passes and the Evil Doll quickly break into a small pile of ash that washes away into the morning puddles.",
												"The day is new, and the goodness of light somehow returns to this once forsaken place.",
												"You know that this may not last long, however, but for now the world is a better place."
											]
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20022.jpg"
											}
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Appendix",
							"entries": [
								{
									"type": "entries",
									"name": "A: Maps",
									"entries": [
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20030.jpg"
											},
											"title": "Basement"
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20031.jpg"
											},
											"title": "Sub basement"
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/2/images/Inline%20Art%20032.jpg"
											},
											"title": "Reconstructed Ground Floor"
										}
									]
								}
							]
						}
					]
				},
				{
					"type": "section",
					"name": "The Haunt 3",
					"entries" : [
						{
							"type": "image",
							"href": {
								"type": "external",
								"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20038.jpg"
							}
						},
						{
							"type": "entries",
							"name": "Credits",
							"page": 0,
							"entries": [
								"MATURE AGE WARNING - This adventure is intended for a mature playing group, in that it contains scenes that some younger players may find disturbing. It is advised that this adventure is only played by those 15 years or older - parental discretion is advised.",
								"Credits",
								"Authors: Travis Legge & Phil Beckwith",
								"Layout: Phil Beckwith",
								"Editor: Ken Carcas",
								"Cover Artist: shutterstock (510653137)",
								"Interior Illustrators: Anthony Cournoyer, Bartek Blaszczec, Dean Spencer, DM's Guild Creator's Resource, Gary Dupuis, Shutterstock.com (506633197, 693317353, 1043277064, 1095387911, 1138746779, 1398393569)",
								"Battle Map Cartographer: Chris Bissette"
							]
						},
						{
							"type": "entries",
							"name": "Chapter 1: Introduction",
							"entries": [
								"The Haunt 3 is designed to be both a one-shot on its own merits, and a sequel to the bestselling adventures The Haunt and The Haunt 2. It is a Dungeons & Dragons 5th Edition horror themed fantasy adventure.",
								"This is a very challenging adventure for 7th level player groups of 3 to 5 players with some deadly encounters. However, ideally, The Haunt 3 is tailored as a medium difficulty adventure with plenty of excitement and danger for an 8th level party of 4 to 5 players.",
								{
									"type": "entries",
									"entries": [
										{
											"type": "entries",
											"name": "Adventure Synopsis",
											"entries": [
												"The Haunt 3 picks up some time after the events of The Haunt 2. Designed for survivors of the first two, or new parties to equally enjoy, this adventure takes the party on a trip through time and mind to attempt to save the soul of Carol Anne. The adventure revisits locations from the first two and adds an entirely new location; the space between, a pocket world in the ruins of the village. The story begins with the party's dreams being haunted by an apparition of a young girl who appears to have half a porcelain doll face and half a human face.",
												"The girl beckons them to come to St. Greycastle and step into the space between. Though it makes little sense, each party member feels a strong pull to this accursed place. If the party played The Haunt and The Haunt 2 they absolutely recognize Carol Anne and may be taken aback by her new appearance. If not, they will likely be intrigued by the spectral girl. Do they have what it takes to save Carol Anne's soul from the terrors of the Haunt?"
												]
											}
										]
								},
								{
									"type": "entries",
									"name": "Running the Adventure",
									"entries": [
										"This adventure is essentially a trip through time, offering the party a number of objectives by which to save Carol Anne from her dark fate as the Evil Doll. The encounters can be run in chronological order, or rearranged as the DM sees fit. The Haunt 3 is split up into 4 chapters:",
										{
											"type": "list",
											"items": [
												"Chapter 1: Introduction (this chapter)",
												"Chapter 2: The Space Between",
												"Chapter 3: The Quests",
												"Chapter 4: Endings"
											]
										},
										"To run this adventure, you need the Dungeons & Dragons Player's Handbook (PHB), Monster Manual (MM), Dungeon Master's Guide (DMG), and the information found within this adventure module. Although the stat blocks are listed in Appendix A, a copy of Mordenkainen's Tome of Foes (MToF), Monsters of the Guild (MotG), and Tomb of Annihilation (ToA) is not required but may come in handy.",
										{
											"type": "entries",
											"name": "Set the Mood",
											"entries": [
												"It is highly advised to run this adventure with dim lighting (or candle-lit), spooky organ music, and have a creepy children's lullaby ready to play. This ensures the right vibe is achieved, and provides maximum satisfaction for you, the DM, and your players."
											]
										},
										{
											"type": "entries",
											"name": "Character Advancement",
											"entries": [
												"This adventure is designed to utilize the Milestone Leveling System, by which it is expected that the characters start at level 8 at the beginning of the adventure, and upon escaping Montarthas Manor, they advance directly into level 9.",
												"This is only a suggestion, however, and you, as the DM, are in no way forced to use this method. This adventure runs perfectly fine with the experience points based leveling, and you are encouraged to use XP if it is a better fit for you and your group."
											]
										},
										{
											"type": "entries",
											"name": "Boxed Text",
											"entries": [
												"This adventure includes boxed text to assist those Dungeon Masters who like to have a description of a scene or location. The use of boxed text is by no means required; many great Dungeon Masters avoid the use of boxed text and instead feel more comfortable describing the action in their own words. You should consider what works best for you and your group. If you choose not to read aloud any of the text provided, you should at least paraphrase the information to keep the players aware of their environment."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "Setting and Location",
									"entries": [
										"The Haunt 3 is designed to be a drop and play adventure that can fit into any setting and any campaign."
									]
								},
								{
									"type": "entries",
									"name": "Background",
									"page": 0,
									"entries": [
										"In ages past, there once stood a small city. The city, being subject to constant orc attacks, maintained a defensive militia to ward away such attacks as they occurred. This militia stood for centuries and many commanding officers came and went throughout the years. Lady Margery Greycastle, a holy warrior in service to the Church of Ilmater, ended her adventuring career and sought to settle down somewhere where she could retire from travel and chaos, but still do good work and help the common folk. The city provided the perfect opportunity to do both, and the aging paladin served as a healer, spiritual guide, and support personnel to the city's militia in her late years.",
										"Eventually, age and illness began to take their toll, and Lady Greycastle began preparations to leave the world. She made arrangements to leave the remainder of her funds, her house, and her property to the city for conversion into a hospital.",
										"St. Greycastle's Hospital served the city through the years, mainly treating the wounded and sick among the militia. Over time, the lower basement was converted into a sanatorium, housing those who became maddened from enduring the violent, brutal orcs raids which plagued the region.",
										"General Oscar Montarthas, known for being fair, firm, and stern towards his men, rose through the ranks and assumed command over the city's militia. He was the last to command this post.",
										"Not long from retirement, General Montarthas employed an advisor, Gertrude, who would assist the General in decision making with the forthcoming yearly orc invasions. This advisor was, in fact, an evil night hag, who planned to ruin the city and use its population to feed from the power of their life force. This was achieved by seducing the General and corrupting his heart.",
										"As Gertrude the Hag began exerting her influence over the city at large, the sanatorium began to overfill with those who were driven mad by the abuses and tortures of the evil fey monster.",
										"Gertrude took a particular pleasure in tormenting the sick, wounded, and mad. She also used the hospital as something of a training ground for Carol Anne Montarthas to grow accustomed to her new form as the Evil Doll. The hag taught her fledgling plaything to use her powers and to learn an appreciation for the art of terrorizing her prey.",
										"Heavily undermanned, the city ultimately fell to the orcs and was abandoned, with only the manor standing the test of time. In recent memory, Montarthas Manor, and the hag that called it home, was brought down by the heroic efforts of adventurers who stumbled upon the ruins. The events of The Haunt not only brought an end to Gertrude and Montarthas Manor, but also led to Carol Anne's awakening as the Evil Doll. Reeling from these events, the Evil Doll went to the ruins of St. Greycastle's to heal on the dark energies there. The Haunt 2 detailed adventurers finding their way into St. Greycastle's, learning the truth of what transpired there, and seemingly laying those dark spirits to rest.",
										"Unfortunately, rest was not to be had for Carol Anne. Her spirit now caught between the corruption of the Evil Doll, and the innocence of her stolen childhood, Carol Anne is caught outside of time. She has a plan to free herself from the Hag's influence and possibly undo the damage done to her childhood home, but to make it work, she needs brave adventurers to face the demons of her past. Perhaps these are the same adventurers who have faced The Haunt before, or perhaps new blood is needed."
									]
								},
								{
									"type": "entries",
									"name": "Adventure Hooks",
									"entries": [
										"The adventure does not have any setting specific adventure hooks and relies on visitations within the party's nightmares to get the ball rolling for the story. If characters have played through the previous installments of The Haunt franchise, they should need no further encouragement to get involved in the adventure. If not, you may consider the following:",
										{
											"type": "list",
											"items": [
												"A survivor from previous excursions to Montarthas Manor contracts the group to help investigate the cause of strange nightmares. Once the party accepts the job, they too begin sharing the nocturnal visions."
											]
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Chapter 2: The Space Between",
							"entries": [
								"Once the party begins their journey to the ruin, they start to notice a number of counterclockwise spirals occurring around them. Everything from when they stir a pot of soup (regardless of direction) to leaves blowing in the wind, to the splash made when skipping a rock along a lake. Counterclockwise spirals are showing up everywhere, and more frequently as they approach the ruin.",
								"Once the group arrives at the ruins of St.  Greycastle's Hospital, they find a macabre sight.",
								"Read or paraphrase the following:",
								{
									"type": "insetReadaloud",
									"entries": [
										"Where the ruins of St. Greycastle's Hospital once stood, you see a twisted mockery of a graveyard. Broken rocks, chunks of wall, and rotten wood are jammed haphazardly into the ground. Some sticky fluid, perhaps sap... perhaps blood, lists the names of the presumed deceased on these makeshift markers. Next to each name, in the same viscous fluid, is a counterclockwise spiral."
									]
								},
								"The detritus left behind from the battle of The Haunt 2 has been moved and reorganized to resemble a primitive model of a graveyard, complete with names of various NPCs from the previous installments (or perhaps friends/party members who died on the last play through).",
								"The names are written with tree sap, or some other dark, sticky fluid, and in the drips of the fluid, spiral patterns have formed, again moving counterclockwise.",
								"Characters who are proficient in Arcana or who succeed on a {@b {@dc 10} Intelligence (History)} check should be able to work out that walking widdershins around the cemetery (i.e. in a counterclockwise fashion, along with the spiral) may have some effect. According to folklore, this awakens or angers spirits in the region. If no characters can come to this conclusion on their own, they are considered to have failed the first challenge (see below). They hear a voice that implores them to \"walk the spiral,\" which repeats until they walk widdershins, entering the Space Between.",
								{
									"type": "entries",
									"name": "A Macabre Meeting",
									"entries": [
										"When the party walks widdershins around the cemetery, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"As you walk counterclockwise around the graves, you hear a low hum. The color begins to drain out of your surroundings as everything becomes a sickly gray. The hum grows louder and begins to take on a staccato quality. As you finish your lap around the cemetery, the hum has morphed into the weeping of a young girl.",
												"Before you, among the graves, stands Carol Anne's ghostly reflection. Half flesh, half doll, the girl looks up at you and smiles.",
												"\"I'm glad you came.\""
											]
										},
										"Carol Anne explains that in death she has found a mechanism to unwind time, but in order to undo the damage done to her, she needs to establish anchors in the past, one for each year of her mortal life. These are established by physical interaction, often defeating a monster or monsters of the past.",
										"She explains that finding the Space Between was the first test and congratulates them on succeeding (or chastises them for failing, in the event that she had to explain the process to them.) If the party agrees to help her and undo the evil, she describes the objectives, and asks them to choose their starting point.",
										"Once the encounter is chosen, Carol Anne instructs them to walk widdershins in the Space Between and they are sent off on their first quest.",
										"Each time the group succeeds or fails, they are brought back to the Space Between until Carol Anne is freed, or the group fails a total of six quests."
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Chapter 3: The Quests",
							"entries": [
								"The following quests can be completed in any order. Depending on how things proceed, the party ends with The Good (4.1), The Bad (4.2), or The Ugly (4.3).",
								{
									"type": "entries",
									"name": "1. The Dining Room - Montarthas Manor",
									"entries": [
										"The party enters the General's dining room via an open entrance from the manor's tea room. As they step into the area, the place comes alive. The empty room with an abandoned, rotting wooden table manifests a ghostly dinner party.",
										"When the party enters, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"As you step up into the dining room from the sunken tea room, the air grows warm. Suddenly, the room comes to life, as a half-dozen ghostly apparitions appear seated at the once empty table. It seems a large dinner party is being held, as a roasted hog materializes, along with plates of all varieties of food. Jugs of foaming ale are being shared between ghostly companions.",
												"While the food on the plates looks spectral, and the mugs appear insubstantial, the hog looks solid, real, and delicious. A large spectral human man stands at the head of the table, saying nothing, a serious scowl and frown is cemented over his face as he overlooks his guests who seem to be enjoying themselves.",
												"Carol Anne's voice whispers in your ear, \"I am hungry.\""
											]
										},
										"The ghosts pay no heed to the heroes providing they do not interact with them.",
										"If the heroes attempt to interact with any of the ghostly dinner party, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"The room abruptly becomes quiet. All talking and laughter has ceased. Every ghost in the room is now facing you when the man at the head of the table rushes towards you, floating right through the hard wooden dining table and knocking the roasted hog on to the floor.",
												"\"You should not be here! LEAVE THIS PLACE!!!!\"",
												"Roll initiative!"
											]
										},
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"The inhabitants of the party, including the large man, are ghosts (MM p. 147). There are seven ghosts in total, and they fight until destroyed or the party leaves the area with or without the roast."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"The purpose of this quest is to get a piece of the roast for Carol Anne and leave the room with it.",
												"Once a member of the party has a piece of the roast in hand and steps out of the dining room, they are teleported back to the Space Between, succeeding in their mission.",
												"{@b Failure}. If any member of the party is reduced to 0 hp, the entire party is returned to the Space Between and the quest has been failed (keep a tally as the adventure progresses). If the adventurers leave the room without interacting with anything, the dinner party simply disappears as the party returns to the Space Between, also having failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "2. The Guests Wash Room - Montarthas Manor",
									"entries": [
										"This room has a large washing tub and a bench that stretches around the south-western corner of the room. An old bloodied towel hangs from a towel rack.",
										"Read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"As you enter what looks to be an old washroom, you first notice the bloodied towel hanging from the towel rack. A wash tub sits along the northern wall of the room. A naked body lies within the otherwise empty tub, blood gushing from the woman's wrists. Carol Anne whispers, \"I need a lock of mother's hair\" as the body looks up at you, reaching out with elongating, gory arms."
											]
										},
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"The body is that of Carol Anne's mother, and it attempts to hug the party to death. She uses the statistics of the lonely (MToF pg. 232) and fights until destroyed."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"Once Carol Anne's mother is dead, the party can cut loose a lock of her hair, at which time, they return to the Space Between, victorious.",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without the hair, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "3. The General's Waiting Room - Montarthas Manor",
									"page": 0,
									"entries": [
										"A long bench stretches the northern wall of this extended waiting room. On the southern wall, two large oak doors stand closed. A tree is carved upon the door with leaves carved at the end of each branch, saying the names of each general that had served and lived within the manor, including their years of servitude. The Generals names appear from the earliest at the top to those later further down. The last name on the tree says \"General Oscar Montarthas\"; there are no more.",
										"Read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"As you look around the room, it appears empty at first, but within the blink of an eye, a small pretty girl, no more than 5 or 6, is suddenly sitting on the long bench that stretches the northern wall. She seems to be waiting patiently. A dark and deadly looking woman appears in the room, smiles at the child, and offers her a children's doll. The girl smiles with joy as the woman evaporates. The child's smile turns to pain and anguish as blood soaked stab wounds begin to appear on her silky white dress. She falls limp and tumbles to the floor.",
												"The doll is left lying on the bench, a knife in its hand. It turns to look at you with a grin on its face as Carol Anne whispers in your mind, \"I need my faces. Both of them.\"",
												"Roll initiative."
											]
										},
										{
											"type": "entries",
											"name": "Creatures",
											"page": 0,
											"entries": [
												"The Evil Doll attacks. She is at full legendary power here, and this time, she's not playing around. She fights to kill."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"In order to defeat this area, the party must retrieve the Evil Doll's face as well as Carol Anne's (though cutting their heads off works too).",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without both faces, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "4. The Foyer - Montarthas Manor",
									"entries": [
										"This room is trapped; the trap is triggered whenever a living soul passes beyond the line between the two statues (see The Foyer map).",
										"Read or paraphrase the following when the heroes enter this room:",
										{
											"type": "insetReadaloud",
											"entries": [
												"The entry foyer has a large open space with a floor of black marble. Two imposing looking demonic statues stand to either side of the foyer as if motionlessly keeping watch over the empty room. Carol Anne whispers in your ear \"Wings to carry me to heaven.\""
											]
										},
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"Parties who have played through The Haunt recognize a slight difference as these gargoyles are larger than they remember... and have four arms. These are giant four-armed gargoyles (ToA p. 221) and each of them animates as soon as the trap is triggered. They fight to the death."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"To succeed on this quest the party must retrieve a pair of wings from one of the gargoyles. Once the gargoyles are destroyed this is fairly easy to achieve.",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without two gargoyle wings, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "5. The Library - Montarthas Manor",
									"entries": [
										"As the party enters the library, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"All four walls of this room are badly burnt.",
										"There is ash and rubble littered across the floor, mixed in amongst the remains of old burnt books from ages past. Faintly, in amongst the remains, can be seen the slightly hidden piles of humanoid skeletons. The only thing that seems intact and whole in this room is a leather cloak draped over the half melted remains of a metal coat stand in the deepest corner of the room.",
										"Beneath this coat stand is a children's book.",
										"The slightly scorched cover reads \"Blinsky's Blunders\" in common. Carol Anne whispers in your ear, \"Get me my bedtime stories.\""
											]
										},
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"When a member of the party steps within 10 feet of the book, the two bookshelves along the east and west walls spring to life and attack, revealing themselves to be giant mimics (MotG p. 68). One attempts to block the exit, while the other attacks the party at its melee range. Interestingly, the cloak on the coat rack is just a normal cloak.",
												"If the party attempt to gather the book via the likes of the mage hand cantrip or levitate spell or similar, the giant mimics reveal themselves and attempt to attack and swallow the book (AC 15) with their pseudopod, meaning the characters must kill the mimic to retrieve the book."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"page": 0,
											"entries": [
												"The party must succeed in retrieving Blinsky's Blunders and moving out of the room.",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without Blinsky's Blunders, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "6. Chapel - St. Greycastle's",
									"entries": [
										"The doors leading into the chapel from the north are made of crumbling wood and hang askew on their hinges. A gap wide enough for a medium or smaller sized creature to squeeze through is formed as the doors lie, but a successful {@b {@dc 12} Strength (Athletics)} check pulls the rotten wood free from its hinges.",
										"Once the characters can see inside the room, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"Inside the room, it is immediately obvious this was once a beautiful chapel. Now, however, the room contains broken pews and shreds of rotten tapestries are scattered across the floor.",
												"At the southern end of the old chapel sits a broken altar. Before the alter are shattered holy symbols and tools of divine ritual splayed out across the floor. Sitting in the center of the shattered altar is a badly beaten and bloodied winged creature. Around the creature's neck is an amulet bearing the holy symbol of Ilmater.",
												"Carol Anne whispers in your ear, \"I need Ilmater's Comfort.\""
											]
										},
										"At first glance, on a successful {@b {@dc 10} Intelligence (Religion)} check this appears to be a wounded deva, who pleads for any soul who happens upon it to lend aid. Those who approach the creature and have a passive Wisdom (Perception) score of 10 or above or who succeed a {@b {@dc 10} Wisdom (Perception)} check notice that it exudes a sulfurous odor. Characters who have survived this encounter in The Haunt 2 know this deva's true nature.",
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"The wounded deva attempts to touch any creature who approaches within reach. Once it does, it makes a pseudopod attack initiating combat, revealing its true nature as an adult oblex (MToF p. 218). Any character with truesight can see the adult oblex in its true form.",
												"There is also a netherchild (Appendix A) in the corner of the room, hidden in shadow. A successful {@b {@dc 20} Wisdom (Perception)} check notices the netherchild. Once initiative is rolled, the netherchild chuckles and casts a hallow spell, which drives out any celestials in the room and adds a silence effect throughout the chamber. The netherchild then flees the room."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"page": 0,
											"entries": [
												"To succeed in this quest, the party must retrieve the amulet bearing the holy symbol of Ilmater from the adult oblex, and leave the area.",
												"{@b Failure}. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without the amulet of Ilmater's holy symbol, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "7. The Maternity Ward - St. Greycastle's",
									"entries": [
										"This is a 20-foot by 40-foot chamber. Six adult beds with adjacent bassinets sit along the walls.",
										"Three-bed sets sit against the east wall. All of the beds are filthy, covered in dust, dirt and old, dried blood.",
										"Read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"The bed in the northwest corner is splattered with fresh, wet blood. The faint sound of a baby crying can be heard from the bloodied bassinet next to this bed, Carol Anne whispers in your ear, \"I need you to bring me my brother's body.\""
											]
										},
										"Characters entering this area with a passive Wisdom (Perception) of 16 or above, who succeed on a {@b {@dc 16} Wisdom (Perception)} check, who spend one minute looking over the area succeeding on a {@b {@dc 13} Intelligence (Investigation)} check, or those who survived The Haunt 2 notice an area in the center of the floor where the floorboards are unstable from being rotten through; failure results in those who try to cross the room crashing through the floorboards.",
										"Those falling through the floorboards must succeed a {@dc 18} Dexterity saving throw to catch the side of the still intact stable floor; failure results in the PC falling through the floor and landing inside a giant gelatinous cube (MM p. 242) suffering an automatic failed save against the cube's Engulf feature.",
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"The gelatinous cube fills the entire room beneath and any engulfed creature can try to escape on their turn by taking an action to make a {@dc 12} Strength check to swim up through the cube and back through the hole in the floor above.",
												"Once a creature enters the space adjacent to the bloody basinet, a netherchild forsaken, Carol Anne's stillborn brother, leaps out of the bloody bassinet, attempting to grapple the nearest creature, initiating combat.",
												"When combat begins, the remaining bassinets in the room begin bleeding. On the netherchild forsaken's next initiative, it uses its Wail attack.",
												"If no character fell through the rotten floorboards, the netherchild forsaken's Wail breaks the rotten wood away, leaving a hole in the floor.",
												"When the wail occurs, eight netherchildren rise up out of the forming blood pools, one in each bassinet. All creatures fight to the death while attempting to drag the heroes through the hole in the floor."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"Taking the netherchild forsaken's corpse from the room succeeds in this quest.",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without the netherchild forsaken's body, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "8. Privy Chamber - St. Greycastle's",
									"entries": [
										"This is the bathroom/privy area of the manor.",
										"Read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"The walls and floor are splattered with a foul smelling ichor. The sound of an infant crying emanates from beneath an overturned chamber pot. Carol Anne whispers in your ear, \"my heart weeps. I need it back.\""
											]
										},
										"If the chamber pot is moved or investigated, it reveals an unrecognizable chunk of bloody meat.",
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"As soon as the heroes investigate the chamber pot and see the chunk of bloody meat for the first time a specter (MM p. 279) bursts forth from it in a shower of gore, surprising the nearest character if they fail a {@b {@dc 15} Wisdom (Perception)} check.",
												"The specter attacks the nearest character with mindshatter, then attempts to possess the target. Regardless of whether the possession is successful, the spectre fights until destroyed, doing everything it can to keep the lump of meat in the room."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"Succeeding in this quest means that all the heroes need to leave with the bloody chunk of meat.",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without the lump of bloody meat, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								},
								{
									"type": "entries",
									"name": "9. Nurses Quarters - St. Greycastle's",
									"entries": [
										"Once the characters open the door to this room, read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"This room is filled with dry rotted wooden furniture, rusty medical equipment, and filthy, desecrated text. At the center of the room is a sketchbook filled with pastel drawings. In each corner of the room stands a faceless, twisted woman in a nurse's outfit. All four slowly turn in unison toward you as Carol Anne whispers in your ear, \"I need my sketchbook...and I think they can smell you.\""
											]
										},
										"If inspected, the texts are procedures on the healing arts.",
										{
											"type": "entries",
											"name": "Creatures",
											"entries": [
												"Standing in the room are four bleeder nurses, who attack anything that moves in the area. If the characters use the mage hand cantrip or similar to try and retrieve the sketchbook, the two closest bleeder nurses to the characters attack."
											]
										},
										{
											"type": "entries",
											"name": "Success or Failure",
											"entries": [
												"To succeed at this quest, the heros need to obtain the sketchbook to return to Carol Anne.",
												"Failure. If any member of the party is reduced to 0 hp, or if any member of the party abandons the room without the sketchbook, the entire party is returned to the Space Between and the quest is failed."
											]
										}
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Chapter 4: Endings",
							"entries": [
								"The party's performance up to this point determines the ending they face.",
								{
									"type": "entries",
									"name": "4.1 The Good",
									"entries": [
										"If the party succeeds on a total of six quests, they find themselves transported through time to the outskirts of the city. Standing at the edge of the road, they see a beautiful woman approaching the city. As she draws close, her disguise slips, revealing her to be the Night Hag (MM p. 178), Gertrude. This gives the party the opportunity to destroy Gertrude before she corrupts the Montarthas family."
									]
								},
								{
									"type": "entries",
									"name": "4.2 The Bad",
									"entries": [
										"If the party succeeds at only five quests, they are transported to the Sanitarium in St. Gertrude's.",
										"Read or paraphrase the following:",
										{
											"type": "insetReadaloud",
											"entries": [
												"Carol Anne is strapped to a bed. Her crystal blue eyes wide in pain. A bleeder nurse stands on either side of her, shoving various medical implements and arcane devices into her arms, legs, and chest. Gertrude steps up to the foot of the bed, carrying the lifeless and limp Evil Doll.",
												"\"Don't struggle, Carol Anne,\" Gertrude whispers.",
												"\"This is for the best. You like to play, yes? This will let us play together forever! Don't you want to play with us... forever?\"",
												"As she finishes the last sentence, Gertrude's attractive face melts away, revealing her true form, as that of a twisted hag."
											]
										},
										"This gives the party the chance to fight off Gertrude and save Carol Anne, though it is too late for General Montarthas and the rest of the family at this point."
									]
								},
								{
									"type": "entries",
									"name": "4.3 The Ugly",
									"entries": [
										"If the party fails a sixth quest, they return to the first challenge that they failed and come to the horrific realization that they are now trapped in an endless time loop in the Space Between. They have failed utterly. Carol Anne is damned, and now, so are they. This ends the adventure leaving the characters in eternal damnation."
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Denouement",
							"entries": [
								"If Gertrude is defeated in either scenario, the party returns to the present, on the grounds of St. Greycastle's.",
								"If the good ending was achieved, the hospital still stands. The city around it bustles with activity. A beautiful, elderly woman dressed in healer's garb steps out of the door and approaches the group.",
								"\"Thank you,\" she says with a smirk. \"It worked.\"",
								"This is Carol Anne, an adult who now leads the healers at St. Greycastle's.",
								"If asked, Carol Anne explains that her longevity in life is a strange side effect from the supernatural ordeals her soul faced during the events of The Haunt series.",
								"If the bad ending was achieved, the party arrives at the ruins of St. Greycastle's, much in the state they are found in at the beginning of The Haunt 2. An elderly woman, dressed in wizard's robes approaches the group. Removing her hood, she introduces herself as Carol Anne and invites the group to her Manor, where she feeds them and explains that she has studied magic her whole life to keep the area safe from orcs and hags. She thanks the group and offers them one rare magic item of their choice in exchange for their service (DM's discretion).",
								"If asked, Carol Anne explains that her longevity in life is a strange side effect from the supernatural ordeals her soul faced during the events of The Haunt series."
							]
						},
						{
							"type": "entries",
							"name": "Appendix",
							"entries": [
								{
									"type": "entries",
									"name": "A: Monsters",
									"entries": [
										"[Adult Oblex]",
										"[Bleeder Nurse]",
										"[Bleeder Nurse (Variant)]",
										"[Evil Doll]]",
										"[Ghost]",
										"[Giant Four-Armed Gargoyle]",
										"[Giant Mimic]",
										"[Fiendish Maggot]",
										"[The Lonely]",
										"[Netherchild]",
										"[Netherchild Forsaken]",
										"[Specter]",
										"[Swarm of Insects]",
										"[Sword Wraith Commander]",
										"[Vomit Spawn]",
										"[The Wretched]",
										"[Specter (Haunt Variant)]"
									]
								},
								{
									"type": "entries",
									"name": "B: Maps",
									"entries": [
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20051.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20052.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20053.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20054.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20055.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20056.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20057.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20058.jpg"
											}
										},
										{
											"type": "image",
											"href": {
												"type": "external",
												"url": "https://gitlab.com/dd_5e_homebrew/pbp_ht/-/raw/master/3/images/Inline%20Art%20059.jpg"
											}
										}
									]
								}
							]
						}
					]
				}
			]
		}
	],
	"monster": [
		{
			"name": "Evil Doll",
			"source": "pbp_ht",
			"page": 0,
			"size": [
				"T"
			],
			"type": "construct",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				14
			],
			"hp": {
				"average": 119,
				"formula": "14d10 + 42"
			},
			"speed": {
				"walk": 20
			},
			"str": 7,
			"dex": 18,
			"con": 17,
			"int": 8,
			"wis": 10,
			"cha": 16,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"resist": [
				{
					"resist": [
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"poison"
			],
			"vulnerable": [
				"fire"
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"frightened",
				"paralyzed",
				"poisoned",
				"unconscious"
			],
			"languages": [
				"Common"
			],
			"cr": "4",
			"trait": [
				{
					"name": "False Appearance",
					"entries": [
						"While the evil doll remains motionless, it is indistinguishable from an ordinary, inanimate children's doll."
					]
				},
				{
					"name": "Frightening Lullaby",
					"entries": [
						"Once per day, the evil doll can use a bonus action to sing a creepy children's lullaby. All creatures within a 30 ft. radius, that can hear it, must succeed a {@dc 15} Wisdom saving throw.  On a failed saving throw the creature becomes {@condition frightened} and must succeed on another {@dc 15} Wisdom saving throw to break the enchantment at the end of their next turn. On a second failed save, the creature then becomes {@condition paralyzed}, and can attempt a {@dc 15} Wisdom saving throw on each turn.  Once it has succeeded a saving throw, the creature is no longer {@condition paralyzed}"
					]
				},
				{
					"name": "Shadow Blend {@recharge 5}",
					"entries": [
						"As a bonus action, the evil doll can disappear to the evil places that lurk in the shadows. Use this feature as an escape mechanism."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The evil doll makes two attacks: one with its knife and one with its claw."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 6} to hit, reach 5ft., one target. Hit 7 ({@damage 1d6 + 4}) slashing damage."
					]
				},
				{
					"name": "Knife",
					"entries": [
						"{@atk mw} {@hit 6} to hit, reach 5ft., one target. Hit 11 ({@damage 2d6 + 4}) piercing damage."
					]
				}
			],
			"traitTags": [
				"False Appearance"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"C"
			],
			"damageTags": [
				"P",
				"S"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"frightened"
			]
		},
		{
			"name": "Adult Oblex",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "ooze",
			"alignment": [
				"L",
				"E"
			],
			"ac": [
				14
			],
			"hp": {
				"average": 75,
				"formula": "10d8 + 30"
			},
			"speed": {
				"walk": 20
			},
			"str": 8,
			"dex": 19,
			"con": 16,
			"int": 19,
			"wis": 12,
			"cha": 15,
			"save": {
				"int": "+7",
				"cha": "+5"
			},
			"skill": {
				"deception": "+5",
				"perception": "+4"
			},
			"senses": [
				"blindsight 60 ft. (blind beyond this distance)"
			],
			"passive": 14,
			"conditionImmune": [
				"blinded",
				"charmed",
				"deafened",
				"exhaustion",
				"prone"
			],
			"languages": [
				"Common plus two more languages"
			],
			"cr": "5",
			"spellcasting": [
				{
					"name": "Innate Spellcasting",
					"headerEntries": [
						"The oblex's innate spellcasting ability is Intelligence (spell save {@dc 15}). It can innately cast the following spells, requiring no components:"
					],
					"daily": {
						"3e": [
							"{@spell charm person} (as 5th-level spell)",
							"{@spell color spray}",
							"{@spell detect thoughts}",
							"{@spell hold person} (as 3rd-level spell)"
						]
					},
					"ability": "int"
				}
			],
			"trait": [
				{
					"name": "Amorphous",
					"entries": [
						"The oblex can move through a space as narrow as 1 inch wide without squeezing."
					]
				},
				{
					"name": "Aversion to Fire",
					"entries": [
						"If the oblex takes fire damage, it has disadvantage on attack rolls and ability checks until the end of its next turn."
					]
				},
				{
					"name": "Sulfurous Impersonation",
					"entries": [
						"As a bonus action, the oblex can extrude a piece of itself that assumes the appearance of one Medium or smaller creature whose memories it has stolen.",
						"This simulacrum appears, feels, and sounds exactly like the creature it impersonates, though it smells faintly of sulfur.",
						"The oblex can impersonate {@dice 1d4 + 1} different creatures, each one tethered to its body by a strand of slime that can extend up to 120 feet away. For all practical purposes, the simulacrum is the oblex, meaning that the oblex occupies its space and the simulacrum's space simultaneously. The slimy tether is immune to damage, but it is severed if there is no opening at least 1 inch wide between the oblex's main body and the simulacrum. The simulacrum disappears if the tether is severed."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The oblex makes one pseudopod attack and uses Eat Memories."
					]
				},
				{
					"name": "Pseudopod",
					"entries": [
						"{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}7 ({@damage 1d6 + 4}) bludgeoning damage plus 5 ({@damage 2d4}) psychic damage."
					]
				},
				{
					"name": "Eat Memories",
					"entries": [
						"The oblex targets one creature it can see within 5 feet of it. The target must succeed on a {@dc 15} Wisdom saving throw or take 18 ({@damage 4d8}) psychic damage and become memory drained until it finishes a short or long rest or until it benefits from the greater restoration or {@spell heal} spell.",
						"Constructs, oozes, plants, and undead succeed on the save automatically.",
						"While memory drained, the target must roll a {@dice d4} and subtract the number rolled from any ability check or attack roll it makes. Each time the target is memory drained beyond the first, the die size increases by one: the {@dice d4} becomes a {@dice d6}, the {@dice d6} becomes a {@dice d8}, and so on until the die becomes a {@dice d20}, at which point the target becomes {@condition unconscious} for 1 hour. The effect then ends.",
						"When an oblex causes a target to become memory drained, the oblex learns all the languages the target knows and gains all its proficiencies, except for any saving throw proficiencies."
					]
				}
			],
			"traitTags": [
				"Amorphous"
			],
			"senseTags": [
				"B"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"C",
				"X"
			],
			"damageTags": [
				"B",
				"Y"
			],
			"spellcastingTags": [
				"I"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"unconscious"
			],
			"conditionInflictSpell": [
				"blinded",
				"charmed",
				"paralyzed"
			]
		},
		{
			"name": "Bleeder Nurse",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "aberration",
			"alignment": [
				"C",
				"N"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 127,
				"formula": "17d8 + 51"
			},
			"speed": {
				"walk": 20
			},
			"str": 18,
			"dex": 18,
			"con": 16,
			"int": 13,
			"wis": 8,
			"cha": 14,
			"save": {
				"dex": "+7",
				"wis": "+2",
				"cha": "+5"
			},
			"passive": 16,
			"conditionImmune": [
				"charmed",
				"frightened",
				"stunned"
			],
			"languages": [
				"Challenge 8 (3,900 XP)"
			],
			"trait": [
				{
					"name": "Blinded",
					"entries": [
						"The bleeder nurse cannot see. It relies on its Sense"
					]
				},
				{
					"name": "Magic Weapons",
					"entries": [
						"The bleeder nurse's weapon attacks are magical."
					]
				},
				{
					"name": "Reactive",
					"entries": [
						"The bleeder nurse can take one reaction on every turn in a combat."
					]
				},
				{
					"name": "Sense Movement",
					"entries": [
						"The Bleeder nurse knows the exact location of any other creature who uses 15 feet or more of movement while within 30 feet of the bleeder nurse. The bleeder nurse suffers no penalty for being {@condition blinded} when attacking a creature detected via sense movement until the end of the bleeder nurse's next turn."
					]
				},
				{
					"name": "Sentinel",
					"entries": [
						"The bleeder nurse has all the benefits of the sentinel feat"
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The bleeder nurse makes two claw attacks."
					]
				},
				{
					"name": "Claws",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}9 ({@damage 1d10 + 4}) slashing damage. On a hit, the target must make a {@dc 15} Constitution saving throw suffering an additional 21 ({@dice 6d6}) hit points due to blood loss on a failed save, and half as much on a success. If the target fails its Constitution save, it takes an additional 21 ({@dice 6d6}) hit points due to blood loss on the end of each of the bleeder nurse's turns. A successful {@dc 15} Constitution saving throw or receiving magical healing will end this effect. If the target or an ally uses one action and expends one use of a healer's kit, succeeding on a {@b {@dc 15} Wisdom (Medicine)} check will stop the bleeding."
					]
				}
			],
			"reaction": [
				{
					"name": "Parry",
					"entries": [
						"The bleeder nurse adds 2 to its AC against one melee attack that would hit it. To do so, the bleeder nurse must be able to detect the attacker via sense movement."
					]
				},
				{
					"name": "Sentinel Strike",
					"entries": [
						"When a creature within 5 feet of the bleeder nurse makes an attack against a target other than the bleeder nurse (including another bleeder nurse), the bleeder nurse can use a reaction to make a melee weapon attack against the attacking creature."
					]
				}
			],
			"traitTags": [
				"Magic Weapons"
			],
			"actionTags": [
				"Multiattack",
				"Parry"
			],
			"damageTags": [
				"S"
			],
			"miscTags": [
				"MW"
			]
		},
		{
			"name": "Fiendish Maggot",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "fiend",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 12,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 39,
				"formula": "6d8 + 12"
			},
			"speed": {
				"walk": 20
			},
			"str": 17,
			"dex": 10,
			"con": 15,
			"int": 3,
			"wis": 5,
			"cha": 4,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 7,
			"resist": [
				"cold",
				"fire",
				"lightning"
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"poisoned"
			],
			"languages": [
				"Challenge 1 (200 XP)"
			],
			"trait": [
				{
					"name": "Stench",
					"entries": [
						"Any creature that starts its turn within 10 feet of the fiendish maggot must succeed at a {@dc 12} Constitution saving throw or be {@condition poisoned} until the start of its next turn.",
						"On a successful saving throw, the creature is immune to the fiendish maggot's stench for 24 hours."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}8 ({@damage 2d4 + 3}) piercing damage."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"damageTags": [
				"P"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"poisoned"
			]
		},
		{
			"name": "Netherchild",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"S"
			],
			"type": "fiend",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 9,
				"formula": "2d6 + 2"
			},
			"speed": {
				"walk": 40
			},
			"str": 9,
			"dex": 16,
			"con": 12,
			"int": 12,
			"wis": 11,
			"cha": 10,
			"skill": {
				"stealth": "+5"
			},
			"senses": [
				"darkvision 120 ft"
			],
			"passive": 10,
			"resist": [
				"cold",
				"fire",
				"lightning"
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"deafened",
				"poisoned"
			],
			"languages": [
				"Common"
			],
			"cr": "1",
			"trait": [
				{
					"name": "Nimble Escape",
					"entries": [
						"The netherchild can take the Disengage or"
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}6 ({@damage 1d6 + 3}) piercing damage."
					]
				}
			],
			"senseTags": [
				"SD"
			],
			"languageTags": [
				"C"
			],
			"damageTags": [
				"P"
			],
			"miscTags": [
				"MW"
			]
		},
		{
			"name": "Specter",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "undead",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				12
			],
			"hp": {
				"average": 22,
				"formula": "5d8"
			},
			"speed": {
				"walk": 0,
				"fly": {
					"number": 50,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 1,
			"dex": 14,
			"con": 11,
			"int": 10,
			"wis": 10,
			"cha": 11,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"resist": [
				"acid",
				"cold",
				"fire",
				"lightning",
				"thunder",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"necrotic",
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"grappled",
				"paralyzed",
				"petrified",
				"poisoned",
				"prone",
				"restrained",
				"unconscious"
			],
			"languages": [
				"understands all languages it knew in life but can't speak"
			],
			"cr": "1",
			"trait": [
				{
					"name": "Incorporeal Movement",
					"entries": [
						"The specter can move through other creatures and objects as if they were difficult terrain. It takes 5 ({@damage 1d10}) force damage if it ends its turn inside an object."
					]
				},
				{
					"name": "Sunlight Sensitivity",
					"entries": [
						"While in sunlight, the specter has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
					]
				}
			],
			"action": [
				{
					"name": "Mindshatter",
					"entries": [
						"{@atk ms} {@hit 4} to hit, reach 5 ft., one creature. {@h}10 ({@damage 3d6}) psychic damage. The target must succeed on a {@dc 10} wisdom saving throw or its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the creature finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. In addition, on a failed save the target suffers an indefinite madness until cured."
					]
				}
			],
			"traitTags": [
				"Incorporeal Movement",
				"Sunlight Sensitivity"
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"CS",
				"LF"
			],
			"damageTags": [
				"O",
				"Y"
			],
			"miscTags": [
				"HPR"
			]
		},
		{
			"name": "Swarm of Insects",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "beast",
			"alignment": [
				"U"
			],
			"ac": [
				{
					"ac": 12,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 22,
				"formula": "5d8"
			},
			"speed": {
				"walk": 20,
				"climb": 20
			},
			"str": 3,
			"dex": 13,
			"con": 10,
			"int": 1,
			"wis": 7,
			"cha": 1,
			"senses": [
				"blindsight 10 ft."
			],
			"passive": 8,
			"resist": [
				"bludgeoning",
				"piercing",
				"slashing"
			],
			"conditionImmune": [
				"charmed",
				"frightened",
				"grappled",
				"paralyzed",
				"petrified",
				"prone",
				"restrained",
				"stunned"
			],
			"languages": [
				"Challenge 1/2 (100 XP)"
			],
			"trait": [
				{
					"name": "Swarm",
					"entries": [
						"The swarm can occupy another creature's space and vice versa, and the swarm can move through any opening large enough for a Tiny insect. The swarm can't regain hit points or gain temporary hit points."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 3} to hit, reach 0 ft., one target in the swarm's space. {@h}10 ({@damage 4d4}) piercing damage, or 5 ({@damage 2d4}) piercing damage if the swarm has half of its hit points or fewer."
					]
				}
			],
			"senseTags": [
				"B"
			],
			"damageTags": [
				"P"
			],
			"miscTags": [
				"MW"
			]
		},
		{
			"name": "Sword Wraith Commander",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "undead",
			"alignment": [
				"L",
				"E"
			],
			"ac": [
				{
					"ac": 18,
					"from": [
						"{@item breastplate|PHB}",
						"{@item shield|PHB}"
					]
				}
			],
			"hp": {
				"average": 127,
				"formula": "15d8 + 60"
			},
			"speed": {
				"walk": 30
			},
			"str": 18,
			"dex": 14,
			"con": 18,
			"int": 11,
			"wis": 12,
			"cha": 14,
			"skill": {
				"perception": "+4"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 14,
			"resist": [
				"necrotic",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"exhaustion",
				"frightened",
				"poisoned",
				"unconscious"
			],
			"languages": [
				"any languages it knew in life"
			],
			"cr": "8",
			"trait": [
				{
					"name": "Martial Fury",
					"entries": [
						"As a bonus action, the sword wraith can make one weapon attack, which deals an extra 9 ({@damage 2d8}) necrotic damage on a hit. If it does so, attack rolls against it have advantage until the start of its next turn."
					]
				},
				{
					"name": "Turning Defiance",
					"entries": [
						"The sword wraith and any other sword wraiths within 30 feet of it have advantage on saving throws against effects that turn undead."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The sword wraith makes two weapon attacks."
					]
				},
				{
					"name": "Longsword",
					"entries": [
						"{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}8 ({@damage 1d8 + 4}) slashing damage, or 9 ({@damage 1d10 + 4}) slashing damage if used with two hands."
					]
				},
				{
					"name": "Longbow",
					"entries": [
						"{@atk rw} {@hit 5} to hit, range 150/600 ft., one target. {@h}6 ({@damage 1d8 + 2}) piercing damage."
					]
				},
				{
					"name": "Call to Honor (1/Day)",
					"entries": [
						"To use this action, the sword wraith must have taken damage during the current combat. If the sword wraith can use this action, it gives itself advantage on attack rolls until the end of its next turn, and {@dice 1d4 + 1} sword wraith warriors appear in unoccupied spaces within 30 feet of it. The warriors last until they drop to 0 hit points, and they take their turns immediately after the commander's turn on the same initiative count."
					]
				}
			],
			"traitTags": [
				"Turn Resistance"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"LF"
			],
			"damageTags": [
				"N",
				"P",
				"S"
			],
			"miscTags": [
				"MW",
				"RNG",
				"RW"
			]
		},
		{
			"name": "The Wretched",
			"isNamedCreature": true,
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"S"
			],
			"type": "monstrosity",
			"alignment": [
				"N",
				"E"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 10,
				"formula": "4d6 - 4"
			},
			"speed": {
				"walk": 40
			},
			"str": 7,
			"dex": 12,
			"con": 9,
			"int": 5,
			"wis": 6,
			"cha": 5,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 8,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks while in dim light or darkness",
					"cond": true
				}
			],
			"languages": [
				"Challenge 1/4 (50 XP)"
			],
			"trait": [
				{
					"name": "Wretched Pack Tactics",
					"entries": [
						"The Wretched has advantage on an attack roll against a creature if at least one of the Wretched's allies is within 5 feet of the creature and the ally isn't {@condition incapacitated}. The Wretched otherwise has disadvantage on attack rolls."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 3} to hit, reach 5 ft., one target. {@h}6 ({@damage 1d10 + 1}) piercing damage, and the Wretched attaches to the target. While attached, the Wretched can't attack, and at the start of each of the Wretched's turns, the target takes 6 ({@damage 1d10 + 1}) necrotic damage.",
						"The attached Wretched moves with the target whenever the target moves, requiring none of the Wretched's movement.",
						"The Wretched can detach itself by spending 5 feet of its movement on its turn. A creature, including the target, can use its action to detach a Wretched."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"damageTags": [
				"N",
				"P"
			],
			"miscTags": [
				"MW"
			]
		},
		{
			"name": "Vomit Spawn",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"L"
			],
			"type": "ooze",
			"alignment": [
				"U"
			],
			"ac": [
				8
			],
			"hp": {
				"average": 22,
				"formula": "3d8 + 9"
			},
			"speed": {
				"walk": 20
			},
			"str": 15,
			"dex": 6,
			"con": 16,
			"int": 3,
			"wis": 6,
			"cha": 3,
			"senses": [
				"blindsight 60 ft. (blind beyond this radius)"
			],
			"passive": 8,
			"resist": [
				"piercing"
			],
			"conditionImmune": [
				"blinded",
				"charmed",
				"deafened",
				"exhaustion",
				"frightened",
				"prone"
			],
			"languages": [
				"Challenge 1/2 (100 XP)"
			],
			"trait": [
				{
					"name": "Amorphous",
					"entries": [
						"The vomit spawn can move through space as narrow as 1 inch wide without squeezing."
					]
				},
				{
					"name": "False Appearance",
					"entries": [
						"While the vomit spawn remains motionless, it is indistinguishable from an inanimate puddle of vomit."
					]
				},
				{
					"name": "Stench",
					"entries": [
						"Any creature that starts its turn within 10 feet of the vomit spawn must succeed at a {@dc 12} Constitution saving throw or be {@condition poisoned} until the start of its next turn. On a successful saving throw, the creature is immune to the vomit spawn's stench for 24 hours."
					]
				}
			],
			"action": [
				{
					"name": "Pseudopod",
					"entries": [
						"{@atk mw} {@hit 4} to hit, reach 5 ft., one creature. {@h}5 ({@damage 1d6 + 2}) bludgeoning damage plus 7 ({@damage 2d6}) acid damage."
					]
				}
			],
			"traitTags": [
				"Amorphous",
				"False Appearance"
			],
			"senseTags": [
				"B"
			],
			"damageTags": [
				"A",
				"B"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"poisoned"
			]
		},
		{
			"name": "Netherchild Forsaken",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"S"
			],
			"type": "fiend",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 16,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 33,
				"formula": "6d6 + 12"
			},
			"speed": {
				"walk": 10,
				"fly": {
					"number": 30,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 7,
			"dex": 16,
			"con": 14,
			"int": 7,
			"wis": 12,
			"cha": 10,
			"save": {
				"dex": "+5"
			},
			"skill": {
				"stealth": "+5",
				"perception": "+3"
			},
			"senses": [
				"darkvision 120 ft"
			],
			"passive": 13,
			"resist": [
				"cold",
				"fire",
				"lightning"
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"frightened",
				"poisoned"
			],
			"languages": [
				"Common"
			],
			"cr": "3",
			"trait": [
				{
					"name": "Nimble Escape",
					"entries": [
						"The netherchild forsaken can take the Disengage or Hide action as a bonus action on each of its turns."
					]
				},
				{
					"name": "Conduit of Misery",
					"entries": [
						"A creature that touches the netherchild forsaken or hits it with a melee attack while within 5 feet of it takes 4 ({@damage 1d8}) psychic damage."
					]
				}
			],
			"action": [
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5ft, one target. {@h}8 ({@damage 1d10 + 3}) piercing damage."
					]
				},
				{
					"name": "Spew",
					"entries": [
						"{@atk rw} {@hit 5} to hit, range 20/40 ft., one creature. {@h}9 ({@damage 2d8}) acid damage."
					]
				},
				{
					"name": "Wail",
					"entries": [
						"(Recharge 5-6). The netherchild forsaken unhinges its jaw and releases a bloodcurdling scream. Each creature within 15 ft of the netherchild forsaken that can hear it must make a {@dc 12} Constitution saving throw. On a failed save, a creature takes 11 ({@damage 2d10}) thunder damage and is {@condition deafened} until the end of its next turn. On a successful save, the creature takes half as much damage and is not {@condition deafened}."
					]
				}
			],
			"senseTags": [
				"SD"
			],
			"languageTags": [
				"C"
			],
			"damageTags": [
				"A",
				"P",
				"T",
				"Y"
			],
			"miscTags": [
				"MW",
				"RW"
			],
			"conditionInflict": [
				"deafened"
			]
		},
		{
			"name": "Bleeder Nurse (Variant)",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "aberration",
			"alignment": [
				"C",
				"N"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 127,
				"formula": "17d8 + 51"
			},
			"speed": {
				"walk": 20
			},
			"str": 18,
			"dex": 18,
			"con": 16,
			"int": 13,
			"wis": 8,
			"cha": 14,
			"save": {
				"dex": "+7",
				"wis": "+2",
				"cha": "+5"
			},
			"passive": 16,
			"conditionImmune": [
				"charmed",
				"frightened",
				"stunned"
			],
			"languages": [
				"Challenge 8 (3,900 XP)"
			],
			"trait": [
				{
					"name": "Blinded",
					"entries": [
						"The bleeder nurse cannot see. It makes all attack checks with disadvantage."
					]
				},
				{
					"name": "Magic Weapons",
					"entries": [
						"The bleeder nurse's weapon attacks are magical."
					]
				},
				{
					"name": "Reactive",
					"entries": [
						"The bleeder nurse can take one reaction on every turn in a combat."
					]
				},
				{
					"name": "Sentinel",
					"entries": [
						"The bleeder nurse has all the benefits of the sentinel feat"
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The bleeder nurse makes two claw attacks."
					]
				},
				{
					"name": "Claws",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}9 ({@damage 1d10 + 4}) slashing damage. On a hit, the target must make a {@dc 15} Constitution saving throw suffering an additional 21 ({@dice 6d6}) hit points due to blood loss on a failed save, and half as much on a success. If the target fails its Constitution save, it takes an additional 21 ({@dice 6d6}) hit points due to blood loss on the end of each of the bleeder nurse's turns. A successful {@dc 15} Constitution saving throw or receiving magical healing will end this effect. If the target or an ally uses one action and expends one use of a healer's kit, succeeding on a {@b {@dc 15} Wisdom (Medicine)} check will stop the bleeding."
					]
				}
			],
			"reaction": [
				{
					"name": "Parry",
					"entries": [
						"The bleeder nurse adds 2 to its AC against one melee attack that would hit it."
					]
				},
				{
					"name": "Sentinel Strike",
					"entries": [
						"When a creature within 5 feet of the bleeder nurse makes an attack against a target other than the bleeder nurse (including another bleeder nurse), the bleeder nurse can use a reaction to make a melee weapon attack against the attacking creature."
					]
				}
			],
			"traitTags": [
				"Magic Weapons"
			],
			"actionTags": [
				"Multiattack",
				"Parry"
			],
			"damageTags": [
				"S"
			],
			"miscTags": [
				"MW"
			]
		},
		{
			"name": "Ghost",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "undead",
			"alignment": [
				"A"
			],
			"ac": [
				11
			],
			"hp": {
				"average": 45,
				"formula": "10d8"
			},
			"speed": {
				"walk": 0,
				"fly": {
					"number": 40,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 7,
			"dex": 13,
			"con": 10,
			"int": 10,
			"wis": 12,
			"cha": 17,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 11,
			"resist": [
				"acid",
				"fire",
				"lightning",
				"thunder",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks",
					"cond": true
				}
			],
			"immune": [
				"cold",
				"necrotic",
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"frightened",
				"grappled",
				"paralyzed",
				"petrified",
				"poisoned",
				"prone",
				"restrained"
			],
			"languages": [
				"Any languages it knew in life"
			],
			"cr": "4",
			"trait": [
				{
					"name": "Ethereal Sight",
					"entries": [
						"The ghost can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa."
					]
				},
				{
					"name": "Incorporeal Movement",
					"entries": [
						"The ghost can move through other creatures and objects as if they were difficult terrain. It takes 5 ({@damage 1d10}) force damage if it ends its turn inside an object."
					]
				}
			],
			"action": [
				{
					"name": "Withering Touch",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}17 ({@damage 4d6 + 3}) necrotic damage."
					]
				},
				{
					"name": "Etherealness",
					"entries": [
						"The ghost enters the Ethereal Plane from the Material Plane, or vice versa. It is visible on the Material Plane while it is in the Border Ethereal, and vice versa, yet it can't affect or be affected by anything on the other plane."
					]
				},
				{
					"name": "Horrifying Visage",
					"entries": [
						"Each non-undead creature within 60 feet of the ghost that can see it must succeed on a {@dc 13} Wisdom saving throw or be {@condition frightened} for 1 minute. If the save fails by 5 or more, the target also ages {@dice 1d4} &#215; 10 years.",
						"A {@condition frightened} target can repeat the saving throw at the end of each of its turns, ending the {@condition frightened} condition on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to this ghost's Horrifying Visage for the next 24 hours. The aging effect can be reversed with a {@spell greater restoration} spell, but only within 24 hours of it occurring."
					]
				},
				{
					"name": "Possession {@recharge}",
					"entries": [
						"One humanoid that the ghost can see within 5 feet of it must succeed on a {@dc 13} Charisma saving throw or be possessed by the ghost; the ghost then disappears, and the target is {@condition incapacitated} and loses control of its body. The ghost now controls the body but doesn't deprive the target of awareness. The ghost can't be targeted by any attack, spell, or other effect, except ones that turn undead, and it retains its alignment, Intelligence, Wisdom, Charisma, and immunity to being {@condition charmed} and {@condition frightened}. It otherwise uses the possessed target's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies.",
						"The possession lasts until the body drops to 0 hit points, the ghost ends it as a bonus action, or the ghost is turned or forced out by an effect like the {@spell dispel evil and good} spell. When the possession ends, the ghost reappears in an unoccupied space within 5 feet of the body. The target is immune to this ghost's Possession for 24 hours after succeeding on the saving throw or after the possession ends."
					]
				}
			],
			"traitTags": [
				"Incorporeal Movement"
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"LF"
			],
			"damageTags": [
				"N",
				"O"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"frightened",
				"incapacitated"
			]
		},
		{
			"name": "Giant Four-Armed Gargoyle",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"L"
			],
			"type": "elemental",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 17,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 147,
				"formula": "14d10 + 70"
			},
			"speed": {
				"walk": 30,
				"fly": 60
			},
			"str": 19,
			"dex": 11,
			"con": 20,
			"int": 6,
			"wis": 11,
			"cha": 9,
			"save": {
				"wis": "+4"
			},
			"skill": {
				"perception": "+4"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 14,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks that aren't adamantine",
					"cond": true
				}
			],
			"immune": [
				"poison",
				"petrified",
				"poisoned"
			],
			"conditionImmune": [
				"exhaustion"
			],
			"languages": [
				"Terran"
			],
			"cr": "10",
			"trait": [
				{
					"name": "False Appearance",
					"entries": [
						"While the gargoyle remains motionless, it is indistinguishable from an inanimate statue."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The gargoyle makes five attacks: one with its bite and four with its claws."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target.  {@h}11 ({@damage 2d6 + 4}) piercing damage."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target.  {@h}9 ({@damage 2d4 + 4}) slashing damage"
					]
				}
			],
			"traitTags": [
				"False Appearance"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"T"
			],
			"damageTags": [
				"P",
				"S"
			],
			"miscTags": [
				"MW"
			]
		},
		{
			"name": "Giant Mimic",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"L"
			],
			"type": {
				"type": "monstrosity",
				"tags": [
					"shapechanger"
				]
			},
			"alignment": [
				"N"
			],
			"ac": [
				{
					"ac": 12,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 75,
				"formula": "10d10 + 20"
			},
			"speed": {
				"walk": 15
			},
			"str": 17,
			"dex": 12,
			"con": 15,
			"int": 5,
			"wis": 13,
			"cha": 8,
			"skill": {
				"stealth": "+3"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 11,
			"immune": [
				"acid"
			],
			"conditionImmune": [
				"prone"
			],
			"languages": [
				"-Challenge 3 (700 XP)"
			],
			"trait": [
				{
					"name": "Shapechanger",
					"entries": [
						"The mimic can use its action to polymorph into an object or back into its true, amorphous form. Its statistics are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
					]
				},
				{
					"name": "Adhesive (Object Form Only)",
					"entries": [
						"The mimic adheres to anything that touches it. A Huge or smaller creature adhered to the mimic is also {@condition grappled} by it (escape {@dc 13}). Ability checks made to escape this grapple have disadvantage."
					]
				},
				{
					"name": "False Appearance (Object Form Only)",
					"entries": [
						"While the mimic remains motionless, it is indistinguishable from an ordinary object."
					]
				},
				{
					"name": "Grappler",
					"entries": [
						"The mimic has advantage on attack rolls against any creature {@condition grappled} by it."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The Giant Mimic attacks twice with its Pseudopod and once with its Bite."
					]
				},
				{
					"name": "Pseudopod",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}7 ({@damage 1d8 + 3}) bludgeoning damage. If the mimic is in object form, the target is subjected to its Adhesive trait."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target.  {@h}7 ({@damage 1d8 + 3}) piercing damage."
					]
				}
			],
			"traitTags": [
				"False Appearance",
				"Shapechanger"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"damageTags": [
				"B",
				"P"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"grappled"
			]
		},
		{
			"name": "Specter (Haunt Variant)",
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "undead",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				12
			],
			"hp": {
				"average": 22,
				"formula": "5d8"
			},
			"speed": {
				"walk": 0,
				"fly": {
					"number": 50,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 1,
			"dex": 14,
			"con": 11,
			"int": 10,
			"wis": 10,
			"cha": 11,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"resist": [
				"acid",
				"cold",
				"fire",
				"lightning",
				"thunder",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"necrotic",
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"grappled",
				"paralyzed",
				"petrified",
				"poisoned",
				"prone",
				"restrained",
				"unconscious"
			],
			"languages": [
				"understands all languages it knew in life but can't speak"
			],
			"cr": "1",
			"trait": [
				{
					"name": "Incorporeal Movement",
					"entries": [
						"The specter can move through other creatures and objects as if they were difficult terrain. It takes 5 ({@damage 1d10}) force damage if it ends its turn inside an object.  Sunlight Sensitivity. While in sunlight, the specter has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."
					]
				}
			],
			"action": [
				{
					"name": "Mindshatter",
					"entries": [
						"{@atk ms} {@hit 4} to hit, reach 5 ft., one creature. {@h}10 ({@damage 3d6}) psychic damage. The target must succeed on a {@dc 10} wisdom saving throw or its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the creature finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. In addition, on a failed save the target suffers an indefinite madness until cured."
					]
				},
				{
					"name": "Possession {@recharge}",
					"entries": [
						"One humanoid that the spectre can see within 5 feet of it must succeed on a {@dc 13} Charisma saving throw or be possessed by the spectre; the spectre then disappears, and the target is {@condition incapacitated} and loses control of its body. The spectre now controls the body but doesn't deprive the target of awareness. The spectre can't be targeted by any attack, spell, or other effect, except ones that turn undead, and it retains its alignment, Intelligence, Wisdom, Charisma, and immunity to being {@condition charmed}. It otherwise uses the possessed target's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies.",
						"The possession lasts until the body drops to 0 hit points, the spectre ends it as a bonus action, or the spectre is turned or forced out by an effect like the {@spell dispel evil and good} spell. When the possession ends, the spectre reappears in an unoccupied space within 5 feet of the body. The target is immune to this spectre's Possession for 24 hours after succeeding on the saving throw or after the possession ends."
					]
				}
			],
			"traitTags": [
				"Incorporeal Movement"
			],
			"senseTags": [
				"D"
			],
			"languageTags": [
				"CS",
				"LF"
			],
			"damageTags": [
				"O",
				"Y"
			],
			"miscTags": [
				"HPR"
			],
			"conditionInflict": [
				"incapacitated"
			]
		},
		{
			"name": "The Lonely",
			"isNamedCreature": true,
			"source": "haunt-trilogy",
			"page": 0,
			"size": [
				"M"
			],
			"type": "monstrosity",
			"alignment": [
				"N",
				"E"
			],
			"ac": [
				{
					"ac": 16,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 112,
				"formula": "15d8 + 45"
			},
			"speed": {
				"walk": 30
			},
			"str": 16,
			"dex": 12,
			"con": 17,
			"int": 6,
			"wis": 11,
			"cha": 6,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"resist": [
				"bludgeoning",
				"piercing",
				"slashing while in dim light or darkness"
			],
			"languages": [
				"Common"
			],
			"cr": "9",
			"trait": [
				{
					"name": "Psychic Leech",
					"entries": [
						"At the start of each of the lonely's turns, each creature within 5 feet of it must succeed on a {@dc 15} Wisdom saving throw or take 10 ({@damage 3d6}) psychic damage."
					]
				},
				{
					"name": "Thrives on Company",
					"entries": [
						"The lonely has advantage on attack rolls while it is within 30 feet of at least two other creatures. It otherwise has disadvantage on attack rolls."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The lonely makes one harpoon arm attack and uses Sorrowful Embrace."
					]
				},
				{
					"name": "Harpoon Arm",
					"entries": [
						"{@atk mw} {@hit 7} to hit, reach 60 ft., one target. {@h}21 ({@damage 4d8 + 3}) piercing damage, and the target is {@condition grappled} (escape {@dc 15}) if it is a Large or smaller creature.  The Lonely has two harpoon arms and can grapple up to two creatures at once."
					]
				},
				{
					"name": "Sorrowful Embrace",
					"entries": [
						"Each creature {@condition grappled} by the Lonely must make a {@dc 15} Wisdom saving throw. A creature takes 18 ({@damage 4d8}) psychic damage on a failed save, or half as much damage on a successful one. In either case, the Lonely pulls each creature {@condition grappled} by it up to 30 feet straight toward it."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"C"
			],
			"damageTags": [
				"P",
				"Y"
			],
			"miscTags": [
				"AOE",
				"MW",
				"RCH"
			],
			"conditionInflict": [
				"grappled"
			]
		}
	],
	"item": [
		{
			"name": "The Leacher's Emerald",
			"source": "php_ht",
			"page": 0,
			"rarity": "rare",
			"reqAttune": true,
			"wondrous": true,
			"entries": [
				{
					"type": "entries",
					"name": "Cost:",
					"entries": [
						"500-5000 gp",
						"This green emerald is an ancient relic imbued with necrotic energies by an evil necromancer long ago.",
						"Its master and wielder, once attuned, can attempt to magically implant the emerald into the chest of any living creature. The creature must successfully win a Grappling (PHB, pg. 195) contest to be able to resist the attempt.",
						"As a bonus action the emerald's master can use it to transfer {@dice 3d6} Hit Points from the victim to them-self if it is within 60 ft. The emerald has two charges per day and regains all of its charges at dawn.",
						"The gem exerts no control over the victim otherwise, but the master of the emerald knows it's direction and distance at all times. If the emerald crosses into another plane, the owner knows which one."
					]
				},
				{
					"type": "entries",
					"name": "Extraction",
					"entries": [
						"A skilled physician can remove the gem on a successful {@dc 17} Intelligence ({@skill Medicine}) check, but the patient suffers {@damage 4d10} piercing damage on every attempt. A greater restoration spell can be used to eject the gem.",
						"The emerald radiates evil, and should its 'master' ever use it for it's intended purpose, their alignment permanently shifts a step closer to evil."
					]
				}
			]
		}
	]
}