{
	"schema": "https://github.com/TheGiddyLimit/5etools-utils/tree/master/schema/brew-fast/homebrew.json",
	"_meta": {
		"sources": [
				{
						"json": "gp_lhce",
						"abbreviation": "gp_lhce",
						"full": "Legendary Hunts Coastal Encounters",
						"authors": [
								"Grim Press"
						],
						"convertedBy": [
								"deltadave"
						],
						"version": "1.0",
						"url": "https://github.com/deltadave/5e_homebrew",
						"targetSchema": "1.0.0"
				}
		],
		"dateAdded": 1672640448,
		"dateLastModified": 1672640456
	},
	"adventure": [
			{
				"name": "Legendary Hunts Coastal Encounters",
				"id": "gp_lhce",
				"source": "Legendary Hunts Coastal Encounters",
				"group": "other",
				"level": {
					"start": 1,
					"end": 20
				},
				"published": "2020-06-01",
				"storyline": "Legendary Hunts",
				"coverUrl": "",
				"contents": [
					{
						"name" : "Legendary Hunts: Coastal Encounters",
						"headers" : [
							"Legendary Hunts: Coastal Encounters"
						]
					}
				]
			}
	],
	"adventureData": [
		{
			"id": "gp_lhce",
			"source": "Legendary Hunts Coastal Encounters",
			"data": [ 
				{
					"type": "section",
					"name": "Legendary Hunts: Coastal Encounters",
					"entries": [
						{
							"type": "image",
							"href": {
								"type": "external",
								"url": ""
							},
							"title": "Front Cover"
						},
						{
							"type": "entries",
							"name": "Credits",
							"entries": [
								"{@b Legendary Hunts Lead Designer}: Vall Syrene",
								"{@b Editor}: Joshua Barbeau",
								"{@b Adventure Writers}: Blue Maelstrom, Jimmy Meritt, Vall Syrene",
								"{@b Creature Lore}: Ayla Finnegan, Blue Maelstrom, Jimmy Meritt, Joshua Barbeau, Vall Syrene",
								"{@b Stat Block Design}: Darren Kenny, Vall Syrene",
								"{@b Magical Items}: BornToDoStuff, Vall Syrene",
								"{@b Interior Creature Art:} Florian Jonak, Vall Syrene",
								"{@b Cover Art}: Johannes Holm ( https://johannesholm.pb.online/ )",
								"{@b Landscape Photography}: Ayla Finnegan",
								"{@b Encounter Icon Mechanics} &copy; 2020 Vall Syrene/Vall Does DnD",
								"{@b Artist Credits}",
								"Scattered envelopes and scroll art &copy; Anderson Maia",
								"Border art &copy; The Knotty Works",
								"Some artwork &copy; 2019 Dean Spencer, used with permission. All rights reserved.",
								"Publisher's Choice Quality Stock Art &copy;Rick Hershey/Fat Goblin Games",
								"Modular Notice Boards Graphic Assets by Elven Tower",
								"Cartography and Forgotten Adventures",
								"Encounter Icon Art &copy;2020 Brittney Hay",
								"Indesign template by Nathana&#xeb;l Roux",
								"{@b Playtesters}",
								"Angus McQuarrie, Ayla Finnegan, Brian Poel, Caitlin O'Sullivan, Eric Cairns, Mark Ando, Mark Dreessen, Matthew Braithwaite, Mike Horstmanshof, Russ Lindsay, Tony Parker, Vall Syrene",
								"{@b On the cover}: A lone adventurer stands ready to deliver the killing blow to a monstrous oceanic titan in this beautiful painting by Johannes Holm.",
								{
									"type": "image",
									"href": {
										"type": "external",
										"url": ""
									}
								},
								"{@b Special Thanks}",
								"My wonderful partner who tolerated my late nights and hard work for the past year, my incredible fans, (whom without this book wouldn't have been possible), the DMsGuild creative community, Devi Ishtar for her Atropos lore ideas, Laura Hirsbrunner for her cover layout insight, Bryan Holmes for being the greatest hype-man I could ask for, and Steve Fidler, R.P. Davis and Nathana&#xeb;l Roux for their Indesign advice keeping my sanity intact.",
								"\"In loving memory of Eddie Collins, whose love and support for my writing pushed me to better myself after each release. Even though you never understood it, you loved my strange little hobby all the same. This one's for you.\"",
								"- Vall Syrene, 2020",
								"\"I'd like to dedicate my contributions to this book in loving memory of Jessica and Carlos Pereira.  In 2012 I lost the love of my life, Jessica. Grieving her was the hardest thing I've ever had to do, but it was made easier by the fact that her family allowed me to grieve with them. While working on this book, Jessica's father Carlos passed. Thank you, Carlos, for welcoming me into your family with open arms and becoming one of my dearest friends. I still keep your daughter alive in my memories every single day, and now I do so for you, too.\"",
								"- Joshua Barbeau, 2020"
							]
						},
						{
							"type": "entries",
							"name": "Vall Does DnD",
							"entries": [
								{
									"type": "image",
									"href": {
										"type": "external",
										"url": ""
									}
								},
								"Disclaimer: This handbook contains a host of titanic, destructive, world shattering monsters, awesome magical weapons and fantastic coastal critters for your D&D games. Vall Does DnD does not take any responsibility for TPKs or character deaths resulting from, but not limited to: Challenging the deep dweller to a one on one combat, taking a swim in a suspicious looking coral reef, stealing gold from a bathyal beholder or befriending floating critters at sea.",
								"DUNGEONS & DRAGONS, D&D, Wizards of the Coast, Forgotten Realms, Ravenloft, Eberron, the dragon ampersand, and all other Wizards of the Coast product names, and their respective logos are trademarks of Wizards of the Coast in the USA and other countries.",
								"This work contains material that is copyright Wizards of the Coast and/or other authors. Such material is used with permission under the Community Content Agreement for Dungeon Masters Guild.",
								"All other original material in this work is copyright 2020 by Vall Syrene, Jimmy Meritt, Joshua Barbeau, Darren Kenny, BornToDoStuff, Ayla Finnegan and Blue Maelstrom, and published under the Community Content Agreement for the Dungeon Masters Guild."
							]
						},
						{
							"type": "entries",
							"name": "Contents",
							"entries": [
								"Introduction",
								"What are Legendary Hunts?",
								"Using This Supplement",
								"Harvesting Creature Parts",
								"Encounter Icons",
								"Chapter 1: The Deep Dweller",
								"Chapter 2: Umbrafang",
								"Chapter 3: The Abyss Maw",
								"Chapter 4: The Bathyal Beholder",
								"Chapter 5: Ophelia The Death Crab",
								"Chapter 6: The Sea Flayer",
								"Chapter 7: The Reef Swarm",
								"Chapter 8: The Endraleth",
								"Chapter 9: Coastal Critter Bestiary",
								"Coastal Creature Scale Chart"
							]
						},
						{
							"type": "entries",
							"name": "Introduction",
							"entries": [
								"There are many terrible fables told to sailors when at sea. Most are nothing but tall tales, fabricated by malicious captains to keep their motley crews in line. Those with a shred of truth once began believable, but have since became more fantastical with each retelling. Others, however, are very real. Tales of ancient titans who dwell beneath the crashing waves of the sea, and monstrous creatures of legendary repute that, to this day, still remain a deadly threat to all who brave the terrors of the briny deep."
							]
						},
						{
							"type": "entries",
							"name": "What Are Legendary Hunts?",
							"entries": [
								"Legendary hunts are short monster hunting adventures a Dungeon Master can use to populate their Dungeons & Dragons campaigns. Each hunt focuses on a particular creature of legend, from the mighty and colossal deep dweller, to the strange and twisted bathyal beholder. Many of these creatures may exist at the same time, and overcoming each one can grant rare and powerful items. The fanged teeth of the deep dweller, for example, can be harvested and transformed into fearsome weapons, while segments of the bathyal beholder's shell can be turned into armor with unique magical properties.",
								"Each legendary hunt has a number of stages characters must go through before encountering the creature itself. Some legendary creatures, for example, require the characters to sail to a particular location and speak a mysterious shanty in order to summon it. Others might only appear on certain days, or must be lured out with an item or body part from a particular creature. Once summoned, a legendary creature fights with a monstrous ferocity and intelligence that can challenge even the bravest of characters."
							]
						},
						{
							"type": "entries",
							"name": "Using This Supplement",
							"entries": [
								"Many of the legendary creatures in this book have been written as unique monsters. Some are balanced to be fought against by a ship and crew on the high seas, while others are designed for smaller adventuring parties of varying level. Each hunt is divided into its own chapter, presenting a full color image of the legendary creature, lore, tall tales, and particular habits it is said to have, before outlining the regional and local effects the appearance of such a creature brings with it. Each chapter ends with a short quest involving the monster, various plot hooks to introduce it to your D&D games, a harvest table, and items a player can craft from harvested parts.  This supplement also assumes you have access to, or basic knowledge of the Monster Manual, Player's Handbook, Dungeon Master's Guide, and Ghosts of Saltmarsh. Sometimes a quest in this book refers to one of the above supplements. These references are abbreviated as follows:",
								"Monster Manual: (MM)",
								"Player's Handbook: (PHB)",
								"Dungeon Master's Guide: (DMG)",
								"Ghosts of Saltmarsh: (GoS)",
								"If you see a creature's name in bold, that is an indication its stat block can be found in the Monster Manual, unless specified otherwise.  While these creatures have been designed as unique encounters for nautical and coastal adventures, this doesn't mean you can't tweak their origins or lore to fit in a different setting. The bathyal beholder, for example, could be changed to be the head of a cult located in a mysterious swamp, or inserted as a random encounter characters might come across in an ancient dungeon."
							]
						},
						{
							"type": "entries",
							"name": "Harvesting Creature Parts",
							"entries": [
								"Each legendary hunt in this supplement lists certain body parts that may be harvested from the creature therein, be them suckers, teeth, mandibles, blood, flesh or anything else as noted in their chapter. If the idea of harvesting pieces of dead monsters and turning them into useful items is appropriate for your campaign, the harvesting table in each chapter will tell you what body parts may be harvested, how difficult they are to craft, and the resulting item it can be turned into.",
								"Below is an example of the tables you can find in this supplement, as well as a breakdown of what each column means.",
								"{@b DM's Note}: Magical items harvested from these creatures are intended to be rewards in their own right. However, should you feel your players deserve more monetary rewards or other items, you are welcome to modify this to suit your campaign.",
								"{@b Table Guide}:",
								"{@b Body Part}: The part of the body that is being harvested, and how many pieces may be obtained from a successful harvest attempt.",
								"{@b Harvest DC}: This details the ability check and DC required to successfully harvest the chosen part and any storage requirements the part has. Each body part may only be successfully harvested once, unless specified otherwise, after which the body part is destroyed. If a creature fails the harvesting check by 5 or more, the body part is also destroyed, and can't be harvested again.",
								"If harvesting a body part requires two or more checks, the checks can be performed by any creatures involved in the harvesting.  A ranger, for example, might decide to join in on the harvesting by making the required Wisdom (Survival) check, leaving the Dexterity (Sleight of Hand) check to the rogue. Other characters can take the Help action to grant the harvesting characters advantage on the aforementioned checks.",
								"{@b Items Available to Craft}: This column lists the item or items that may be crafted from harvested creature parts. You can only produce one of the listed items with each crafting attempt. The crafted item's properties are detailed at the end of the chapter.",
								"{@b Item Crafting Requirements}: This section details any requirements that must be met to turn the harvested body part into an item. Harvested pieces that note a storage requirement (such as a vial or barrel of salt) must be placed in their respective containers immediately after being harvested, and should remain in the container until used in crafting. A harvested piece degrades over time when not placed in its particular container or being used for crafting. Each piece can remain outside of a container for a maximum of 1d4 hours (ignoring crafting times) before succumbing to rot. A rotten piece can't be crafted. If an item is listed under two or more tools, proficiency in and access to both sets of tools are required, though these proficiencies can be shared over multiple characters. For example, one character could take part in the crafting and have proficiency in one set of tools, and another character could also take part in the crafting and provide the proficiency needed for the other set of tools.",
								"{@b Crafting DC}: The ability check and DC that must be met to successfully craft an item, and the time required to do so. If this check is failed by 5 or more, the harvested pieces used are destroyed in the crafting process.",
								"If crafting an item requires two or more checks, the checks can be performed by any creatures taking part in the crafting of the item. A barbarian, for example, might decide to make the required Strength (Athletics) check, leaving the Intelligence (Arcana) check to the wizard. Other characters can take the Help action to grant the crafting characters advantage on the aforementioned checks.",
								"The table guide shown above has can also be found next to each chapter's harvest table for ease of reference when running these adventures."
							]
						},
						{
							"type": "entries",
							"name": "Encounter Icons",
							"entries": [
								"The stat blocks in this supplement use a collection of icons known as Encounter Icons. These icons are designed to offer advice to Dungeon Masters on the creature's behavior or see what kind of abilities it might have at a glance.",
								"Some icons might contradict each other, but this is intentional.  Icons are noted on a stat block in order of importance, with the most important icon on the left and the least important on the right. For example, a dragon would have lair lurker first, followed by the archer icon, then the rusher icon. For a dragon, remaining in its lair is far more important than staying at range breathing fire, and setting fire to its enemies is more important than rushing in with tooth and claw.",
								"The icons are purely an advisory tool. If you feel a creature would act a particular way that goes against its original design, then feel free to modify its behavior to suit your encounter.",
								"{@b Encounter Icon Descriptions}",
								"Each icon represents a particular set of tactics which are detailed below. The icons are in alphabetical order.",
								"{@b The Tank}: A creature with this icon often has a lot of hit points or a high AC (sometimes both) and is able to take a beating, but not necessarily inflict much in return. These creatures are usually intended to be used as frontline fighters against melee-heavy enemies or act as protectors for spellcasters. A tank's primary tactic is to soak up incoming attacks and focus on a single target at a time, shrugging off most damage while slowly whittling away its target's hit points.",
								"{@b The Ambusher}: A creature with this icon usually has lower than average hit points but a higher than average AC and deals increased damage, especially when surprising a target. An ambusher is intended to be used stealthily, waiting for the opportune moment to strike. An ambusher's primary tactic is to pick off one target at a time, starting with the weakest looking creature first. It uses hit and run tactics to confuse its opponents and retreats if cornered or close to defeat.",
								"{@b The Afflicted}: A creature with this icon primarily uses diseases or condition effects such as paralysis or poison to debilitate their targets. An afflicted is intended to be used aggressively, and spreads its attacks out between multiple targets first. The afflicted prioritizes attacking those who are immune to its debilitating ailments, or those who have the ability to cure them, ensuring they are dead before turning its attention to other targets.",
								"{@b The Rusher}: A creature with this icon focuses their attacks on a single creature at a time and continues until it is dead. The rusher is intended to be a challenging foe, and usually has either a few heavy hitting attacks, or many smaller attacks it can use to continually pressure its target. A rusher often attacks relentlessly and fights to the death.",
								"{@b The Defender}: A creature with this icon usually has a lot of resistances and condition immunities. A defender is intended to act as the opposite to the rusher, spreading out its attacks between nearby enemies and usually sharing an icon with the tank, spellcaster or ranger.",
								"The defender's primary tactic is to be cautious and careful when attacking, only moving in for the kill when it has a clear sign of victory and falling back or hunkering down if outnumbered.",
								"{@b The Caster}: A creature with this icon is capable of casting spells or generating magical effects. A caster is intended to be played based on its other icons, but is likely to recognise other creatures with the caster icon more easily. The caster's primary tactic is to eliminate rival casters as early as possible to establish magical dominance on the battlefield.",
								"{@b The Lair Lurker}: A creature with this icon has access to a lair. A lair lurker is intended to be played based on the combination of other icons on its stat block. The lair lurker's primary tactic is to use minions or lair actions to debilitate its enemies, and given the choice, fights from within its lair.",
								"{@b The Lone Wolf}: A creature with this icon prefers to fight alone, and doesn't work well with other groups of creatures. The lone wolf is intended to be used as a boss monster, assassin, or other solitary creature. It's primary tactic depends on the other icons present on its stat block.",
								"{@b The Pack Hunter}: A creature with this icon prefers to fight in groups to surround and overwhelm its foes with coordinated attacks.  The larger the group, the more aggressive the attack. A pack hunter will usually have lower hit points or AC than other monsters to counter balance the intended numbers implied in their use. It is unusual to encounter one of these individually, though it might happen if they face weaker foes.",
								"{@b The Underling}: A creature with this icon normally has extremely low hit points, AC and damage output, and act as minions in a hierarchy. An underling is intended to be used as a buffer to protect more valuable targets, or serve as chaff characters can fight their way through with little difficulty. An underling's primary tactic is dictated by other icons on its stat block.",
								"{@b The Archer}: A creature with this icon might excel at long range combat or have high mobility and rely on hit-and-run tactics; they avoid lingering in melee range if they can avoid it. The archer is intended to be used at mid to long range, where it can pick off its foes with relative impunity. Its primary tactic is usually to avoid melee creatures and focus on ranged enemies first, making good use of cover.",
								"{@b Creature Rarity}",
								"The icons in this supplement sometimes show in different colors.",
								"These colors dictate how rare a creature is intended to be in the world. Conventionally, the rarer a creature is, the more powerful it is, and the more abilities it has at its disposal:",
								"{@b Black}: The creature is commonly found in the world and can be seen regularly in its natural habitat. It is nothing overly extraordinary, though some creatures may still be considered exotic by passing travellers.",
								"{@b Blue}: The creature is uncommon and might have unique features. Such a creature is much more difficult to locate in the wild and might require help from a hunter or tracker, or only live in very particular environments.",
								"{@b Red}: The creature is rarely seen, and often has more than one special feature or legendary actions.  It might use a lair. These creatures are not easy to find, even by skilled trackers, usually requiring magical assistance.",
								"{@b Orange}: The creature is regarded as a myth or legend, only ever spoken of in long forgotten stories and tall tales. The creature is often unique, either in name, existence or some other method and might have many special features and legendary actions. It is likely to use a lair.",
								"{@b Example Stat Block}",
								"An example of how these encounter icons are used is shown in the driftwood mimic stat block opposite. The driftwood mimic isn't often seen but can be found in the wild, so it's encounter icons are displayed in blue. Its primary tactic is to ambush its victims, so it features the ambusher icon first.  Additionally, a driftwood mimic usually hunts alone, lacking both the intelligence and desire to work alongside other creatures; thus, it has the lone wolf icon.",
								"{@b Ready The Cannons!}",
								"Encounter icons added to ship stat blocks act as an advisory for NPC crew and captains. If players are in charge of the ship, the encounter icons can be ignored in favour of their decisions.",
								"Additionally, several ships in this book use gunpowder cannons. If your setting doesn't include gunpowder, these cannons can instead be magical creations, powered by arcane runes or mystical enchantments, or you can simply replace them for ballista."
							]
						},
						{
							"type": "entries",
							"name": "Chapter 1: The Deep Dweller",
							"entries": [
								{
									"type": "image",
									"href": {
										"type": "external",
										"url": ""
									}
								},
								"It is said that the fearsome kraken rules the sea, a far more deadly and horrific entity rules in the perpetual, abyssal darkness below. Known to many as the deep dweller, this vast, colossal creature lurks within the bowels of the material plane, using huge submerged Underdark tunnels to traverse the world.",
								"Illithids once attempted to capture the titan and dominate its predatory mind with psychic strikes. Their psychic strikes augmented the deep dweller, granting it the horrifying capability to consume thoughts and memories as easily as it consumes the flesh of anything it encounters."
							]
						},
						{
							"type": "entries",
							"name": "A Timeless Beast, Ever Hungry",
							"entries": [
								"The deep dweller resides in the lowest regions of the world, surfacing once every 200 years in search of its rival of the seas, the monstrous kraken. Rarely do the two creatures ever meet, but this predatory migration causes catastrophic effects for any who dwell in its path whenever the deep dweller appears. Cyclones tear across the sea for miles in every direction, while cities and port towns become assailed with sudden flash floods and battered by vast lightning storms.  A foreboding silence precedes the arrival of the deep dweller. Fish and other marine life scatter as its grasping tendrils pry and creep towards the waters surface, while seawater becomes coated in a magical, inky blackness. Fishing galleons are dragged into the dark depths as the deep dwellers grasping tendrils rip vast holes in their hulls. When it attacks, everything nearby is drawn towards its maw in a sudden torrent of undersea currents.",
								"Coastal city walls are crushed under the deep dwellers massive bulk as it surfaces to prey on moored fishing trawlers, tearing apart ocean trading towns and silencing entire populations with sanity-consuming psychic screams.",
								"{@b Motivations}",
								"The deep dweller is a creature born of pure evil and malice, and seeks only to consume and destroy. It fears nothing, and only retreats from combat if all its tentacles have been severed, or its eyes have been punctured. The deep dweller is fiercely territorial, and it believes its territory to be the entire ocean, with its only competitor being the kraken. It knows the location of every water borne gargantuan creature or entity within a five-mile radius, and pursues each of them relentlessly.",
								"Should the deep dweller ever face a kraken and emerge victorious, it drags the corpse down into the depths of the ocean, and doesn't return to the surface again for 500 years.",
								"{@b Adults and Juveniles}",
								"Only one deep dweller is thought to exist at a time, and its growth takes hundreds of years. A juvenile deep dweller, while not as strong as its adult counterpart, is still more than a match for a conventional sailing ship or party of unprepared adventurers. Juvenile deep dwellers follow a similar hunting pattern to their adult counterparts, and still exhibit many similar features, including any lair and regional effects its adult version is capable of creating. The items a character can craft from a deep dweller varies depending on its current age.",
								"{@b A Deep Dweller's Lair}",
								"The deep dweller resides in the darkest depths of the ocean, where light can't reach. When it surfaces, it brings a magical darkness with it, which serves as a mobile lair. This moving lair is beneath the waves, but generates a powerful lightning storm wherever it resides, which covers the surface of the water above the lair itself. Magical darkness fills the area of the lair underneath the water, and movement within it is considered difficult terrain for any creature that doesn't have a swimming speed.",
								"Creatures and ships caught in the storm above the lair have their maximum speed reduced by 10 feet, and visibility is reduced to a maximum of 120 feet regardless of vision, due to the lashing rain and natural darkness of the storm clouds. The storm can't be dispelled while the lair exists.",
								"The lair covers a 500-foot radius, centered on the deep dweller.",
								"Whenever the deep dweller moves, the lair also moves with it.  When the deep dweller is defeated or vanishes, the lair also vanishes, and the lightning storm dissipates in 1d4 hours.",
								"The deep dweller surfaces once every 200 years. It remains surfaced for 7 days. At the end of the 7th day it dives back down into the depths of the ocean and falls into a deep slumber, which lasts for 175 years.",
								"{@b Lair Actions}",
								"On initiative count 20 (losing initiative ties), the deep dweller takes a lair action to cause one of the following magical effects:",
								"A sudden surge of water pulses out from the centre of the deep dweller's lair. Each creature or ship in the waters within 120 feet of the deep dweller must succeed on a DC 23 Strength saving throw or be pushed up to 60 feet away from it. Ships that fail this saving throw are also turned to face a random direction, as per the table below. On a successful save, creatures and ships are pushed 10 feet away from the deep dweller instead, and ships retain their current facing.",
								"Lightning bolts strike down from the surrounding storm. The lightning bolts strike up to 3 targets within the storm that aren't completely submerged underwater. Each target must make a DC 23 Dexterity saving throw. A target takes 10 (3d6) lightning damage on a failed save, or half as much on a successful one.",
								"Strong winds rush across the top of the lair, bringing with it a sudden magical darkness. Vision within the storm is reduced to 30 feet until initiative count 20 on the next round.",
								{
									"type": "table",
									"caption": "Ship Direction Table",
									"colLabels": [
										"D8",
										"Result"
									],
									"colStyles": [
										"col-2 text-center",
										"col-4 text-left"
									],
									"rows": [
										[
											"1",
											"North"
										],
										[
											"2",
											"North-East"
										],
										[
											"3",
											"East"
										],
										[
											"4",
											"South-East"
										],
										[
											"5",
											"South"
										],
										[
											"6",
											"South-West"
										],
										[
											"7",
											"West"
										],
										[
											"8",
											"North-West"
										]
									]
								},
								"{@b Regional Effects}",
								"The region surrounding a deep dweller's lair is warped by the creature's monstrous presence, creating the following magical effects:",
								"The deep dweller knows the location of every gargantuan or larger water borne entity within 5 miles of it.",
								"Aquatic beasts within 6 miles of the lair flee, leaving the area devoid of sea life, such as breaching whales, or pods of dolphins.",
								"The deep dweller can alter the weather at will in a 5 - mile radius centred on its lair. The effect is identical to the control weather spell, but it can't create calming or mild weather effects, such as clear skies, or light rain.",
								"When the deep dweller dies or retreats at the end of its 7 day period, all of these regional effects fade immediately."
							]
						},
						{
							"type": "entries",
							"name": "Size Comparison Chart",
							"entries": [
								"Below is a visual guide to give the Dungeon Master an idea of the size of an adult deep dweller, in comparison to a traditional sailing ship (30 crew), shark, and human of average height.",
								{
									"type": "image",
									"href": {
										"type": "external",
										"url": ""
									}
								}
							]
						},
						{
							"type": "entries",
							"name": "Summoning the Deep Dweller",
							"entries": [
								"The deep dweller can be awoken from its slumber beneath the waves by speaking aloud a magical sea shanty, while on board a ship sailing through a storm at night. The shanty must be spoken or sung aloud by a character with Spellcasting, Ritual Casting, or Pact Magic features.",
								"If the shanty is spoken successfully, all sources of light (magical or otherwise) are magically doused. If all lights remain doused in this manner for 10 minutes, the summoning is complete and the deep dweller awakens. The deep dweller appears within 1 mile of the creature that summoned it, and is hostile to all creatures.",
								"{@b The Deep Dweller Sea Shanty}",
								"This shanty can be sung or spoken, and is most commonly known by elf sailors. It is often seen as a bad omen to come across a ship singing this during the night, and the shanty is known to strike fear and terror in kraken priests and sahuagin, making it a useful tool for adventurers combating such foes. The shanty is as follows:",
								"\"In the night on sails of old",
								"Atop the winds of water cold",
								"Deep within the dark abyss",
								"Lies a beast asleep in bliss",
								"When storms abound and lightning calls",
								"The sea she boils and darkness falls",
								"It wakes, it roars, writhes and creeps",
								"While rising from the briny deep",
								"Woe betide all creatures be,",
								"Hear them scream, watch them flee!",
								"The great consumer, the eater of worlds",
								"It searches, it grasps, maw unfurled",
								"For those who dare to sail on seas",
								"Ruled by a beast, that we name thee",
								"The Dweller of the Deep!\"",
								"[Deep Dweller (Adult)]",
								"[Deep Dweller (Juvenile)]"
							]
						},
						{
							"type": "entries",
							"name": "Harvesting Deep Dweller Parts",
							"entries": [
								{
									"type": "table",
									"caption": "Harvesting Table",
									"colLabels": [
										"Body Part",
										"Harvest DC",
										"Items Available to Craft",
										"Item Crafting Requirements",
										"Crafting DC and Time Taken"
									],
									"colStyles": [
										"col-2 text-left",
										"col-2 text-left",
										"col-2 text-left",
										"col-2 text-left",
										"col-4 text-left"
									],
									"rows": [
										[
											"Dweller Tentacle (Flesh) (3d10 pieces)",
											"DC 15 Wisdom (Survival) Salted storage barrel (Max of 8 pieces per barrel)",
											"Deep Dweller Leather (4 pieces required) Deep Dweller Shield (2 pieces required) Dweller Skin Coating (10 pieces required)",
											"Leatherworker's tools: All items Tinker's tools: Dweller Skin Coating",
											"Deep Dweller Leather: DC 15 Strength (Athletics) 4 Hours Deep Dweller Shield: DC 14 Strength (Athletics) 3 Hours Dweller Skin Coating: DC 14 Strength (Athletics) DC 15 Intelligence (Tinker) 24 hours, over 3 days."
										],
										[
											"Dweller Tentacle (Suckers) (2d10 pieces)",
											"DC 16 Wisdom (Survival) Storage container, filled with fresh seawater (Max of 8 pieces per container)",
											"Grasping Fluid (3 pieces required) Medicinal Tape (5 pieces required)",
											"Alchemist's Supplies: Grasping Fluid Herbalism Kit: Medicinal Tape",
											"Grasping Fluid: DC 15 Intelligence (Arcana) 8 Hours Medicinal Tape: DC 15 Wisdom (Medicine) 6 Hours"
										],
										[
											"Dweller Tentacle (Spines) (5d10 pieces)",
											"DC 15 Wisdom (Survival)",
											"Deep Blade (3 pieces required) Dweller Axe (5 pieces required) Dweller Arrowheads (set of 20) (10 pieces required)",
											"Smith's Tools: All items",
											"Deep Blade: DC 15 Strength (Athletics) 4 Hours Dweller Axe: DC 15 Strength (Athletics) 4 Hours Dweller Arrowheads (set of 20): DC 14 Dexterity (Sleight of Hand) 5 Hours"
										],
										[
											"Dweller Fang (1d12 fragments)",
											"DC 16 Dexterity (Sleight of Hand)",
											"Deep Fang Daggers (2 fragments required) Notched Dweller Whip (3 fragments required)",
											"Smith's Tools: All items Leatherworker's Tools: Notched Dweller Whip",
											"Deep Fang Daggers: DC 15 Dexterity (Sleight of Hand) 3 Hours Notched Dweller Whip: DC 15 Dexterity (Sleight of Hand) 3 Hours"
										],
										[
											"Dweller Blood (1d10 samples)",
											"DC 15 Intelligence (Arcana) and Wisdom (Survival) Empty Glass Vials (1 vial per sample of blood taken)",
											"Deepblood Poison (1 vial required) Mindspike Potion (2 vials required)",
											"Poisoner's Kit: Deepblood Poison Alchemist's Supplies: Mindspike Potion",
											"Deepblood Poison: DC 16 Intelligence (Arcana) 6 Hours per vial Mindspike Potion: DC 16 Intelligence (Arcana) 6 Hours per vial"
										]
									]
								},
								"The deep dweller is not a creature that is easy to kill. If reduced to 0 hit points or otherwise defeating at sea, it retreats back into the depths of the ocean and falls into a deep slumber. Assuming a band of resourceful characters haven't found a way to beach, corner, or otherwise successfully kill the deep dweller outright and it escapes to the depths below, all is not lost! Players can still harvest parts from severed limbs and broken fangs removed during the battle.  The deep dweller has a number of vast tentacles it uses to rip and tear at a ship's hull. Each of these tentacles features a series of razorsharp teeth surrounded by suckers, which can be severed and harvested to transform into fearsome weapons and items. In addition, the deep dweller's large maw sports a vast array of fangs, which can be damaged and removed, should an adventurer feel lucky enough to do so.",
								"The deep dweller's stat block details how much damage each tentacle can take before it is severed, or how to break one of its fangs.",
								"{@b Table Guide}:",
								"{@b Body Part}: The part of the body that is being harvested, and how many pieces may be obtained from a successful harvest attempt.",
								"{@b Harvest DC}: This details the ability check and DC required to successfully harvest the chosen part and any storage requirements the part has. Each body part may only be successfully harvested once, unless specified otherwise, after which the body part is destroyed. If a creature fails the harvesting check by 5 or more, the body part is also destroyed, and can't be harvested again.",
								"If harvesting a body part requires two or more checks, the checks can be performed by any creatures involved in the harvesting.",
								"A ranger, for example, might decide to join in on the harvesting by making the required Wisdom (Survival) check, leaving the Dexterity (Sleight of Hand) check to the rogue. Other characters can take the Help action to grant the harvesting characters advantage on the aforementioned checks.",
								"{@b Items Available to Craft}: This column lists the item or items that may be crafted from harvested creature parts. You can only produce one of the listed items with each crafting attempt. The crafted item's properties are detailed at the end of the chapter.",
								"{@b Item Crafting Requirements}: This section details any requirements that must be met to turn the harvested body part into an item. Harvested pieces that note a storage requirement (such as a vial or barrel of salt) must be placed in their respective containers immediately after being harvested, and should remain in the container until used in crafting. A harvested piece degrades over time when not placed in its particular container or being used for crafting. Each piece can remain outside of a container for a maximum of 1d4 hours (ignoring crafting times) before succumbing to rot. A rotten piece can't be crafted. If an item is listed under two or more tools, proficiency in and access to both sets of tools are required, though these proficiencies can be shared over multiple characters. For example, one character could take part in the crafting and have proficiency in one set of tools, and another character could also take part in the crafting and provide the proficiency needed for the other set of tools.",
								"{@b Crafting DC}: The ability check and DC that must be met to successfully craft an item, and the time required to do so. If this check is failed by 5 or more, the harvested pieces used are destroyed in the crafting process.",
								"If crafting an item requires two or more checks, the checks can be performed by any creatures taking part in the crafting of the item. A barbarian, for example, might decide to make the required Strength (Athletics) check, leaving the Intelligence (Arcana) check to the wizard. Other characters can take the Help action to grant the crafting characters advantage on the aforementioned checks."
							]
						},
						{
							"type": "entries",
							"name": "Crafted Items",
							"entries": [
								"The crafted items listed below are in alphabetical order. Some items on this list can only be crafted using materials harvested from either the adult or juvenile deep dwellers respectively. The items properties change depending on which version of the creature it is crafted from, with the juvenile properties displayed by default and the upgraded adult properties displayed atop the description. Each item lists the school of magic it radiates, should it be the target of detect magic or similar spells. These changes are detailed in the item's entry.",
								"[Deep Blade]",
								"[Deep Dweller Leather]",
								"[Deep Dweller Shield]",
								"[Deep Fang Daggers]",
								"[Deepblood Poison]",
								"[Dweller Arrowhead]",
								"[Dweller Axe]",
								"[Dweller Skin Coating]",
								"[Grasping Fluid]",
								"[Medicinal Tape]",
								"[Mindspike Potion]",
								"[Notched Dweller Whip]",
								"Selling Harvested Materials",
								"Materials harvested from the deep dweller can be sold to interested third parties, such as collectors, arcane scholars and nobility. Items can also be sold to criminal black-market dealers at an increased price, should the character have a criminal contact or background. The Harvest Value table details average sale guidelines for a piece of each material type.",
								"Costs may fluctuate based on your campaign's economy, sale location, or per trader, at the discretion of the Dungeon Master.",
								{
									"type": "table",
									"caption": "Harvest Value Table",
									"colLabels": [
										"Material Name",
										"Sale Price",
										"Black Market Price"
									],
									"colStyles": [
										"col-3 text-center",
										"col-2 text-center",
										"col-2 text-center"
									],
									"rows": [
										[
											"Dweller Tentacle (Flesh)",
											"400 gp (Adult) 300 gp (Juvenile)",
											"650 gp (Adult) 500 gp (Juvenile)"
										],
										[
											"Dweller Tentacle (Spines)",
											"250 gp (Adult) 150 gp (Juvenile)",
											"300 gp (Adult) 200 gp (Juvenile)"
										],
										[
											"Dweller Tentacle (Suckers)",
											"300 gp (Adult) 175 gp (Juvenile)",
											"450 gp (Adult) 300 gp (Juvenile)"
										],
										[
											"Dweller Fang",
											"200 gp (Adult) 100 gp (Juvenile)",
											"350 gp (Adult) 200 gp (Juvenile)"
										],
										[
											"Dweller Blood",
											"500 gp (Adult) 375 gp (Juvenile)",
											"800 gp (Adult) 600 gp (Juvenile)"
										]
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "The Devil of the Deep",
							"entries": [
								"{@b Recommended Character Level}: 11 - 13 (Adult) 5 - 6 (Juvenile)",
								"{@b Minimum Equipment Required}: A sailing ship (GoS, Appendix A: Of Ships and the Sea) with a crew of at least 30 sailors and a hull with at least 300 hit points. At least one magical weapon, and 4 Potions of Healing.",
								"{@b Recommended Equipment Required}: A warship (GoS, Appendix A: Of Ships and the Sea), with at least 30 crew, and a hull with at least 400 hit points. At least 3 magical weapons, and a spellcaster with access to healing magic.",
								"{@b Party Size}: 4 - 6",
								"{@b Difficulty}: Deadly (4), Deadly/Hard (6)",
								"{@b Quest Creature}: Deep Dweller",
								"{@b Quest overview}",
								"Captain Tr'alik, owner of the infamous sailing ship The Rising Tide, is looking for crew members to join him on a hunt for the elusive and dangerous deep dweller. Having faced the beast before and lived to tell the tale, Tr'alik is fueled by revenge and hatred. If the beast is awoken, but not defeated, it could easily spell doom for many coastal towns and cities, including Saltmarsh itself.",
								"{@b Important Quest Notes}",
								"This quest provides a basic layout and stat block for The Rising Tide, and assumes it is crewed by 20 NPC sailors, including Captain Tr'alik. Feel free to modify this quest to suit your needs, but be aware the NPCs and ship provided all meet the bare minimum requirements. NPC stat blocks for this quest are located in the Monster Manual."
							]
						},
						{
							"type": "entries",
							"name": "Stage 1: Meeting the NPCs",
							"entries": [
								"Upon hearing of the recruitment availability, the characters are introduced to Captain Tr'alik at the Saltmarsh docks. Tr'alik is an aging high elf, covered in battle scars and speaks in a gruff, broken common. He appears to twitch at random intervals, and often snaps aggressively at crew mates only he can see. A DC 15 Wisdom (Medicine) check reveals he is partially insane, and while stable enough to captain a vessel, could be prone to making rash decisions. A DC 16 Intelligence (Arcana) check reveals magical scars across the back of his head, evidence of severe psychic trauma explaining his mental state.",
								"Tr'alik reveals to the characters that he has dreamt of the beast for many years, but recently his dreams have become more nightmarish, leading him to believe his monstrous nemesis is returning from its generations-long slumber. He seeks to awaken the deep dweller with an ancient sea shanty; taking his revenge and driving it back to the depths of the ocean before the beast begins preying on trading vessels and coastal regions.",
								"He claims the deep dweller's tentacles are extremely valuable, and should the characters help him take revenge on the creature, any materials they harvest from it are theirs to keep."
							]
						},
						{
							"type": "entries",
							"name": "Stage 2: Exploration",
							"entries": [
								"When the characters set sail, the deep dweller is not yet awake.",
								"Captain Tr'alik orders the crew to set sail to a particular area of the ocean he remembers facing the deep dweller at before. This journey takes three days. During that time, the characters can help the running of the ship and question members of the crew and the captain himself on tales, legends and first hand experiences of the deep dweller by making various ability checks.",
								"{@b Assisting the Crew}",
								"Below is a list of ability checks characters can make to help maintain The Rising Tide as she sails on the high seas. The party can perform up to three different ability checks per day. Each check takes 1d4 hours to complete.",
								"A successful check increases The Rising Tide's condition by 1 point, to a maximum of +5. A failed check decreases its condition by 1 point, to a maximum of -5. Consult the condition table, detailed in stage 3 of this quest, to find out how the ship's final condition affects the deep dweller encounter.",
								"{@b Check the Sails} ({@b DC 15 Strength (Athletics) check}). A character helps ensure the rigging is aligned and undamaged, making repairs where they are needed to help The Rising Tide catch the wind effectively.",
								"{@b Repair The Hull} ({@b DC 15 Strength (Athletics) check}). The character helps make repairs to the hull, replacing rotting wood and ensuring the ship doesn't spring leaks during the voyage. This check automatically succeeds if the character has access to the mending cantrip.",
								"{@b Swab The Deck} ({@b DC 15 Strength (Athletics) check}). The character swabs the deck to keep it clear of hazards, such as seaweed or algae build up, and re-applies a new coat of paint to protect the wood from exposure to the elements.",
								"{@b Clear Barnacles} ({@b DC 15 Constitution check)}. The character is lowered into the water to chip barnacles from the ship's keel.",
								"{@b Prepare Food} ({@b DC 15 Wisdom (Survival) check}). The character helps the cook prepare food on board for the crew. This includes jobs such as catching fish, cleaning the kitchen, chopping vegetables and rationing out water supplies.",
								"{@b Researching The Deep Dweller}",
								"During the exploration stage, characters can also choose to gather information pertaining to the deep dweller. This information can be collected by reading through research notes stored on the ship, or listening to tall tales from sailors and the mad ramblings of Captain Tr'alik himself.",
								"A character not assisting the crew can instead choose to gather information on the deep dweller to better prepare their party for the upcoming encounter by making one of the ability checks detailed below. A character can attempt each check once over the course of this quest. If a check is failed, a false piece of information about the legendary creature is gathered instead.",
								"{@b Ask Crew About Stories} ({@b DC 15 Charisma (Persuasion) check}). The character spends time with various crew members to compare stories they've heard about the deep dweller:",
								"(Failure) \"I heard that it's got tentacles a mile long, and it can suck the face right off your head!\"",
								"(Success) \"I've heard that it can get into your head with magic, and if it grabs you, it'll eat your brains without needin' to bother breakin' your skull.\"",
								"{@b Ask Crew About Rumours} ({@b DC 15 Charisma (Persuasion) check}). The character asks crew members about any rumours they heard of the area they are heading to.",
								"(Failure) \"I ain't hear nothin' of note really. Sea's the sea.\" (Success) \"I heard last time the Captain was here was 200 years ago, and when he was, there wasn't a fish around for miles. It was like they'd all run off. It was right stormy too.\"",
								"{@b Question The Captain} ({@b DC 15 Charisma (Persuasion) check}). The character questions Captain Tr'alik on his previous encounter with the deep dweller.",
								"(Failure) [Eyes Wide and Crazed] \"That beast'll get what's coming to it! I saw it tear my ship to pieces in the blink of an eye, and I only got one good shot at it with me cannon. Held onto a raft for three days before I was found! Mark my words, this time it'll be different!\"",
								"(Success) [Solemn and Serious] \"T'was a stormy night when the beast did rise from the depths. It grabbed my first mate, and stole the mind from her body. I still hear her screams at night. That thing's not natural, I'll tell you that. It's got some magic about it. When it arrives, the waters turn black, and a storm the likes of which you've never seen'll assail us before the beast does.\"",
								"{@b Compare Research Notes} ({@b DC 15 Intelligence (Investigation) check}).",
								"The character spends a few hours reading research papers on board the ship, checking navigation records, and comparing interesting events to learn more about the deep dweller's movements.",
								"(Failure) Little of these notes makes sense. Likely exaggerated reports from drunken sailors.",
								"(Success) The creature seems to hunt large ships, and sinks them by tearing at the underside of their hulls. It uses its tentacles to hold larger prey in place before biting into it with a large fanged maw. Severing the tentacles seems to be the most reliable way to defeat it.",
								"{@b Observe Wildlife} ({@b DC 15 Intelligence (Nature) check}. The character spends time recording the actions of nearby wildlife and theorises how a large predator might interact with them.",
								"(Failure) It's likely this creature is a simple-minded beast, and any stories are simple exaggerations of tall tales.",
								"(Success) This creature is extremely intelligent, and if it preys on ships in similar size to The Rising Tide, it is likely of gargantuan proportions. Anything of that size is unlikely to succumb to paralysis and prove difficult, if not impossible, to restrain.",
								"By the second day, a large portion of the sea life in the area vanishes. This is noticeable to any character who spends any length of time observing the wildlife. On the third day, the ship arrives at Captain Tr'alik's co-ordinates, and the sea appears to be eerily calm. Tr'alik waits until nightfall before presenting the ancient sea shanty to the characters, and requesting one of them with magical proficiency read it aloud to rouse the deep dweller from the ocean depths.",
								"If no character has magical proficiency, assume instead the deep dweller has awoken of its own accord, and continue to stage 3 of this quest."
							]
						},
						{
							"type": "entries",
							"name": "Stage 3: The Hunt",
							"entries": [
								"This stage of the quest begins with The Rising Tide suddenly being assailed by a ferocious storm. A DC 17 Intelligence (Arcana) check reveals this storm to be magical in nature, and not a natural occurrence. The storm continues to rage throughout the encounter, and only subsides once the deep dweller is defeated.",
								"If The Rising Tide is sunk and the characters are defeated or choose to flee, the deep dweller continues attacking any remaining crew for 1d4 rounds before swimming away, taking the storm with it. The condition The Rising Tide is in affects the difficulty of this encounter, as detailed on the Condition Table.",
								{
									"type": "table",
									"caption": "Condition Table",
									"colLabels": [
										"Ship Condition Points",
										"Details"
									],
									"colStyles": [
										"col-3 text-center",
										"col-5 text-center"
									],
									"rows": [
										[
											"+4 to +5" ,
											"The ship and crew (including characters) gain a +1 bonus to all ability checks, attacks, and damage rolls while aboard, and advantage on Dexterity saving throws."
										],
										[
											"+2 to +3",
											"The ship gains a +1 bonus to all ability checks, attacks, and damage rolls."
										],
										[
											"+1 to -1",
											"No effects"
										],
										[
											"-2 to -3",
											"The ship suffers a -1 penalty to all ability checks and attack rolls."
										],
										[
											"-4 to -5",
											"The ship and crew (including characters) suffer a -1 penalty to all ability checks and attack rolls while on board."
										]
									]
								},
								"{@b Deep Dweller Tactics}",
								"The deep dweller begins the encounter hidden beneath the waves as magical darkness spreads beneath the ship.",
								"Characters can hear the howls of the deep dweller by making a {@b DC 15 Wisdom (Perception) check}, revealing its position on a success. If no character notices the deep dweller, it has advantage on its initiative check at the start of the combat.",
								"The deep dweller targets the ship's underbelly first, making tentacle attacks and attempting to grapple it while remaining underwater to mitigate damage from the crew on board. As long as the deep dweller has taken less than 100 damage, it continues to focus its attention on the ship. When it has the ship grappled, it tries to bite its prey. If the bite hits, the deep dweller breaks one of its fangs off, which remains trapped in the ship's hull. Thereafter, the deep dweller only uses its Tentacle attacks and Constrict feature against the ship.",
								"Once it has taken enough damage, it shifts its attention from the ship to the crew. The deep dweller prioritizes its attacks against creatures in the water or in the air. If none are in the water or air, it attacks those on deck at random. Save the captain and the characters, assume any attack which hits a crew member does enough damage to drop them in one hit. Once more than half the crew has been killed in this manner, the deep dweller shifts its focus exclusively to the characters and the ship, which it continues to attack with at least one tentacle each turn.",
								"If the deep dweller is reduced to half its hit points or fewer, it prioritizes using its Psychic Drain as often as it is able.",
								"Characters can attempt to determine the health (or combat ability) of the deep dweller by making a DC 20 Wisdom (Insight) check. On a success, the character knows the deep dweller is one of the following:",
								"198 - 396 hit points/6+ tentacles: Combat Capable",
								"197 - 99 hit points/3 - 5 tentacles: Slightly Weakened",
								"98 or less hit points/2 or less tentacles: Weak and Struggling",
								"If defeated, the deep dweller flees into the depths of the ocean, and doesn't return. Any swallowed creatures that are still alive are vomited out along with a large trail of black, bloody ichor as the deep dweller flees.",
								"Any tentacles severed during the combat remain floating atop the water or on The Rising Tide's deck or interior, depending on how and where they were severed."
							]
						},
						{
							"type": "entries",
							"name": "Stage 4: Completion",
							"entries": [
								"Upon defeating the deep dweller, the remaining crew celebrate their victory and begin helping the characters repair the ship and harvest any severed body parts. The crew sails back to Saltmarsh as heroes, and the characters are awarded all harvested material to do with as they wish.",
								"If Captain Tr'alik survived the encounter with the deep dweller, he offers to transport the characters to whatever port they would like, and presents them with free room and board in a tavern of their choosing for 2d6 days once they arrive, as a final display of his gratitude.",
								"If the characters are defeated, the deep dweller swims away in search of more ships to attack. It arrives and attacks the port of Saltmarsh in 5 days, before vanishing into the sea and falling into a deep slumber for another 175 years. The last view the characters see of the deep dweller before it leaves is the storm moving in the direction of Saltmarsh. Whether or not the characters can arrive in time to stop the deep dweller from destroying Saltmarsh, however, is entirely down to you as Dungeon Master."
							]
						},
						{
							"type": "entries",
							"name": "Notable NPCs and Other Stat Blocks",
							"entries": [
								"{@b Name}: Captain Tr'alik",
								"{@b Race}: High Elf (He/Him)",
								"{@b Alignment}: Chaotic neutral",
								"{@b Occupation}: Captain of The Rising Tide",
								"{@b Stat Block}: Pirate (GoS, Appendix C: Monsters and NPCs) or Bandit Captain",
								"{@b Personality Trait}: Stubborn, determined, haunted by memories of the crew he lost, light sleeper, enjoys singing.",
								"Other Stat Blocks In This Quest",
								"A basic map and stat block for The Rising Tide is can be found at the end of this chapter."
							]
						},
						{
							"type": "entries",
							"name": "Other Plot Hooks",
							"entries": [
								"Here are a few examples of other plot hooks and bounties you can use to introduce the existence of the deep dweller to your Dungeons & Dragons campaign:",
								"Merchant vessels off the nearby coast have been vanishing for the past few days. The local guard suspects piracy, while many other sailors are blaming the terrible weather.",
								"However, Tila Dimlit, the town's divination wizard, has foreseen a much more terrifying culprit, blaming the mysterious disappearances on a growing darkness which she claims is spreading across the sea at an increasingly rapid pace.",
								"Those wishing to investigate these claims further should speak with Captain Ilimir of the Purple Rose as soon as possible.",
								"Old Spot, the elderly fisherman that frequents the local taverns, keeps rambling on about hearing a cry for help when he's out on his boat. The local guards have gone to check, but returned empty handed, claiming the old man was just going senile. That was a few days ago, and I've not seen Spot since.",
								"Anyone willing to look into his disappearance can find me near the Old Mare on Sleeper's Street.",
								"Ask for Jasper.",
								"A young fisherman, down on his luck and drowning his sorrows in cheap ale, staggers over, slamming a hand down on the wooden table in front of you. He holds in his other hand a crumpled piece of parchment he claims he found adrift in a bottle at sea.",
								"Looking the faded writing over, you make out what appears to be the words to an old sea shanty. The young man grins, placing his palm face up towards your face.",
								"\"Worth a few coin?\" He asks, drunkenly."
							]
						},
						{
							"type": "entries",
							"name": "Chapter 2: Umbrafang",
							"entries": [
								{
									"type": "image",
									"href": {
										"type": "external",
										"url": ""
									}
								},
								"Umbrafang lurks in swamps and stagnant pools, preying on any creatures unfortunate enough to cross its path. Umbrafang is an incarnation created by the mysterious kuo-toa; fishlike humanoids that once inhabited the shores and islands of the surface world."
							]
						},
						{
							"type": "entries",
							"name": "Grim Tales and Strange Stories",
							"entries": [
								"Umbrafang began as an old wives' tale, a story told to children to keep them away from stagnant water and dangerous swamps. The story told of a fearsome beast which lurked at the water's edge, using its jellyfish-like appendages to lure in unsuspecting children before dragging them under the water, where they were never seen again.",
								"While a grim story, the tales of Umbrafang were simply that, until word of the creature's existence reached the ears of the insane and obsessive kuo-toa. Constantly under attack by villagers and fishermen, the kuo-toa adopted this story into their culture, believing the mysterious creature to bring them protection and safety from those that would do them harm.",
								"Enamoured with the idea of a monstrous protector, the kuo-toa began creating a statue in the creature's likeness; using seaweed for the beast's tentacles, and the remains of a jellyfish for the body. It wasn't long before their religious fervor took hold, transforming their newest creation from a rotting statue into a terrifying underwater predator.",
								"{@b Swamp Lurker and Man-Eater}",
								"Umbrafang's diet is broad, encompassing anything small enough to be drowned or attacked; humanoid or otherwise. While the kuo-toa once provided it sustenance through their devout worship, since their disappearance Umbrafang has been left unchecked in the regions surrounding Saltmarsh. Using its innate ability to teleport between bodies of stagnant water, the creature has proven time and again to be a dangerous hunter, capable of striking unseen from even the smallest puddle.",
								"Umbrafang won't ordinarily seek out humanoids to consume, but when the surrounding rural area runs dry from excessive fishing or hunting, it turns its attention to more civilized areas. It quickly finds its way into squalid sewer systems or striking from buckets of motionless water.",
								"{@b Motivations}",
								"Umbrafang is a creature born of pure chaos, and seeks only to feed its insatiable hunger by any means necessary. A dog, deer, bear, commoner and shark are all possible targets for consumption in the eyes of Umbrafang. If a creature steps too close to its lair, Umbrafang lunges towards it, choking it into unconsciousness before dragging the limp body through the water and into its pocket plane to feed on it later.",
								"While extremely aggressive, Umbrafang rarely humanoids, and avoids towns or villages unless provoked.",
								"{@b Umbrafang's Lair}",
								"Umbrafang resides in its own personal pocket plane, filled with stagnant water and littered with offal and the fleshless bones of its victims. Umbrafang can reach out and travel from this pocket plane to the Material Plane by means of water - borne teleportation. When hunting, Umbrafang selects a large body of water, often a swamp or still lake, to use as a temporary lair.",
								"The lair becomes acrid and stagnant, and any fish or other habitants within it either die or flee. The air around the lair becomes noxious and thick, and a visible layer of smog can be seen drifting across its surface.",
								"This lair remains for as long as Umbrafang is hunting in the area, and grants it access to any bodies of water within 5 miles, regardless of whether they are connected or not. When underwater,Umbrafang can see the surface of all bodies of water within 5 miles of its lair simultaneously, and can choose to breach the surface of any one of them, provided that water's surface is stagnant or undisturbed.",
								"If Umbrafang's lair were located in a large lake in the middle of a busy city, it could breach the surface through a bowl of murky water left in a commoner's back garden, attack, and drag them back into the lake using the bowl of water as the connecting passageway.",
								"A creature can only pass through this passageway if it is touching Umbrafang, otherwise it fails. If the target creature stops touching Umbrafang when half in the water, it is expelled back out in the same direction from which it entered.",
								"{@b Lair Actions}",
								"On initiative count 20 (losing initiative ties), Umbrafang takes a lair action to cause one of the following magical effects:",
								"Umbrafang creates fog on the surface of the lair as though it had cast the stinking cloud spell. The fog lasts until initiative 20 on the next round.",
								"The water in the lair becomes toxic and thick like tar. It remains this way until initiative count 20 on the next round. For the duration, movement in the water is considered difficult terrain for all creatures other than Umbrafang, and each creature in the water must succeed on a DC 13 Constitution saving throw or suffer 7 (2d6) poison damage and become poisoned until the end of its turn.",
								"The ground surrounding the lair becomes a dense bog. Creatures that start their turn within 10 feet of the lair or move within range during their turn must succeed on a DC 13 Dexterity saving throw or fall prone and become incapacitated until the end of its next turn.",
								"{@b Regional Effects}",
								"The region surrounding Umbrafang's lair is warped by the creature's presence, creating one of the following magical effects:",
								"The vegetation within 1 mile of the lair is rotten and decomposed, and gives off a smell of decaying fish.",
								"Any water within 5 miles of the lair that is in a container more than 2 inches deep (including, but not limited to: buckets, bowls, puddles, toilets, mugs, steins, man-made ponds, and lakes) turns a dull shade of muddy brown. The water is safe to drink but tastes of raw fish, and becomes clear when poured or disturbed. It goes back to a muddy brown when it settles.",
								"When spending more than ten minutes looking at a reflection in water within 5 miles of the lair, there is a 50% chance to get a sudden glimpse of Umbrafang. This glimpse lasts for 1 round. As long as it isn't incapacitated, Umbrafang always knows when a creature glimpses it in this way, and knows the exact location of the body of water used.",
								"If Umbrafang dies, vegetation returns to normal over the course of 1d4 days. The other effects end immediately.",
								"{@b Lesser And Greater Variants}",
								"Umbrafang has two versions: a lesser variant and a greater variant. This is to allow Umbrafang to be introduced in two different difficulty stages. If your adventuring party are all level 3, a lesser Umbrafang would be a perfect legendary creature to encounter. If your party are level 5 or 6, then a greater Umbrafang would prove a much more balanced and challenging encounter. The items a character can craft from the defeated Umbrafang's harvested parts depend on the variant."
							]
						},
						{
							"type": "entries",
							"name": "Size Comparison Chart",
							"entries": [
								"Below is a visual guide to give the Dungeon Master an idea of the size of Umbrafang, in comparison to a traditional sailing ship (30 crew), shark, and human of average height."
							]
						},
						{
							"type": "entries",
							"name": "Drawing Out Umbrafang",
							"entries": [
								"Umbrafang can be drawn out by digging a pit 5 feet wide by 10 feet deep in a swamp or other muddy area, and filling it with rainwater and severed fish heads. Runic symbols must then be carved into the surroundings, warding the pit from outside interference and accelerating the water's stagnation. Then the area must be left untouched for 8 hours, after which time Umbrafang is drawn to the region in search of food.",
								"While Umbrafang might appear in the pit itself, it is more likely to appear in a lake or other large body of fresh water and establish a lair there. This is usually within 5 or 6 miles of the area in which it was summoned. Umbrafang can remain in the region indefinitely, provided there is ample food and water for it to travel around in.",
								"{@b The Umbrafang Sea Shanty}",
								"Sailors who have previously encountered kuo-toa learned of a strange shanty the fishlike humanoids used to sing whenever they felt threatened. The shanty directly refers to Umbrafang, and is spoken and written in Undercommon. Those well versed in the Undercommon dialect can speak the shanty to gain a brief favour or trust from the kuo-toa, or to gleam more information on how Umbrafang could be summoned and 'appeased'. Translated in Common, the shanty reads as follows:",
								"\"Here we sit on waters gold",
								"Here we hunt in seas of old",
								"Here we see strange figures come",
								"One by one, with spear and drum",
								"Here we run from creatures tall",
								"Into shadows, safe and small",
								"Here we pray and here we howl",
								"Calling for a god that prowls",
								"A beast that seeks, a beast that reeks",
								"A beast that makes the tall ones shriek",
								"It lives in their bowls, their cups and bogs",
								"It strikes their cattle, sheep and hogs",
								"It eats their spawn, bones and all",
								"Crunches, chomps, big and small",
								"Call it we do, when cold and scared",
								"Flood the ground, see it prepared",
								"Wait, wait for the runes and marks",
								"Sit still, be quiet! Wait like sharks",
								"For the beast to appear, hungry and bold",
								"And watch it find a home in the cold",
								"Watch it lure the creatures tall",
								"Watch them cry, fight and fall",
								"Cackle and cheer, and let it be sang",
								"The revenge song of songs",
								"Our Umbrafang!\"",
								"[Umbrafang (Greater)]",
								"[Umbrafang (Lesser)]"
							]
						},
						{
							"type": "entries",
							"name": "Harvesting Umbrafang Parts",
							"entries": [
								{
									"type": "table",
									"caption": "Harvesting Umbrafang Parts",
									"colLabels": [
										"Harvesting Table",
										"Body Part" ,
										"Harvest DC" ,
										"Items Available to Craft",
										"Item Crafting Requirements",
										"Crafting DC and Time Taken"
									],
									"colStyles": [
										"col-2 text-left",
										"col-2 text-left",
										"col-2 text-left",
										"col-2 text-left",
										"col-4 text-left"
									],
									"rows": [
										[
											"Umbrafang Tentacle (4d6 pieces)",
											"DC 13 Wisdom (Survival) Salted storage barrel (Max of 3 pieces per barrel)",
											"Umbra Whip (2 pieces required) Refractive Rope (10 ft per pieces used, max of 60 ft.)",
											"Smith's tools: All items",
											"Umbra Whip: DC 14 Strength (Athletics) 5 Hours Refractive Rope: DC 15 Intelligence (Arcana) 2 Hours per 10 ft created."
										],
										[
											"Umbrafang Flesh (2d10 pieces)",
											"DC 13 Wisdom (Survival) Salted storage barrel (Max of 8 pieces per barrel)",
											"Umbra Mantle (4 pieces required) Umbrafang Tunic (3 pieces required) Umbrafang Jerky (2 pieces per pack)",
											"Leatherworker's Tools: Umbra Mantle Umbrafang Tunic Cook's Utensils: Umbrafang Jerky",
											"Umbra Mantle: DC 15 Intelligence (Arcana) 8 Hours Umbrafang Tunic: DC 15 Dexterity (Sleight of Hand) 4 Hours Umbrafang Jerky: DC 14 Wisdom (Survival) 8 Hours per pack"
										],
										[
											"Umbrafang Poison Gland (1d10 glands)",
											"DC 14 Intelligence (Nature) DC 16 Dexterity (Sleight of Hand) An empty jar, sealed with wax once filled.  (Max of 1 gland per jar)",
											"Concentrated Anti-Venom (2 glands required per vial created) Umbrafang Poison (3 glands required per vial created)",
											"Alchemist's Supplies: Concentrated Anti-Venom Poisoner's Kit: Umbrafang Poison",
											"Concentrated Anti-Venom: DC 16 Wisdom (Medicine) 6 Hours per vial Umbrafang Poison: DC 16 Intelligence (Arcana) 8 Hours per vial"
										],
										[
											"Umbrafang Tooth (2d8 teeth)",
											"DC 13 Wisdom (Survival)",
											"Umbrafang Kyoketsu (3 teeth and 10 feet of chain required) Umbra Arrowheads (set of 10) (5 teeth required) Longfang Blowgun (2 teeth required) Umbrahead Darts (set of 30) (10 teeth required)",
											"Smith's Tools: All items Tinker's Tools: Umbrafang Kyoketsu",
											"Umbrafang Kyoketsu DC 13 Dexterity (Sleight of Hand) and Intelligence (Tinker) 4 Hours Umbra Arrowheads DC 13 Dexterity (Sleight of Hand) 4 Hours Longfang Blowgun: DC 14 Dexterity (Sleight of Hand) 3 Hours Umbrahead Darts: DC 13 Dexterity (Sleight of Hand) 4 Hours"
										],
										[
											"Umbrafang Blood (1d10 samples)",
											"DC 15 Intelligence (Arcana) Empty glass vials (Max of 1 sample of blood per vial)",
											"Umbra's Resilience (1 vial required) Frostburn Potion (2 vials required)",
											"Alchemist's Supplies: Umbra's Resilience Herbalism Kit: Frostburn Potion",
											"Umbra's Resilience: DC 16 Intelligence (Arcana) 6 Hours per vial Frostburn Potion: DC 16 Intelligence (Arcana) 6 Hours per vial"
										]
									]
								},
								"Umbrafang has six tentacles it uses to grapple and drown its prey by dragging them underwater. These tentacles can be harvested upon Umbrafang's death, along with its various poison glands, teeth and porous flesh. An adventurer removing poison glands must do so with extreme caution, as failure can result in a sudden shower of toxic chemicals.",
								"The Harvest Table details the requirements for harvesting each body part, including the harvest DC, crafting DC, and resulting weapon or item the body part can be turned into.",
								"{@b Failing To Harvest A Poison Gland}",
								"Harvesting poison glans from Umbrafang can be hazardous for one's health. Should a character fail an ability check to harvest an Umbrafang poison gland by 5 or more, the gland ruptures, exploding out in a 10-foot radius sphere. Creatures caught in the sphere's area must make a DC 13 Constitution saving throw. A creature takes 10 (3d6) poison damage and becomes poisoned for 1 hour on a failed saving throw, or takes half as much damage and isn't poisoned on a successful one.",
								"{@b Table Guide}:",
								"Body Part: The part of the body that is being harvested, and how many pieces may be obtained from a successful harvest attempt.",
								"{@b Harvest DC}: This details the ability check and DC required to successfully harvest the chosen part and any storage requirements the part has.",
								"Each body part may only be successfully harvested once, unless specified otherwise, after which the body part is destroyed. If a creature fails the harvesting check by 5 or more, the body part is also destroyed, and can't be harvested again.",
								"If harvesting a body part requires two or more checks, the checks can be performed by any creatures involved in the harvesting. A ranger, for example, might decide to join in on the harvesting by making the required Wisdom (Survival) check, leaving the Dexterity (Sleight of Hand) check to the rogue. Other characters can take the Help action to grant the harvesting characters advantage on the aforementioned checks.",
								"{@b Items Available to Craft}: This column lists the item or items that may be crafted from harvested creature parts. You can only produce one of the listed items with each crafting attempt. The crafted item's properties are detailed at the end of the chapter.",
								"{@b Item Crafting Requirements}: This section details any requirements that must be met to turn the harvested body part into an item. Harvested pieces that note a storage requirement (such as a vial or barrel of salt) must be placed in their respective containers immediately after being harvested, and should remain in the container until used in crafting. A harvested piece degrades over time when not placed in its particular container or being used for crafting. Each piece can remain outside of a container for a maximum of 1d4 hours (ignoring crafting times) before succumbing to rot. A rotten piece can't be crafted. If an item is listed under two or more tools, proficiency in and access to both sets of tools are required, though these proficiencies can be shared over multiple characters. For example, one character could take part in the crafting and have proficiency in one set of tools, and another character could also take part in the crafting and provide the proficiency needed for the other set of tools.",
								"{@b Crafting DC}: The ability check and DC that must be met to successfully craft an item, and the time required to do so. If this check is failed by 5 or more, the harvested pieces used are destroyed in the crafting process.",
								"If crafting an item requires two or more checks, the checks can be performed by any creatures taking part in the crafting of the item. A barbarian, for example, might decide to make the required Strength (Athletics) check, leaving the Intelligence (Arcana) check to the wizard. Other characters can take the Help action to grant the crafting characters advantage on the aforementioned checks."
							]
						},
						{
							"type": "entries",
							"name": "Crafted Items",
							"entries": [
								"The crafted items listed below are in alphabetical order.",
								"Some items on this list can only be crafted by using materials harvested from either the greater or lesser Umbrafang respectively.",
								"The items properties change depending on which version of the creature it is crafted from, with the lesser properties displayed by default and the upgraded greater properties shown atop the description. Each item lists its school of magic, should it be the target of detect magic or similar spells.",
								"[Concentrated Anti-Venom]",
								"[Frostburn Potion]",
								"[Longfang Blowgun]",
								"[Refractive Rope]",
								"[Umbra Arrowhead]",
								"[Umbra Mantle]",
								"[Umbra Whip]",
								"[Umbra's Resilience]",
								"[Umbrafang Jerky]",
								"[Umbrafang Kyoketsu]",
								"[Umbrafang Poison]",
								"[Umbrafang Tunic]",
								"[Umbrahead Dart]"
							]
						},
						{
							"type": "entries",
							"name": "Selling Harvested Materials",
							"entries": [
								"Materials harvested from Umbrafang can be sold to interested third parties, such as collectors, arcane scholars or nobility. Items can also be sold to criminal black-market dealers at an increased price, should the character have a criminal contact or background.",
								"The Harvest Value table details average sale guidelines for a piece of each material type.",
								"Costs may fluctuate based on your campaign's economy, sale location, or per trader, at the discretion of the Dungeon Master.",
								{
									"type": "table",
									"caption": "Harvest Value Table",
									"colLabels": [
										"Material Name" ,
										"Sale Price" ,
										"Black Market Price"
									],
									"colStyles": [
										"col-2 text-center",
										"col-2 text-center",
										"col-2 text-center"
									],
									"rows": [
										[
											"Umbrafang Tentacle",
											"50 gp (Greater) 10 gp (Lesser)",
											"75 gp (Greater) 30 gp (Lesser)"
										],
										[
											"Umbrafang Flesh" ,
											"50 gp (Greater) 30 gp (Lesser)",
											"80 gp (Greater) 50 gp (Lesser)"
										],
										[
											"Umbrafang Poison Gland",
											"300 gp (Greater) 175 gp (Lesser)",
											"450 gp (Greater) 300 gp (Lesser)"
										],
										[
											"Umbrafang Tooth" ,
											"30 gp (Greater) 10 gp (Lesser)",
											"50 gp (Greater) 20 gp (Lesser)"
										],
										[
											"Umbrafang Blood" ,
											"300 gp (Greater) 175 gp (Lesser)",
											"450 gp (Greater) 300 gp (Lesser)"
										]
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "A Waterborne Watcher",
							"entries": [
								"Recommended Character Level: 5 - 6 (Greater) 1 - 2 (Lesser)",
								"Minimum Equipment Required: Basic weaponry and equipment.",
								"Recommended Equipment Required: A large rowboat (GoS, Appendix A: Of Ships and the Sea), and at least one magical weapon (if facing the greater version of Umbrafang).",
								"Party Size: 4 - 6",
								"Difficulty: Deadly (4), Hard/Medium (6)",
								"Quest Creature: Umbrafang",
								"Quest overview",
								"All across Saltmarsh, villagers are mysteriously disappearing. The Saltmarsh guards are at their wit's end, and have no leads. The disappearances have been considered linked, but the guards cannot find a pattern to connect those that have vanished. All across the town, there are increasing reports of livestock and pets also going missing. The guards have now turned to local adventurers for help, offering a small keelboat as reward for their efforts.",
								"Important Quest Notes",
								"This quest provides a basic battle map for Umbrafang's current lair, located in the swampy outskirts of Saltmarsh. NPC and ship stat blocks for this quest are located in the Monster Manual and Ghosts of Saltmarsh supplements, and detailed at the end of the quest.",
								"Below are a list of villagers who have been reported as missing you can use to flesh out the intrigue of this hunt.",
								{
									"type": "table",
									"colLabels": [
										"Name",
										"Age",
										"Days Missing Since Reported"
									],
									"colStyles": [
										"col-2 text-center",
										"col-2 text-center",
										"col-2 text-center"
									],
									"rows": [
										[
											"Alliette Barrow",
											"40",
											"5 days"
										],
										[
											"Dredge Luckton",
											"35",
											"4 days"
										],
										[
											"Harriet Willowleaf",
											"60",
											"7 days"
										],
										[
											"Jungen Foxglove",
											"24",
											"8 days"
										],
										[
											"Ungid Fletcher",
											"55",
											"7 days"
										],
										[
											"Markus Bladeborne",
											"22",
											"4 days"
										],
										[
											"Jeremia Winglet",
											"28",
											"3 days"
										],
										[
											"Amber Leaftoad",
											"80",
											"2 days"
										]
									]
								}
							]
						},
						{
							"type": "entries",
							"name": "Stage 1: Meeting the NPCs",
							"entries": [
								"The characters are introduced to Eda Oweland, who explains the situation of missing persons in Saltmarsh. She reveals to the characters that the most recent disappearance took place inside the Wicker Goat, the oldest tavern in Saltmarsh. Eda goes on to explain that a man by the name of Hild Vandebue got into a bar fight a few nights ago, only to stagger into the toilets to wash his face and never came back out. The guards have searched high and low for him, but to no avail. She believes magical interference might be to blame, but doesn't know what.",
								"Eda asks the characters to investigate the Wicker Goat further and see if they can find something the guards might have missed. If the characters succeed in solving the mystery, Oweland rewards them for their efforts with a battered but reliable keelboat, named The Waveskipper."
							]
						},
						{
							"type": "entries",
							"name": "Stage 2: Exploration",
							"entries": [
								"Upon arriving at the Wicker Goat, the characters find it busy as usual with dwarven miners and town guard. The characters are taken into the back room by Lankus Kurrid, the tavern's owner, and allowed to investigate the area where Vandebue supposedly went missing.",
								"Lankus has gathered the following information from patrons that were in his tavern that night. He shares this information willingly to the characters should they ask for it, but otherwise leaves them to their own devices:",
								"The Bathrooms Had Recently Been Cleaned.",
								"\"Those rooms were filthy. I'd wanted to get them cleaned a few night's prior, but the cleaner could only arrive today. I'll have to get them back in again though - the water's going brown!\"",
								"The Bar Fight.",
								"\"Honestly, we have one every other night in here. There's not much surprise about it. Though I reckon someone might've been using magic spells this time around, because when the scrapping died down, I could swear the place smelled like stagnant water.\"",
								"Faces In The Ale.",
								"\"Sure, there's a lot of weird stuff that goes on around here. I've seen my fair share of it. But there was something last night that drunken idiot said that's still sticking with me today: He said there was a face in his ale. I've checked the mug he was using, and checked my barrels. There's nothing living in 'em, I can assure you that!\"",
								"The characters can make a {@b DC 15 Intelligence (History) check} to see if any of what Kurrid tells them sounds familiar. On a successful check, it is revealed the most likely culprit is some form of magical aquatic creature, known as Umbrafang.",
								"If the characters don't speak with Kurrid about what happened, fail the history check, or wish to investigate further to confirm the theory of Umbrafang, they can perform one of the following ability checks. Each ability check takes between 10 and 20 minutes to complete.",
								"{@b Check The Stall} ({@b DC 14 Wisdom (Perception) check}). The character checks the toilet stalls for any sign of damage. On a success, the character notices a bloodstain on the floor, created from a hand scrabbling for grip.",
								"{@b Check For Magic} ({@b DC 14 Intelligence (Arcana) check}). The character checks the surrounding area for magical signs or wards.",
								"This check automatically succeeds if a character casts detect magic.",
								"Residual magic can be detected in pools of water deeper than 2 inches. The magic originates from the school of conjuration, and appears to be Planar in nature.",
								"{@b Reconstruct Scene} ({@b DC 13 Charisma (Performance) check}). The character re-enacts various possible scenes of escape, coming to the conclusion that there was no possible way for the victim to have left the facilities by any other means than the front door, unless they had access to teleportation magic.",
								"{@b Watch The Water}. The character spends ten or more minutes watching water in a bowl, sink, or other container, triggering the regional effect which briefly reveals Umbrafang to the character, and vice versa.",
								"{@b Question the Guards} ({@b DC 13 Charisma (Persuasion) check}. The character spends 1 hour talking to the guards about the missing villagers. The guards reveal that each villager was alone when they went missing and there was muddy water present at the scene of each disappearance, though they considered the water a coincidence, as there was no other evidence to suggest it was linked to the victim.",
								"After making one or more of these checks, characters can make a {@b DC 14 Intelligence (History) check} to determine what kind of creature could be responsible for the disappearances. A successful check reveals Umbrafang to be responsible. If the check succeeds by 5 or more, the character learns the lore surrounding its lair, including regional effects. Each completed ability check from the lists above reduces this check's DC by 1.",
								"Once characters have identified Umbrafang as the culprit, they can begin to track it by making a {@b DC 14 Wisdom (Survival)}, or {@b Intelligence (Nature) check}. On a success, a character discerns the most likely location of Umbrafang's lair is a lake situated 4 miles outside Saltmarsh.",
								"It takes the characters 2 hours to navigate the terrain outside of Saltmarsh to reach the lake. A DC 13 Wisdom (Survival) check decreases this travel time to 1 hour on a success. Characters should have the opportunity to discuss a plan either before they set off from Saltmarsh, or during the travel time. If a character has spent time looking in ponds, pools, or other containers of water on their journey to the lair, Umbrafang knows they are heading in its direction.",
								"{@b Researching Umbrafang}",
								"During the exploration stage, characters can also choose to gather information pertaining to Umbrafang from local rumours, hearsay, and old texts. A character can prepare for the upcoming encounter by making one of the ability checks detailed below.",
								"A character can attempt each check once over the course of this quest. If a check is failed, no information is gathered.",
								"{@b Gather Rumours} ({@b DC 13 Charisma (Persuasion) check}). The character spends time mingling with sailors, gathering rumours and hearsay about the legend of Umbrafang.",
								"\"I've heard that it's a monstrous fish, with a mouth as wide as a cart! Get too close, and it'll swallow you whole!\"",
								"Search Books and Old Scrolls ({@b DC 13 Intelligence (Investigation) check}).",
								"The character spends 1d6 + 1 hours reading up on old tales and stories surrounding the lore of Saltmarsh, eventually discovering the ancient sea shanty created by the Kuo-toa.",
								"{@b Listen To The Drunks} ({@b DC 13 Wisdom (Perception) check}. The character shadows drunks in the tavern, listening in on their conversation for any mention of others that might have disappeared, or any tall tales they have to tell.",
								"\"I tell ya, I'm not lyin'! My ma used to tell me stories of a beast that could snatch us from our beds in the blink of an eye, if we ever went near deep water on our own. I tell ya, I didn't used to believe there was anythin' down there, but now... Well stories start somewhere don't they?\""
							]
						},
						{
							"type": "entries",
							"name": "Stage 3: The Hunt",
							"entries": [
								"This stage of the quest begins once the characters have reached the lair and either decided to attack Umbrafang, or Umbrafang ambushes them from a nearby pool of water. It is important to consider the environmental effects during this encounter, as rain, heat, or fog can change the battlefield significantly. The Dungeon Master can either choose the weather type for this encounter, or roll on the table below as the characters are journeying to the lair.",
								"This weather effect remains for 2d4 hours before dispersing.",
								{
									"type": "table",
									"caption": "Weather Table",
									"colLabels": [
										"D4" ,
"Result"
									],
									"colStyles": [
										"col-2 text-center"
									],
									"rows": [
										[
											"1" ,
											"The area is hit by a thunderstorm, which covers a 15 mile radius. Attacks that deal fire damage have their damage die reduced by one step, to a minimum of 1d4. Attacks that deal lightning damage have their damage die increased by one step, to a maximum of 1d12."
										],
										[
											"2",
											"The area is covered by sea fog. This is more likely to occur if the characters arrive at the lair early in the morning or late into the evening. All creatures and objects within 20 miles of the coastline (including the lair) is lightly obscured in white fog."
										],
										[
											"3",
											"It is raining. The rain clouds cover a 30-mile radius, and move slowly south. The rain makes traversing the already boggy ground around the lair more difficult. A creature has disadvantage on Strength or Dexterity checks made to maintain their footing while on solid ground. In addition, ranged attack rolls suffer a -1 penalty to hit due to increased winds and lower visibility."
										],
										[
											"4",
											"It is extremely sunny with little cloud cover. A light breeze, originating from the sea, spreads across the region in a westerly direction. Fog and smoke clouds are dispersed immediately when created, and creatures have a +1 bonus to Wisdom (Perception) checks.  Creatures with the sunlight sensitivity trait are considered to always be in direct sunlight."
										]
									]
								},
								"{@b Umbrafang Tactics}",
								"Umbrafang is a cunning and sly opponent, enticing its foes into its lair before blinding them with thick fog and attacking them one at a time.",
								"If characters decide to traverse Umbrafang's lair using a rowboat or other means to remain above the surface, Umbrafang uses its lair actions to reduce visibility atop the water's surface before attempting to capsize the boat. Alternatively, Umbrafang chooses a single character that appears to display the biggest threat, either through magic use or raw strength, and pulls them into the water. Umbrafang loves to take advantage of its Powerful Swimmer ability to separate its foes. Once it has a creature grappled underwater, it puts as much distance between itself and the un-grappled allies as possible before enjoying its meal.",
								"If the characters assail it from the water's edge and refuse to enter the lair, Umbrafang leaps up onto the ground and uses its Toxic Mucus. It then focuses on the target with the biggest threat range (usually a ranged character), attempting to grapple and pull them into the water. When Umbrafang grapples a target, it uses its Bite as soon as possible to swallow it. It then uses its Acidic Spittle on subsequent rounds to hit as many targets as possible. Umbrafang only gets within melee range of a target in order to grapple it, and uses its legendary actions to remain at range until it is ready to strike again.",
								"If Umbrafang is reduced to 30 hit points or fewer, it attempts to escape by using its water-borne teleportation feature to teleport into Saltmarsh. Its plan can be revealed with a successful DC 13 Wisdom (Insight) check. Umbrafang can only use its teleportation ability if the water's surface is calm enough. If the surface of the lair is continually disturbed, Umbrafang's teleportation fails. The water in the lair is considered calm enough for Umbrafang to teleport from if it remains undisturbed for 2 rounds. Swimming or sailing in the water doesn't cause enough of a disturbance to prevent this, but a character jumping into or thrashing around in the water does.",
								"If Umbrafang is killed in water, it's body floats for 5 minutes before beginning to sink.",
								"Characters can attempt to determine the health (or combat ability) of Umbrafang by using their action to make a {@b DC 15 Wisdom (Insight)} or {@b Intelligence (Nature) check}. On a success, the character knows Umbrafang is one of the following:",
								"95 - 158 hit points: Combat Capable",
								"45 - 94 hit points: Slightly Weakened",
								"44 or less hit points: Weak and Struggling"
							]
						},
						{
							"type": "entries",
							"name": "Stage 4: Completion",
							"entries": [
								"After defeating Umbrafang, characters can harvest its parts, search its lair, and return to Eda Oweland for payment.",
								"Upon providing proof of the creature's defeat, Oweland awards the characters The Waveskipper, along with the following additional items, depending on which version of the Umbrafang was defeated:",
								"Greater Umbrafang",
								"150gp and 50sp.",
								"Free drink, room, and board at the Wicker Goat for as long as the characters remain in Saltmarsh.",
								"A piece of crystal which glows faintly in the moonlight, found in the Saltmarsh mines.",
								"Lesser Umbrafang",
								"30gp and 25sp.",
								"Free food at the Wicker Goat for as long as the characters remain in Saltmarsh.",
								"Umbrafang's Lair",
								"The following items can be found by characters willing to dive down into Umbrafang's lair and making a {@b Wisdom (Perception)} or {@b Intelligence (Investigation) check}. The items have varying ability check DCs. If a character meets or exceeds multiple DCs at once, they discover all items pertaining to those DCs.",
								"{@b DC 10}: The skeletal remains of various common folk, with no identifying markings. A small leather pouch, containing 20cp and 5sp is buried under a thin layer of dirt beneath them.",
								"{@b DC 14}: A waterlogged diary, sealed with a magical clasp (DC 20 to unlock). Most of the diary is indecipherable or unreadable.",
								"The pages that are readable are written in a strange runic language, similar to draconic, but far more ancient. If translated, it reveals the Deep Dweller sea shanty (see chapter 1).",
								"{@b DC 18}: A dead Sprite, inside a moss-covered glass bottle, which reads \"Heart Seer No. 03\"."
							]
						},
						{
							"type": "entries",
							"name": "Notable NPCs and Other Stat Blocks",
							"entries": [
								"Name: Eda Oweland",
								"Race: Human (She/Her)",
								"Alignment: Chaotic good",
								"Occupation: Senior member of the Saltmarsh town council",
								"Stat Block: Noble",
								"Personality Trait: Gruff, pragmatic. Her graying hair is cut short and her face bears the marks of a life lived outdoors. Refer to Ghosts of Saltmarsh for more personality details. (GoS, Chapter 1: Saltmarsh)",
								"Name: Lankus Kurrid",
								"Race: Human (He/Him)",
								"Alignment: Neutral good",
								"Occupation: Tavern owner",
								"Stat Block: Guard",
								"Personality Trait: Retired officer that caters to the dwarven miners and town guard around Saltmarsh. Refer to Ghosts of Saltmarsh for more details. (GoS, Chapter 1: Saltmarsh)",
								"Name: Hild Vandebue",
								"Race: Human (He/Him, deceased)",
								"Alignment: Chaotic neutral",
								"Occupation: Sailor",
								"Stat Block: Commoner",
								"Personality Trait: Hild is deceased, killed by Umbrafang. If the characters ask Lankus Kurrid or other locals, they reveal he was rough around the edges, and struggled with various debts he had mounted up with Keledek the Unspoken (GoS, Chapter 1: Saltmarsh).",
								"Name: Gerald Netchwater",
								"Race: Human (He/Him)",
								"Alignment: Chaotic good",
								"Occupation: Guard",
								"Stat Block: Guard",
								"Personality Trait: Gerald is in charge of the investigation into the disappearances, but has become drunk and despondent because his case hasn't turned up any leads. Gerald is likely to resent the characters for encroaching on his turf, but comes around to appreciating them when he learns of Umbrafang and the danger it presents, claiming it to be way above his pay grade.",
								"Other Stat Blocks In This Quest",
								"The Waveskipper uses the Keelboat stat block (GoS, Appendix A: Of Ships and the Sea). The keelboat has no weapons, and a set of broken Clockwork Oars (GoS, Appendix A: Of Ships and the Sea), which can be repaired by spending 20gp on materials and 10 hours over the course of 3 days replacing the clockwork rotors and chain belts."
							]
						},
						{
							"type": "entries",
							"name": "Other Plot Hooks",
							"entries": [
								"Here are a few examples of other plot hooks you can use to introduce the legend of Umbrafang to your Dungeons & Dragons campaign:",
								"A clan of Kuo-Toa pirates have been reported attacking and sinking merchant vessels off the coast of Wind's Cape Town.",
								"Cape Town Guardhouse is offering a sizable reward to any adventurers willing to combat the Kuo-Toa threat.",
								"A warning to potential applicants: many have already tried, and none have returned.",
								"Those interested should speak with Watchmaster Aarith as soon as possible.",
								"Aarith Greyborn,",
								"Senior Watchmeister",
								"Bramblebrook Bellhands has been complaining recently that his shop, \"Pet Brush Bathhouse\"Jhas become haunted by a sinister spirit.",
								"He claims to have seen the eyes of a monster in the many bathtubs around the property he uses to bathe the livestock.",
								"While initial investigations have brought up nothing but plumbing issues, Bramblebrook is convinced something far more sinister is going on, and to be honest, it's trying my patience.",
								"Any adventurers willing to spend a few hours getting to the bottom of this shall find themselves a few coins richer. Speak to Marcelle Trillow at the Eastern Watchtower for more information.",
								"Legend has it a fearsome beast prowls the swamps surrounding the small village of Greywind.",
								"The village folk that reside within the town have become prisoners; unable to leave, lest the monstrous beast drag them to a watery grave. Their crops rotting in their fields and their water supply polluted and brown, there is very little time left before the once proud and bustling village becomes nothing but a deserted and desolate wasteland.",
								"Can a hero slay the beast and free the town before it is too late?",
								"Or will they themselves fall victim to the creatures insidious and bloodthirsty tactics?"
							]
						}
					]
				}
			]
		}
	],
	"monster": [
		{
			"name": "Deep Dweller (Adult)",
			"source": "",
			"page": 0,
			"size": [
				"G"
			],
			"type": {
				"type": "monstrosity",
				"tags": [
					"titan"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 18,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 396,
				"formula": "24d20 + 144"
			},
			"speed": {
				"walk": 20,
				"swim": 80
			},
			"str": 30,
			"dex": 11,
			"con": 22,
			"int": 24,
			"wis": 18,
			"cha": 20,
			"save": {
				"str": "+17",
				"dex": "+7",
				"con": "+13",
				"int": "+14",
				"wis": "+11"
			},
			"senses": [
				"blindsense 120 ft (blind beyond this radius)."
			],
			"passive": 14,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"lightning",
				"poison",
				"psychic"
			],
			"conditionImmune": [
				"charmed",
				"frightened",
				"paralyzed",
				"poisoned"
			],
			"languages": [
				"telepathy 120 ft"
			],
			"cr": "24",
			"trait": [
				{
					"name": "Creature of Legend",
					"entries": [
						"The deep dweller is a creature of legend. Its weapon attacks are magical, and it can't be killed by conventional means. If the deep dweller is reduced to 0 hit points it instead flees, retreating into the abyss of the sea, and doesn't return for 500 years. During this time, it can't be re-summoned, and it regrows all severed tentacles or fangs over the course of 1 year.",
						"The deep dweller only dies if it can't retreat into the sea when it's reduced to 0 hit points, such as if it is beached, or suffocates."
					]
				},
				{
					"name": "Freedom of Movement",
					"entries": [
						"The deep dweller ignores difficult terrain, and magical effects can't reduce its speed or cause it to be {@condition restrained}. It can spend 5 feet of movement to escape from nonmagical restraints or being {@condition grappled}."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the deep dweller fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Psychic Horror",
					"entries": [
						"The deep dweller can use its telepathy only to display nightmarish images or feelings of abject horror.  Survivors of an attack by the deep dweller often experience nightmares and disturbed sleep for many months afterwards."
					]
				},
				{
					"name": "Tentacles and Fangs",
					"entries": [
						"The deep dweller has eight tentacles and four fangs. The tentacles can each be severed by magical slashing damage, and the fangs can be broken by magical bludgeoning damage. A tentacle has AC 20 and 30 hit points. A fang has AC 20 and 15 hit points. The deep dweller is defeated if all its tentacles are severed, and can't use its Bite if all fangs are broken."
					]
				},
				{
					"name": "Water Breathing",
					"entries": [
						"The deep dweller can only breathe underwater.  While out of water, the deep dweller can hold its breath for 4 hours."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The deep dweller makes three tentacle attacks, each of which it can replace with one use of Constrict. It can replace one tentacle attack with one use of Psychic Drain. The deep dweller can use different tentacles for each attack."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"Melee weapon attack: {@hit 17} to hit, reach 5ft., one target. {@h}23 ({@damage 3d8 + 10}) piercing damage. If the target is a Large or smaller creature {@condition grappled} by the deep dweller, that creature is swallowed, and the grapple ends. While swallowed, the creature is {@condition blinded} and {@condition restrained}, it has total cover against attacks and other effects outside the deep dweller, and it takes 35 ({@damage 10d6}) acid damage at the start of each of the deep dweller's turns. If the deep dweller takes 30 damage or more on a single turn from a creature inside it, the deep dweller must succeed on a {@dc 25} Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall {@condition prone} in a space within 10 feet of the deep dweller. If the deep dweller is reduced to 0 hit points or otherwise defeated, it vomits out all swallowed creatures and a burst of black, bloody ichor before fleeing."
					]
				},
				{
					"name": "Tentacle",
					"entries": [
						"Melee weapon attack: {@hit 17} to hit, reach 30 ft., one target.  {@h}20 ({@damage 3d6 + 10}) bludgeoning damage, and if the target is Large or smaller it is {@condition grappled} (escape {@dc 18}). Until this grapple ends, the target is {@condition restrained}, and if the deep dweller attacks and hits another target with the same tentacle, instead of grappling the new target, the currently {@condition grappled} creature takes 7 ({@damage 2d6}) bludgeoning damage. If the deep dweller hits a Huge or larger target with three tentacle attacks in the same round, it can use all three tentacles to grapple the target, and the deep dweller can't use those tentacles on another target until this grapple ends.  Constrict. Melee weapon attack: {@hit 17} to hit, reach 30 ft., one target {@condition grappled} by the deep dweller. {@h}31 ({@damage 6d6 + 10}) bludgeoning damage."
					]
				},
				{
					"name": "Psychic Drain",
					"entries": [
						"One creature {@condition grappled} by the deep dweller must make a {@dc 23} Intelligence saving throw. A creature takes 22 ({@damage 4d10}) psychic damage on a failed save, and half as much on a successful one, and the deep dweller regains a number of hit points equal to half the damage dealt. If the saving throw fails by 10 or more, the {@condition grappled} creature suffers a long-term madness."
					]
				},
				{
					"name": "Blinding Scream {@recharge 5}",
					"entries": [
						"The deep dweller unleashes a pulse of psychic energy, which radiates out from it in a 120foot radius sphere. Creatures in the area must make on a {@dc 23} Intelligence saving throw. A creature takes 22 ({@damage 4d10}) psychic damage and is {@condition blinded} for 1 minute on a failed save, or takes half as much damage and isn't {@condition blinded} on a successful one. A {@condition blinded} creature can attempt this saving throw again at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature can't be {@condition blinded} by this feature for the next 24 hours."
					]
				}
			],
			"legendary": [
				{
					"name": "Tentacle Attack or Constrict",
					"entries": [
						"The deep dweller makes one tentacle attack, or uses its Constrict."
					]
				},
				{
					"name": "Psychic Drain (Costs 2 Actions)",
					"entries": [
						"The deep dweller uses its Psychic Drain."
					]
				},
				{
					"name": "Psychic Redoubt (Costs 3 Actions)",
					"entries": [
						"The deep dweller recharges its Blinding Scream."
					]
				}
			],
			"traitTags": [
				"Legendary Resistances",
				"Water Breathing"
			],
			"actionTags": [
				"Multiattack",
				"Swallow",
				"Tentacles"
			],
			"languageTags": [
				"TP"
			],
			"damageTags": [
				"A",
				"B",
				"P",
				"Y"
			],
			"miscTags": [
				"RCH"
			],
			"conditionInflict": [
				"blinded",
				"grappled",
				"restrained"
			]
		},
		{
			"name": "Deep Dweller (Juvenile)",
			"source": "",
			"page": 0,
			"size": [
				"G"
			],
			"type": {
				"type": "monstrosity",
				"tags": [
					"titan"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 203,
				"formula": "14d20 + 56"
			},
			"speed": {
				"walk": 10,
				"swim": 70
			},
			"str": 22,
			"dex": 16,
			"con": 18,
			"int": 18,
			"wis": 14,
			"cha": 16,
			"save": {
				"con": "+8",
				"int": "+8",
				"wis": "+6"
			},
			"senses": [
				"blindsense 60 ft (blind beyond this radius)."
			],
			"passive": 12,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"lightning",
				"poison",
				"psychic"
			],
			"conditionImmune": [
				"charmed",
				"frightened",
				"paralyzed",
				"poisoned"
			],
			"languages": [
				"telepathy 60 ft"
			],
			"cr": "13",
			"trait": [
				{
					"name": "Creature of Legend",
					"entries": [
						"The deep dweller is a creature of legend. Its weapon attacks are magical, and it can't be killed by conventional means. If the deep dweller is reduced to 0 hit points it instead flees, retreating into the abyss of the sea, and doesn't return for 500 years. During this time, it can't be re-summoned, and it regrows all severed tentacles or fangs over the course of 3 years.  The deep dweller only dies if it can't retreat into the sea when it's reduced to 0 hit points, such as if it is beached, or suffocates."
					]
				},
				{
					"name": "Freedom of Movement",
					"entries": [
						"The deep dweller ignores difficult terrain, and magical effects can't reduce its speed or cause it to be {@condition restrained}. It can spend 5 feet of movement to escape from nonmagical restraints or being {@condition grappled}."
					]
				},
				{
					"name": "Legendary Resistance (1/Day)",
					"entries": [
						"If the deep dweller fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Psychic Horror",
					"entries": [
						"The deep dweller can use its telepathy only to display nightmarish images or feelings of abject horror.",
						"Survivors of an attack by the deep dweller often experience nightmares and disturbed sleep for many months afterwards."
					]
				},
				{
					"name": "Tentacles and Fangs",
					"entries": [
						"The deep dweller has eight tentacles and four fangs. The tentacles can each be severed by magical slashing damage, and the fangs can be broken by magical bludgeoning damage. A tentacle has AC 18 and 20 hit points. A fang has AC 18 and 10 hit points. The deep dweller is defeated if all its tentacles are severed, and can't use its Bite if all fangs are broken."
					]
				},
				{
					"name": "Water Breathing",
					"entries": [
						"The deep dweller can only breathe underwater.  While out of water, the deep dweller can hold its breath for 1 hour."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The deep dweller makes two tentacle attacks, each of which it can replace with one use of Constrict. It can replace one tentacle attack with one use of Psychic Drain. The deep dweller can use different tentacles for each attack."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"Melee weapon attack: {@hit 10} to hit, reach 5ft., one target. {@h}19 ({@damage 3d8 + 6}) piercing damage. If the target is a Large or smaller creature {@condition grappled} by the deep dweller, that creature is swallowed, and the grapple ends. While swallowed, the creature is {@condition blinded} and {@condition restrained}, it has total cover against attacks and other effects outside the deep dweller, and it takes 17 ({@damage 5d6}) acid damage at the start of each of the deep dweller's turns. If the deep dweller takes 15 damage or more on a single turn from a creature inside it, the deep dweller must succeed on a {@dc 25} Constitution saving throw at the end of that turn or regurgitate all swallowed creatures, which fall {@condition prone} in a space within 10 feet of the deep dweller. If the deep dweller is reduced to 0 hit points or otherwise defeated, it vomits out all swallowed creatures and a burst of black, bloody ichor before fleeing."
					]
				},
				{
					"name": "Tentacle",
					"entries": [
						"Melee weapon attack: {@hit 10} to hit, reach 30 ft., one target.  {@h}16 ({@damage 3d6 + 6}) bludgeoning damage, and if the target is Large or smaller it is {@condition grappled} (escape {@dc 15}). Until this grapple ends, the target is {@condition restrained}, and if the deep dweller attacks and hits another target with the same tentacle, instead of grappling the new target, the currently {@condition grappled} creature takes 3 ({@damage 2d6}) bludgeoning damage. If the deep dweller hits a Huge or larger target with three tentacle attacks in the same round, it can use all three tentacles to grapple the target, and the deep dweller can't use those tentacles on another target until this grapple ends."
					]
				},
				{
					"name": "Constrict",
					"entries": [
						"Melee weapon attack: {@hit 10} to hit, reach 30 ft., one target {@condition grappled} by the deep dweller. {@h}23 ({@damage 5d6 + 6}) bludgeoning damage."
					]
				},
				{
					"name": "Psychic Drain",
					"entries": [
						"One creature {@condition grappled} by the deep dweller must make on a {@dc 18} Intelligence saving throw. A creature takes 11 ({@damage 2d10}) psychic damage on a failed save, and half as much on a successful one, and the deep dweller regains a number of hit points equal to half the damage dealt. If the creature fails this saving throw by 10 or more, it also suffers a level of long-term madness."
					]
				},
				{
					"name": "Blinding Scream {@recharge 5}",
					"entries": [
						"The deep dweller unleashes a pulse of psychic energy, which radiates out from it in a 120-foot radius sphere. Creatures in the area must succeed on a {@dc 18} Intelligence saving throw. A creature takes 11 ({@damage 2d10}) psychic damage and is {@condition blinded} for 1 minute on a failed save, or takes half as much damage and isn't {@condition blinded} on a successful one. A {@condition blinded} creature can attempt this saving throw again at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature can't be {@condition blinded} by this feature for the next 24 hours."
					]
				}
			],
			"legendary": [
				{
					"name": "",
					"entries": [
						"The deep dweller can take 1 legendary action, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The deep dweller regains spent legendary actions at the start of its turn."
					]
				},
				{
					"name": "Tentacle Attack",
					"entries": [
						"The deep dweller makes a tentacle attack."
					]
				},
				{
					"name": "Constrict",
					"entries": [
						"The deep dweller uses its Constrict."
					]
				},
				{
					"name": "Hide",
					"entries": [
						"The deep dweller takes the Hide action."
					]
				}
			],
			"traitTags": [
				"Legendary Resistances",
				"Water Breathing"
			],
			"actionTags": [
				"Multiattack",
				"Swallow",
				"Tentacles"
			],
			"languageTags": [
				"TP"
			],
			"damageTags": [
				"A",
				"B",
				"P",
				"Y"
			],
			"miscTags": [
				"AOE",
				"RCH"
			],
			"conditionInflict": [
				"blinded",
				"restrained"
			]
		},
		{
			"name": "Umbrafang (Greater)",
			"isNamedCreature": true,
			"source": "",
			"size": [
				"H"
			],
			"type": "aberration",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 18,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 158,
				"formula": "15d12 + 60"
			},
			"speed": {
				"walk": 5,
				"swim": 50
			},
			"str": 18,
			"dex": 16,
			"con": 19,
			"int": 14,
			"wis": 20,
			"cha": 15,
			"save": {
				"str": "+8",
				"dex": "+8"
			},
			"senses": [
				"blindsight 60 ft."
			],
			"passive": 15,
			"resist": [
				{
					"resist": [
						"cold",
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical weapons",
					"cond": true
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"frightened",
				"poisoned"
			],
			"languages": [
				""
			],
			"cr": "12",
			"trait": [
				{
					"name": "Amphibious",
					"entries": [
						"Umbrafang can breathe air and water."
					]
				},
				{
					"name": "Creature of Legend",
					"entries": [
						"Umbrafang is a unique creature of legend. Its weapon attacks are magical, and it has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "Freedom of Movement",
					"entries": [
						"When in water, Umbrafang ignores difficult terrain, and magical effects can't reduce its speed or cause it to be {@condition restrained}. It can spend 5 feet of movement to escape from nonmagical restraints or being {@condition grappled}."
					]
				},
				{
					"name": "Legendary Resistance (2/Day)",
					"entries": [
						"If Umbrafang fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Toxic Aura",
					"entries": [
						"At the start of Umbrafang's turns, each creature within 5 feet of it takes 3 ({@damage 1d6}) poison damage. A creature that touches Umbrafang or hits it with a melee attack while within 5 feet of it takes 3 ({@damage 1d6}) poison damage."
					]
				},
				{
					"name": "Stagnant Protection",
					"entries": [
						"Umbrafang has advantage on Dexterity (Stealth) checks when in stagnant or still water. In addition, when underwater, it has a +2 bonus to its AC against attacks originating from out of or above water."
					]
				},
				{
					"name": "Powerful Swimmer",
					"entries": [
						"Umbrafang can move at full speed when grappling a single target, and half speed when grappling up to three separate targets. Targets are pulled along by Umbrafang as it moves, and remain within 15 feet of it at all times."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Umbrafang makes three tentacle attacks. It can replace one tentacle attack with a single use of Bite."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"Melee weapon attack: {@hit 8} to hit, reach 5ft., one target. {@h}13 ({@damage 2d8 + 4}) piercing damage. If the target is a Large or smaller creature {@condition grappled} by Umbrafang, that creature is swallowed, and the grapple ends. While swallowed, the creature is {@condition blinded} and {@condition restrained}, it has total cover against attacks and other effects outside Umbrafang and it takes 7 ({@damage 2d6}) acid damage at the start of each of Umbrafang's turns. Umbrafang can only have one target swallowed at a time. If Umbrafang dies, a swallowed creature is no longer {@condition restrained} and can escape from the corpse using 5 feet of movement."
					]
				},
				{
					"name": "Tentacle",
					"entries": [
						"Melee weapon attack: {@hit 8} to hit, reach 15 ft., one target. {@h}7 ({@damage 2d6 + 4}) bludgeoning damage and 3 ({@damage 1d6}) poison damage.",
						"If the target is Large or smaller it is {@condition grappled} (escape {@dc 16}).",
						"Until this grapple ends, the target is {@condition restrained}, and Umbrafang can't use that tentacle on another target.",
						"Umbrafang has 6 tentacles. Each can be used to grapple a different target."
					]
				},
				{
					"name": "Toxic Mucus (Out of Water Only, Recharge 5 - 6)",
					"entries": [
						"Umbrafang releases globules of sticky mucus from bulbous glands across its body, which scatter out from it in a 10-foot radius sphere. The mucus remains on the ground for 1 minute, or until washed away by 5 or more gallons of fresh water. A creature that starts its turn in the area or moves within the area for the first time on its turn must succeed on a {@dc 15} Strength saving throw or be {@condition restrained} by the mucus for 1 minute. A {@condition restrained} creature can attempt this saving throw again at the end of each of its turns, ending the effect on itself on a success."
					]
				},
				{
					"name": "Acidic Spittle {@recharge 5}",
					"entries": [
						"Umbrafang vomits up a corrosive spittle in a 5-foot-wide, 30-foot-long line. Creatures caught in the line must succeed on a {@dc 16} Dexterity saving throw or take 21 ({@damage 6d6}) acid damage.",
						"If a creature who is wearing nonmagical armor fails this saving throw, the armor takes a permanent and cumulative -1 penalty to the AC it offers. Armor reduced to an AC of 10 or a shield that drops to a +0 bonus is destroyed.",
						"If Umbrafang uses this ability while it has a creature swallowed, the creature is vomited up along with the spittle, taking 10 ({@damage 3d6}) acid damage and landing {@condition prone} at the end of the 30-foot line. If the creature is wearing nonmagical armor, the AC it offers is immediately and permanently reduced by 1. If this would place the vomited creature in a space already occupied by another creature, the occupying creature must succeed on a {@dc 15} Dexterity throw or be pushed 5 feet and knocked {@condition prone}. On a successful save, the creature isn't knocked {@condition prone}."
					]
				}
			],
			"legendary": [
				{
					"name": "Tentacle Attack",
					"entries": [
						"Umbrafang makes a tentacle attack."
					]
				},
				{
					"name": "Fish's Flurry",
					"entries": [
						"Umbrafang moves up to half its movement speed without provoking opportunity attacks."
					]
				},
				{
					"name": "Digestion Glands (Costs 2 Actions)",
					"entries": [
						"Umbrafang recharges either its Acidic Spittle or Toxic Mucus"
					]
				}
			],
			"traitTags": [
				"Amphibious",
				"Legendary Resistances"
			],
			"senseTags": [
				"B"
			],
			"actionTags": [
				"Multiattack",
				"Swallow",
				"Tentacles"
			],
			"damageTags": [
				"A",
				"B",
				"I",
				"P"
			],
			"miscTags": [
				"AOE",
				"RCH"
			],
			"conditionInflict": [
				"blinded",
				"restrained"
			]
		},
		{
			"name": "Umbrafang (Lesser)",
			"isNamedCreature": true,
			"source": "",
			"page": 0,
			"size": [
				"H"
			],
			"type": "aberration",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 14,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 85,
				"formula": "9d12 + 27"
			},
			"speed": {
				"walk": 5,
				"swim": 40
			},
			"str": 16,
			"dex": 12,
			"con": 17,
			"int": 12,
			"wis": 16,
			"cha": 13,
			"save": {
				"str": "+6",
				"dex": "+4"
			},
			"senses": [
				"blindsight 60 ft."
			],
			"passive": 15,
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"charmed",
				"frightened",
				"poisoned"
			],
			"languages": [
				""
			],
			"cr": "3",
			"trait": [
				{
					"name": "Amphibious",
					"entries": [
						"Umbrafang can breathe air and water."
					]
				},
				{
					"name": "Creature of Legend",
					"entries": [
						"Umbrafang is a unique creature of legend. Its weapon attacks are magical, and it has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "Freedom of Movement",
					"entries": [
						"When in water, Umbrafang ignores difficult terrain, and magical effects can't reduce its speed or cause it to be {@condition restrained}. It can spend 5 feet of movement to escape from nonmagical restraints or being {@condition grappled}."
					]
				},
				{
					"name": "Toxic Aura",
					"entries": [
						"At the start of Umbrafang's turns, each creature within 5 feet of it takes 2 ({@damage 1d4}) poison damage."
					]
				},
				{
					"name": "Stagnant Protection",
					"entries": [
						"Umbrafang has advantage on Dexterity (Stealth) checks when in stagnant or still water. In addition, when underwater, it has a +2 bonus to its AC against attacks originating from out of or above water."
					]
				},
				{
					"name": "Powerful Swimmer",
					"entries": [
						"Umbrafang can move at full speed when grappling a single target. A target is pulled along by Umbrafang as it moves, and remain within 15 feet of it at all times."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Umbrafang makes two tentacle attacks, one of which it can replace with one use of Bite."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"Melee weapon attack: {@hit 5} to hit, reach 5ft., one target. {@h}8 ({@damage 1d8 + 3}) piercing damage. If the target is a Large or smaller creature {@condition grappled} by Umbrafang, that creature is swallowed, and the grapple ends. While swallowed, the creature is {@condition blinded} and {@condition restrained}, it has total cover against attacks and other effects outside Umbrafang and it takes 3 ({@damage 1d6}) acid damage at the start of each of Umbrafang's turns. Umbrafang can only have one target swallowed at a time. If Umbrafang dies, a swallowed creature is no longer {@condition restrained} and can escape from the corpse using 5 feet of movement."
					]
				},
				{
					"name": "Tentacle",
					"entries": [
						"Melee weapon attack: {@hit 5} to hit, reach 15 ft., one target.  {@h}5 ({@damage 1d4 + 3}) bludgeoning damage. If the target is Large or smaller it is {@condition grappled} (escape {@dc 15}). Until this grapple ends, the target is {@condition restrained}, and Umbrafang can't use that tentacle on another target.",
						"Umbrafang has 6 tentacles. Each can be used to grapple a different target."
					]
				},
				{
					"name": "Toxic Mucus (Out of Water Only, Recharge 5 - 6)",
					"entries": [
						"Umbrafang releases globules of sticky mucus from bulbous glands across its body, which scatter out from it in a 10-foot radius sphere. The mucus remains on the ground for 1 minute, or until washed away by 5 or more gallons of fresh water. A creature that starts its turn in the area or moves within the area for the first time on its turn must succeed on a {@dc 13} Strength saving throw or be {@condition restrained} by the mucus for 1 minute. A {@condition restrained} creature can attempt this saving throw again at the end of each of its turns, ending the effect on itself on a success."
					]
				},
				{
					"name": "Acidic Spittle {@recharge 5}",
					"entries": [
						"Umbrafang vomits out a corrosive spittle in a 5-foot-wide, 30-foot-long line. Creatures caught in the line must succeed on a {@dc 13} Dexterity saving throw or take 10 ({@damage 3d6}) acid damage.",
						"If a creature who is wearing nonmagical armor fails this saving throw, the armor takes a permanent and cumulative -1 penalty to the AC it offers. Armor reduced to an AC of 10 or a shield that drops to a +0 bonus is destroyed.",
						"If Umbrafang uses this ability while it has a creature swallowed, the creature is vomited up along with the spittle, taking 3 ({@damage 1d6}) acid damage and landing {@condition prone} at the end of the 30-foot line. If the creature is wearing nonmagical armor, the AC it offers is immediately and permanently reduced by 1. If this would place the vomited creature in a space already occupied by another creature, the occupying creature must succeed on a {@dc 13} Dexterity throw or be pushed 5 feet and knocked {@condition prone}. On a successful save, the creature isn't knocked {@condition prone}."
					]
				}
			],
			"legendary": [
				{
					"name": "",
					"entries": [
						"Umbrafang can take 1 legendary action, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Umbrafang regains spent legendary actions at the start of its turn."
					]
				},
				{
					"name": "Tentacle Attack",
					"entries": [
						"Umbrafang makes a tentacle attack."
					]
				},
				{
					"name": "Fish's Flurry",
					"entries": [
						"Umbrafang moves up to half its movement speed without provoking opportunity attacks."
					]
				}
			],
			"traitTags": [
				"Amphibious"
			],
			"senseTags": [
				"B"
			],
			"actionTags": [
				"Multiattack",
				"Swallow",
				"Tentacles"
			],
			"damageTags": [
				"A",
				"B",
				"I",
				"P"
			],
			"miscTags": [
				"AOE",
				"RCH"
			],
			"conditionInflict": [
				"blinded",
				"restrained"
			]
		}
	],
	"item": [
		{
			"name": "Deep Blade",
			"source": "",
			"page": 0,
			"baseitem": "longsword|PHB",
			"rarity": "rare",
			"bonusWeapon": "+1",
			"charges": 3,
			"entries": [
				"rare",
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Save DC 17, +2 to attack and damage rolls."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Illusion",
						"This rugged blade is crafted from the protruding spines of the deep dweller's grasping tendrils. While not overly sharp, the blade's serrated edge gives it a fearsome intimidating appearance. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Additionally, this sword has 3 charges and regains {@dice 1d3} charges each night at the stroke of midnight.",
						"When you hit a creature with this blade, you can expend 1 charge to force that creature to make a DC 15 Wisdom saving throw. On a failed save, the target's eyes are covered in an inky, magical darkness, and the target becomes {@condition blinded} for 1 minute. A {@condition blinded} creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success"
					]
				}
			]
		},
		{
			"name": "Deep Dweller Leather",
			"source": "",
			"page": 0,
			"baseItem": "leather armor|PHB",
			"type": "LA",
			"rarity": "none",
			"weight": 10,
			"ac": 11,
			"bonusAc": "+2",
			"entries": [
				"rare",
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Grants an additional +2 bonus to AC."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Illusion",
						"This thick leather armor settles on your body like a rubbery mass, protecting you from harm while remaining as light as a feather.",
						"While you are in {@quickref Vision and Light||2} or darkness, you are {@condition invisible} to creatures that are more than 30 feet away from you."
					]
				}
			]
		},
		{
			"name": "Deep Dweller Shield",
			"source": "",
			"page": 0,
			"baseItem": "shield|PHB",
			"type": "S",
			"rarity": "none",
			"weight": 6,
			"ac": 2,
			"bonusAc": "+1",
			"entries": [
				"uncommon",
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"While holding this shield, you have a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Illusion",
						"Once per day, you can use your action to slam the shield into the ground and cast {@spell darkness} at 2nd level. The magical darkness remains for 1 minute or until dispelled. Quiet screams and distant cries of terror can be heard emanating from within the spell's radius.",
						"This shield is made from wood covered in the thick leather hide of the deep dweller and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time."
					]
				}
			],
			"attachedSpells": [
				"darkness"
			]
		},
		{
			"name": "Deep Fang Daggers",
			"source": "",
			"page": 0,
			"baseItem": "dagger|PHB",
			"type": "M",
			"rarity": "none",
			"weight": 1,
			"weaponCategory": "simple",
			"property": [
				"F",
				"L",
				"T"
			],
			"range": "20/60",
			"dmg1": "1d4",
			"dmgType": "P",
			"bonusWeapon": "+2",
			"dagger": true,
			"weapon": true,
			"entries": [
				"rare (requires attunement)",
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Each dagger has a +2 bonus to attack and damage rolls."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Illusion",
						"This pair of daggers are carved from the fangs of the legendary deep dweller. Each dagger is a single piece; beginning with a smooth, sinewy handle and ending in a razor-sharp point.",
						"Each dagger deals an additional {@damage 1d4} psychic damage when you hit a creature with this magic weapon, or {@dice 1d6} additional psychic damage if you are wielding a deep fang dagger in each hand. Additionally, when you dual wield these daggers, they emit wistful echoes and shrieks when passing by each other. Any creature within 10 feet of you who can hear the shrieks has disadvantage on attack rolls against you unless they are immune to the {@condition frightened} condition."
					]
				}
			]
		},
		{
			"name": "Deepblood Poison",
			"source": "",
			"page": 0,
			"type": "P",
			"rarity": "rare",
			"entries": [
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Save DC 17"
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Enchantment",
						"This deadly vial contains a dark, thick poison that, when applied to an open wound or ingested, induces severe vomiting and hysteria.",
						"As an action, you can throw the vial towards a point you can see within 20 feet of you. Each creature within 5 feet of that point must succeed on a DC 15 Constitution saving throw, or become {@condition poisoned} for 1 minute. Alternatively, you can rub the poison directly into a creature's open wound by using your action to make a melee weapon attack against the target. On a successful hit, the target becomes {@condition poisoned}. A creature {@condition poisoned} by Deepblood Poison can't take reactions and must roll a {@dice d10} at the start of each of its turns to determine its behavior for that turn:",
						"The {@condition poisoned} creature can make a DC 15 Constitution saving throw at the end of its subsequent turns, ending the effect on itself on a success. A target automatically succeeds on this saving throw if it has all of its hit points, but automatically fails this saving throw if it instead ingests the poison, such as by consuming {@condition poisoned} food or drink. A creature so {@condition poisoned} (by ingestion) can only recover by way of lesser restoration or similar magic."
					]
				},
				{
					"type": "table",
					"colLabels": [
						"D10",
						"Result"
					],
					"colStyles": [
						"col-2 text-center",
						"col-4 text-left"
					],
					"rows": [
						[
							"1",
							"The target uses all its movement to run, screaming, in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The target doesn't take an action this turn."
						],
						[
							"2 - 6",
							"The target doesn't move or take an action this turn, instead spending its turn vomiting black blood profusely."
						],
						[
							"7 - 8",
							"The target uses its action to make a melee attack against a randomly determined creature within its reach, while rambling incoherently. If there is no creature within its reach, the creature instead targets its own features, such as nails, hands, hair or ears."
						],
						[
							"9 - 10",
							"The target moves and acts normally."
						]
					]
				}
			]
		},
		{
			"name": "Dweller Arrowhead",
			"source": "",
			"page": 0,
			"baseItem": "arrow|PHB",
			"type": "A",
			"rarity": "uncommon",
			"weight": 0.05,
			"bonusWeapon": "+1",
			"entries": [
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Save DC 17, +2 bonus to attack rolls."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Illusion",
						"This barbed arrow is carved from the remains of the deep dweller's tendril spines. You have a +1 bonus to attack and damage rolls made with this piece of magic ammunition. Once it hits a target, the ammunition is no longer magical. Additionally, if you hit a creature with more than one of these arrows in the same turn, the target must succeed on a DC 14 Wisdom saving throw or become {@condition blinded} for 1 minute as their eyes become infected with a magical darkness.",
						"A {@condition blinded} creature can repeat the saving throw at the end of each of its turns, ending the effect on a success."
					]
				}
			]
		},
		{
			"name": "Dweller Axe",
			"type": "GV",
			"requires": [
				{
					"axe": true
				}
			],
			"rarity": "rare",
			"inherits": {
				"namePrefix": "Dweller Axe ",
				"source": "",
				"page": 0,
				"reqAttune": true,
				"bonusWeapon": "+1",
				"recharge": "dawn",
				"rechargeAmount": "{@dice 1d3}",
				"charges": 3,
				"entries": [
					{
						"type": "entries",
						"name": "Adult Properties:",
						"entries": [
							"Save DC 17, {=bonusWeapon} to attack and damage rolls."
						]
					},
					{
						"type": "entries",
						"name": "School of Magic:",
						"entries": [
							"Illusion",
							"This axe sports a fearsome and intimidating serrated head, forged from the spines of a deep dweller tentacle. You have a {=bonusWeapon} bonus to attack and damage rolls with this weapon, and it deals an additional {@damage 1d6} slashing damage on a successful hit. Additionally, the weapon has 3 charges. It regains {@dice 1d3} charges daily at dawn. When you hit a creature that doesn't have all its hit points with this weapon, you can expend 1 charge to force it to make a DC 14 Wisdom saving throw. On a failed save, the target is {@condition blinded} for 1 minute. A {@condition blinded} target can attempt the saving throw again at the end of each of its following turns, ending the effect on a success."
						]
					}
				]
			},
			"__prop": "magicvariant"
		}
		,
		{
			"name": "Dweller Skin Coating",
			"source": "",
			"page": 0,
			"rarity": "very rare",
			"entries": [
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Grants the interior crew immunity to psychic damage, instead of resistance."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Abjuration",
						"This upgrade coats a ship's hull in a jet-black coat of powdered deep dweller flesh. The hull and other components of the ship are immune to lightning damage. Crew inside the ship have resistance to psychic damage, and advantage on saving throws made to resist mind-altering spells and other magical effects.",
						"This feature doesn't extend to crew in the crow's nest, or on deck, only to those inside the ship itself."
					]
				}
			]
		},
		{
			"name": "Grasping Fluid",
			"source": "",
			"page": 0,
			"type": "P",
			"rarity": "uncommon",
			"entries": [
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Heals {@dice 4d4 + 4} and {@dice 4d8 + 8} respectively."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Evocation",
						"This thick, clear gel can be applied to an open wound, forming a protective, binding seal over the wound that prevents blood loss and accelerates healing. A single vial contains three doses. As an action, one dose can be applied to the skin.",
						"The creature that receives it regains {@dice 2d4 + 4} hit points. The gel is more effective at promoting recovery if a body is resting. If applied during a short rest, the creature instead regains {@dice 2d8 + 8} hit points.",
						"If applied to a creature who is dying, the gel stabilizes the creature immediately, but they remain {@condition unconscious} until awoken by other stimuli. How many hit points the {@condition unconscious} creature regains depends on how long they are allowed to rest. If the creature awakens in less than an hour they get {@dice 2d4 + 4} hit points, whereas if it is an hour or more they awaken with {@dice 2d8 + 8} hit points instead."
					]
				}
			]
		},
		{
			"name": "Medicinal Tape",
			"source": "",
			"page": 0,
			"wondrous": true,
			"rarity": "rare",
			"entries": [
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"Tape can be re-used once. Covers 10 x 10 ft."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Enchantment",
						"A small roll of thin, porous material, crafted from the suckers of a deep dweller tentacle. You can spend ten minutes to unravel the tape and bandage a {@condition poisoned}, {@condition petrified}, or diseased creature. The target creature's condition is slowly absorbed into the material over the course of {@dice 1d4} hours. Once absorbed, the tape is destroyed and can no longer be used, and the condition ends on that creature.",
						"There is enough tape on the roll to cover a 5 ft x 5 ft area."
					]
				}
			]
		},
		{
			"name": "Mindspike Potion",
			"source": "",
			"page": 0,
			"type": "P",
			"rarity": "rare",
			"entries": [
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"You can also cast the {@spell sending} spell without requiring components, however the potion's effect ends after the spell is cast."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Enchantment",
						"This potion glows with a dim, green hue when held towards the light. When poured, it has the consistency of water, but moves as a single, ooze-like entity. When you drink this potion, you gain advantage on Intelligence ability checks and Intelligence saving throws for 1 hour.",
						"Additionally, for the duration you can cast the {@spell message} cantrip without requiring components."
					]
				}
			],
			"attachedSpells": [
				"sending",
				"message"
			]
		},
		{
			"name": "Notched Dweller Whip",
			"source": "",
			"page": 0,
			"baseItem": "whip|PHB",
			"type": "M",
			"rarity": "rare",
			"weight": 3,
			"weaponCategory": "martial",
			"property": [
				"F",
				"R"
			],
			"dmg1": "1d4",
			"dmgType": "S",
			"bonusWeapon": "+1",
			"weapon": true,
			"entries": [
				"(requires attunement)",
				{
					"type": "entries",
					"name": "Adult Properties:",
					"entries": [
						"+2 bonus to attack and damage rolls."
					]
				},
				{
					"type": "entries",
					"name": "School of Magic:",
					"entries": [
						"Illusion",
						"A whip, made from hardened leather and layered with hooked spines crafted from a deep dweller fang. The whip is black and rubbery in texture, and appears to twitch slightly when unsheathed.",
						"You have a +1 bonus to attack and damage rolls with this weapon, and it deals an additional {@damage 1d4} psychic damage on a hit.",
						"As an action you can begin spinning the whip around you, and if you concentrate on the whip as if concentrating on a spell, it will continue spinning around you for the next minute even after you let go of it. For this duration the whip emits a haunting shriek that can be heard out to 100 feet, and the first time a hostile creature comes within 10 feet of you or starts its turn there, it takes {@damage 4d4} psychic damage.",
						"Once you use this feature, you can't use it again in this way again until you finish a long rest."
					]
				}
			]
		}
	],
	"spell": [
		
	]
}